{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0WwzvmEwh5Vluxvbh36mMv/clip_422600_492400.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 20: 1-2, 11-18 - 'Mary, go and find the brothers and tell them.'  Catechism of the Catholic Church Paragraphs: - 640-641 (in 'The Empty Tomb') - Why do you seek the living among the dead? He is not here, but has risen.\" The first element we encounter in the framework of the Easter events is the empty tomb. In itself it is not a direct proof of Resurrection; the absence of Christ's body from the tomb could be explained otherwise. Nonetheless the empty tomb was still an essential sign for all. Its discovery by the disciples was the first step toward recognizing the very fact of the Resurrection. This was the case, first with the holy women, and then with Peter...Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ's Resurrection for the apostles themselves (abbreviated). - 645 (in 'The Condition of Christ's risen humanity) - By means of touch and the sharing of a meal, the risen Jesus establishes direct contact with his disciples. He invites them in this way to recognize that he is not a ghost and above all to verify that the risen body in which he appears to them is the same body that had been tortured and crucified, for it still bears the traces of his Passion. Yet at the same time this authentic, real body possesses the new properties of a glorious body: not limited by space and time but able to be present how and when he wills; for Christ's humanity can no longer be confined to earth, and belongs henceforth only to the Father's divine realm. For this reason too the risen Jesus enjoys the sovereign freedom of appearing as he wishes: in the guise of a gardener or in other forms familiar to his disciples, precisely to awaken their faith. - 443 (in 'The Only Son of God') - He distinguished his sonship from that of his disciples by never saying \"our Father\", except to command them: \"You, then, pray like this: 'Our Father'\", and he emphasized this distinction, saying \"my Father and your Father\" (abbreviated). - 654 (in 'The Meaning and Saving Significance of the Resurrection') - Justification consists in both victory over the death caused by sin and a new participation in grace. It brings about filial adoption so that men become Christ's brethren, as Jesus himself called his disciples after his Resurrection: \"Go and tell my brethren.\" We are brethren not by nature, but by the gift of grace, because that adoptive filiation gains us a real share in the life of the only Son, which was fully revealed in his Resurrection (abbreviated). - 660 (in 'He ascended into Heaven and is seated at the right hand of the Father') - The veiled character of the glory of the Risen One during this time is intimated in his mysterious words to Mary Magdalene: \"I have not yet ascended to the Father; but go to my brethren and say to them, I am ascending to my Father and your Father, to my God and your God. \"This indicates a difference in manifestation between the glory of the risen Christ and that of the Christ exalted to the Father's right hand, a transition marked by the historical and transcendent event of the Ascension. - 2795 (in 'Who art in Heaven') - In Christ, then, heaven and earth are reconciled, for the Son alone \"descended from heaven\" and causes us to ascend there with him, by his Cross, Resurrection, and Ascension (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1401904,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/03XkdIQzlg9mOaDnVDQvzn"
    },
    "href": "https://api.spotify.com/v1/episodes/03XkdIQzlg9mOaDnVDQvzn",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 20: 1-2, 11-18 - &#39;Mary, go and find the brothers and tell them.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 640-641 (in &#39;The Empty Tomb&#39;) - Why do you seek the living among the dead? He is not here, but has risen.&#34; The first element we encounter in the framework of the Easter events is the empty tomb. In itself it is not a direct proof of Resurrection; the absence of Christ&#39;s body from the tomb could be explained otherwise. Nonetheless the empty tomb was still an essential sign for all. Its discovery by the disciples was the first step toward recognizing the very fact of the Resurrection. This was the case, first with the holy women, and then with Peter...Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ&#39;s Resurrection for the apostles themselves (abbreviated).</p><br/><p>- 645 (in &#39;The Condition of Christ&#39;s risen humanity) - By means of touch and the sharing of a meal, the risen Jesus establishes direct contact with his disciples. He invites them in this way to recognize that he is not a ghost and above all to verify that the risen body in which he appears to them is the same body that had been tortured and crucified, for it still bears the traces of his Passion. Yet at the same time this authentic, real body possesses the new properties of a glorious body: not limited by space and time but able to be present how and when he wills; for Christ&#39;s humanity can no longer be confined to earth, and belongs henceforth only to the Father&#39;s divine realm. For this reason too the risen Jesus enjoys the sovereign freedom of appearing as he wishes: in the guise of a gardener or in other forms familiar to his disciples, precisely to awaken their faith.</p><br/><p>- 443 (in &#39;The Only Son of God&#39;) - He distinguished his sonship from that of his disciples by never saying &#34;our Father&#34;, except to command them: &#34;You, then, pray like this: &#39;Our Father&#39;&#34;, and he emphasized this distinction, saying &#34;my Father and your Father&#34; (abbreviated).</p><br/><p>- 654 (in &#39;The Meaning and Saving Significance of the Resurrection&#39;) - Justification consists in both victory over the death caused by sin and a new participation in grace. It brings about filial adoption so that men become Christ&#39;s brethren, as Jesus himself called his disciples after his Resurrection: &#34;Go and tell my brethren.&#34; We are brethren not by nature, but by the gift of grace, because that adoptive filiation gains us a real share in the life of the only Son, which was fully revealed in his Resurrection (abbreviated).</p><br/><p>- 660 (in &#39;He ascended into Heaven and is seated at the right hand of the Father&#39;) - The veiled character of the glory of the Risen One during this time is intimated in his mysterious words to Mary Magdalene: &#34;I have not yet ascended to the Father; but go to my brethren and say to them, I am ascending to my Father and your Father, to my God and your God. &#34;This indicates a difference in manifestation between the glory of the risen Christ and that of the Christ exalted to the Father&#39;s right hand, a transition marked by the historical and transcendent event of the Ascension.</p><br/><p>- 2795 (in &#39;Who art in Heaven&#39;) - In Christ, then, heaven and earth are reconciled, for the Son alone &#34;descended from heaven&#34; and causes us to ascend there with him, by his Cross, Resurrection, and Ascension (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "03XkdIQzlg9mOaDnVDQvzn",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of Saint Mary Magdalene - John 20: 1-2, 11-18",
    "release_date": "2023-07-21",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:03XkdIQzlg9mOaDnVDQvzn"
}