{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7gpFlzf6DoWBcSQZjPp857/clip_723000_774300.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 12: 49-53 - 'How I wish it were blazing already!'  Catechism of the Catholic Church Paragraphs: - 696 (in 'Symbols of the Holy Spirit') - Fire. While water signifies birth and the fruitfulness of life given in the Holy Spirit, fire symbolizes the transforming energy of the Holy Spirit's actions. the prayer of the prophet Elijah, who \"arose like fire\" and whose \"word burned like a torch,\" brought down fire from heaven on the sacrifice on Mount Carmel. This event was a \"figure\" of the fire of the Holy Spirit, who transforms what he touches. John the Baptist, who goes \"before [the Lord] in the spirit and power of Elijah,\" proclaims Christ as the one who \"will baptize you with the Holy Spirit and with fire.\" Jesus will say of the Spirit: \"I came to cast fire upon the earth; and would that it were already kindled!\" In the form of tongues \"as of fire,\" the Holy Spirit rests on the disciples on the morning of Pentecost and fills them with himself The spiritual tradition has retained this symbolism of fire as one of the most expressive images of the Holy Spirit's actions. \"Do not quench the Spirit.\" - 536 (in 'The Baptism of Jesus') - The baptism of Jesus is on his part the acceptance and inauguration of his mission as God's suffering Servant. He allows himself to be numbered among sinners; he is already \"the Lamb of God, who takes away the sin of the world\". Already he is anticipating the \"baptism\" of his bloody death (abbreviated). - 607 (in 'Christ's whole life is an offering to the Father') - The desire to embrace his Father's plan of redeeming love inspired Jesus' whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, \"and what shall I say? 'Father, save me from this hour'? No, for this purpose I have come to this hour (abbreviated). - 1225 (in 'Christ's Baptism') - In his Passover Christ opened to all men the fountain of Baptism. He had already spoken of his Passion, which he was about to suffer in Jerusalem, as a \"Baptism\" with which he had to be baptized. The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible \"to be born of water and the Spirit\" in order to enter the Kingdom of God - 2804 (in 'The Seven Petitions') - The first series of petitions carries us toward him, for his own sake: thy name, thy kingdom, thy will! It is characteristic of love to think first of the one whom we love. In none of the three petitions do we mention ourselves; the burning desire, even anguish, of the beloved Son for his Father's glory seizes us (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1194109,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/07T599fYopAdMlYTz3Z11d"
    },
    "href": "https://api.spotify.com/v1/episodes/07T599fYopAdMlYTz3Z11d",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 12: 49-53 - &#39;How I wish it were blazing already!&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 696 (in &#39;Symbols of the Holy Spirit&#39;) - Fire. While water signifies birth and the fruitfulness of life given in the Holy Spirit, fire symbolizes the transforming energy of the Holy Spirit&#39;s actions. the prayer of the prophet Elijah, who &#34;arose like fire&#34; and whose &#34;word burned like a torch,&#34; brought down fire from heaven on the sacrifice on Mount Carmel. This event was a &#34;figure&#34; of the fire of the Holy Spirit, who transforms what he touches. John the Baptist, who goes &#34;before [the Lord] in the spirit and power of Elijah,&#34; proclaims Christ as the one who &#34;will baptize you with the Holy Spirit and with fire.&#34; Jesus will say of the Spirit: &#34;I came to cast fire upon the earth; and would that it were already kindled!&#34; In the form of tongues &#34;as of fire,&#34; the Holy Spirit rests on the disciples on the morning of Pentecost and fills them with himself The spiritual tradition has retained this symbolism of fire as one of the most expressive images of the Holy Spirit&#39;s actions. &#34;Do not quench the Spirit.&#34;</p><br/><p>- 536 (in &#39;The Baptism of Jesus&#39;) - The baptism of Jesus is on his part the acceptance and inauguration of his mission as God&#39;s suffering Servant. He allows himself to be numbered among sinners; he is already &#34;the Lamb of God, who takes away the sin of the world&#34;. Already he is anticipating the &#34;baptism&#34; of his bloody death (abbreviated).</p><br/><p>- 607 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The desire to embrace his Father&#39;s plan of redeeming love inspired Jesus&#39; whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, &#34;and what shall I say? &#39;Father, save me from this hour&#39;? No, for this purpose I have come to this hour (abbreviated).</p><br/><p>- 1225 (in &#39;Christ&#39;s Baptism&#39;) - In his Passover Christ opened to all men the fountain of Baptism. He had already spoken of his Passion, which he was about to suffer in Jerusalem, as a &#34;Baptism&#34; with which he had to be baptized. The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible &#34;to be born of water and the Spirit&#34; in order to enter the Kingdom of God</p><br/><p>- 2804 (in &#39;The Seven Petitions&#39;) - The first series of petitions carries us toward him, for his own sake: thy name, thy kingdom, thy will! It is characteristic of love to think first of the one whom we love. In none of the three petitions do we mention ourselves; the burning desire, even anguish, of the beloved Son for his Father&#39;s glory seizes us (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "07T599fYopAdMlYTz3Z11d",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 29 in Ordinary Time - Luke 12: 49-53",
    "release_date": "2023-10-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:07T599fYopAdMlYTz3Z11d"
}