{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4eXn08P3g8AKNETqSXphrT/clip_589971_649971.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 12: 30-33 - 'If a grain of wheat falls on the ground and dies, it yields a rich harvest.'  Catechism of the Catholic Church Paragraphs: - 2731 (in 'Facing Difficulties in Prayer') - Another difficulty, especially for those who sincerely want to pray, is dryness. Dryness belongs to contemplative prayer when the heart is separated from God, with no taste for thoughts, memories, and feelings, even spiritual ones. This is the moment of sheer faith clinging faithfully to Jesus in his agony and in his tomb. \"Unless a grain of wheat falls into the earth and dies, it remains alone; but if dies, it bears much fruit.\" If dryness is due to the lack of roots, because the word has fallen on rocky soil, the battle requires conversion. - 607 (in 'Christ's whole life is an offering to the Father') - The desire to embrace his Father's plan of redeeming love inspired Jesus' whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, \"and what shall I say? 'Father, save me from this hour'? No, for this purpose I have come to this hour\" (abbreviated). - 550 (in 'The Signs of the Kingdom of God') - The coming of God's kingdom means the defeat of Satan's: \"If it is by the Spirit of God that I cast out demons, then the kingdom of God has come upon you.\" Jesus' exorcisms free some individuals from the domination of demons. They anticipate Jesus' great victory over \"the ruler of this world\". The kingdom of God will be definitively established through Christ's cross: \"God reigned from the wood.\" - 2853 (in 'But Deliver us from Evil') - Victory over the \"prince of this world\" was won once for all at the Hour when Jesus freely gave himself up to death to give us his life. This is the judgment of this world, and the prince of this world is \"cast out\" (abbreviated). - 542 (in 'The Kingdom of God is at hand') - Christ stands at the heart of this gathering of men into the \"family of God\". By his word, through signs that manifest the reign of God, and by sending out his disciples, Jesus calls all people to come together around him. But above all in the great Paschal mystery - his death on the cross and his Resurrection - he would accomplish the coming of his kingdom. \"and I, when I am lifted up from the earth, will draw all men to myself.\" Into this union with Christ all men are called. - 786 (in 'A Priestly, prophetic and royal people') - Finally, the People of God shares in the royal office of Christ. He exercises his kingship by drawing all men to himself through his death and Resurrection. Christ, King and Lord of the universe, made himself the servant of all, for he came \"not to be served but to serve, and to give his life as a ransom for many\" (abbreviated). - 2795 (in 'Who Art in Heaven') - The symbol of the heavens refers us back to the mystery of the covenant we are living when we pray to our Father. He is in heaven, his dwelling place; the Father's house is our homeland. Sin has exiled us from the land of the covenant, but conversion of heart enables us to return to the Father, to heaven. In Christ, then, heaven and earth are reconciled, for the Son alone \"descended from heaven\" and causes us to ascend there with him, by his Cross, Resurrection, and Ascension. - 363 (in 'Body and Soul but Truly One') - 662 (in 'He Ascended into Heaven and is seated at the right hand of the Father') - 1428 (in 'The Conversion of the Baptised')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2225749,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0BrVC5W9XTUqrTylh5zKtH"
    },
    "href": "https://api.spotify.com/v1/episodes/0BrVC5W9XTUqrTylh5zKtH",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 12: 30-33 - &#39;If a grain of wheat falls on the ground and dies, it yields a rich harvest.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2731 (in &#39;Facing Difficulties in Prayer&#39;) - Another difficulty, especially for those who sincerely want to pray, is dryness. Dryness belongs to contemplative prayer when the heart is separated from God, with no taste for thoughts, memories, and feelings, even spiritual ones. This is the moment of sheer faith clinging faithfully to Jesus in his agony and in his tomb. &#34;Unless a grain of wheat falls into the earth and dies, it remains alone; but if dies, it bears much fruit.&#34; If dryness is due to the lack of roots, because the word has fallen on rocky soil, the battle requires conversion.</p><br/><p>- 607 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The desire to embrace his Father&#39;s plan of redeeming love inspired Jesus&#39; whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, &#34;and what shall I say? &#39;Father, save me from this hour&#39;? No, for this purpose I have come to this hour&#34; (abbreviated).</p><br/><p>- 550 (in &#39;The Signs of the Kingdom of God&#39;) - The coming of God&#39;s kingdom means the defeat of Satan&#39;s: &#34;If it is by the Spirit of God that I cast out demons, then the kingdom of God has come upon you.&#34; Jesus&#39; exorcisms free some individuals from the domination of demons. They anticipate Jesus&#39; great victory over &#34;the ruler of this world&#34;. The kingdom of God will be definitively established through Christ&#39;s cross: &#34;God reigned from the wood.&#34;</p><br/><p>- 2853 (in &#39;But Deliver us from Evil&#39;) - Victory over the &#34;prince of this world&#34; was won once for all at the Hour when Jesus freely gave himself up to death to give us his life. This is the judgment of this world, and the prince of this world is &#34;cast out&#34; (abbreviated).</p><br/><p>- 542 (in &#39;The Kingdom of God is at hand&#39;) - Christ stands at the heart of this gathering of men into the &#34;family of God&#34;. By his word, through signs that manifest the reign of God, and by sending out his disciples, Jesus calls all people to come together around him. But above all in the great Paschal mystery - his death on the cross and his Resurrection - he would accomplish the coming of his kingdom. &#34;and I, when I am lifted up from the earth, will draw all men to myself.&#34; Into this union with Christ all men are called.</p><br/><p>- 786 (in &#39;A Priestly, prophetic and royal people&#39;) - Finally, the People of God shares in the royal office of Christ. He exercises his kingship by drawing all men to himself through his death and Resurrection. Christ, King and Lord of the universe, made himself the servant of all, for he came &#34;not to be served but to serve, and to give his life as a ransom for many&#34; (abbreviated).</p><br/><p>- 2795 (in &#39;Who Art in Heaven&#39;) - The symbol of the heavens refers us back to the mystery of the covenant we are living when we pray to our Father. He is in heaven, his dwelling place; the Father&#39;s house is our homeland. Sin has exiled us from the land of the covenant, but conversion of heart enables us to return to the Father, to heaven. In Christ, then, heaven and earth are reconciled, for the Son alone &#34;descended from heaven&#34; and causes us to ascend there with him, by his Cross, Resurrection, and Ascension.</p><br/><p>- 363 (in &#39;Body and Soul but Truly One&#39;)</p><br/><p>- 662 (in &#39;He Ascended into Heaven and is seated at the right hand of the Father&#39;)</p><br/><p>- 1428 (in &#39;The Conversion of the Baptised&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0BrVC5W9XTUqrTylh5zKtH",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "5th Sunday of Lent (Year B) - John 12: 20-33",
    "release_date": "2021-03-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0BrVC5W9XTUqrTylh5zKtH"
}