{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6cXkTzAcoxP24awIcsLgkM/clip_515084_575084.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 10: 17-30 - 'Give everything you own to the poor, and follow me.'  Catechism of the Catholic Church Paragraphs: - 1858 (in 'The Gravity of Sin: Mortal and Venial Sin') - Grave matter is specified by the Ten Commandments, corresponding to the answer of Jesus to the rich young man: \"Do not kill, Do not commit adultery, Do not steal, Do not bear false witness, Do not defraud, Honor your father and your mother.\" The gravity of sins is more or less great: murder is graver than theft. One must also take into account who is wronged: violence against parents is in itself graver than violence against a stranger. - 2728 (in 'Objections to Prayer') - Finally, our battle has to confront what we experience as failure in prayer: discouragement during periods of dryness; sadness that, because we have \"great possessions,\" we have not given all to the Lord; disappointment over not being heard according to our own will; wounded pride, stiffened by the indignity that is ours as sinners; our resistance to the idea that prayer is a free and unmerited gift; and so forth. the conclusion is always the same: what good does it do to pray? To overcome these obstacles, we must battle to gain humility, trust, and perseverance. - 1618 (in 'Virginity for the Sake of the Kingdom') - Christ is the center of all Christian life. the bond with him takes precedence over all other bonds, familial or social. From the very beginning of the Church there have been men and women who have renounced the great good of marriage to follow the Lamb wherever he goes, to be intent on the things of the Lord, to seek to please him, and to go out to meet the Bridegroom who is coming (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2573560,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0bs20HGLpl7cMHWkPRZwwQ"
    },
    "href": "https://api.spotify.com/v1/episodes/0bs20HGLpl7cMHWkPRZwwQ",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 10: 17-30 - &#39;Give everything you own to the poor, and follow me.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1858 (in &#39;The Gravity of Sin: Mortal and Venial Sin&#39;) - Grave matter is specified by the Ten Commandments, corresponding to the answer of Jesus to the rich young man: &#34;Do not kill, Do not commit adultery, Do not steal, Do not bear false witness, Do not defraud, Honor your father and your mother.&#34; The gravity of sins is more or less great: murder is graver than theft. One must also take into account who is wronged: violence against parents is in itself graver than violence against a stranger.</p><br/><p>- 2728 (in &#39;Objections to Prayer&#39;) - Finally, our battle has to confront what we experience as failure in prayer: discouragement during periods of dryness; sadness that, because we have &#34;great possessions,&#34; we have not given all to the Lord; disappointment over not being heard according to our own will; wounded pride, stiffened by the indignity that is ours as sinners; our resistance to the idea that prayer is a free and unmerited gift; and so forth. the conclusion is always the same: what good does it do to pray? To overcome these obstacles, we must battle to gain humility, trust, and perseverance.</p><br/><p>- 1618 (in &#39;Virginity for the Sake of the Kingdom&#39;) - Christ is the center of all Christian life. the bond with him takes precedence over all other bonds, familial or social. From the very beginning of the Church there have been men and women who have renounced the great good of marriage to follow the Lamb wherever he goes, to be intent on the things of the Lord, to seek to please him, and to go out to meet the Bridegroom who is coming (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0bs20HGLpl7cMHWkPRZwwQ",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "28th Sunday in Ordinary Time (Year B) - Mark 10: 17-30",
    "release_date": "2021-10-09",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0bs20HGLpl7cMHWkPRZwwQ"
}