{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4J1XQBU6QrKkT9v4wXBbxJ/clip_417800_466100.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 16: 12-15 - 'The Spirit of truth will lead you to the complete truth.'  Catechism of the Catholic Church Paragraphs: - 221 (in 'God is Love') - God's very being is love. By sending his only Son and the Spirit of Love in the fullness of time, God has revealed his innermost secret: God himself is an eternal exchange of love, Father, Son and Holy Spirit, and he has destined us to share in that exchange (abbreviated). - 91 (in 'The Supernatural Sense of Faith') - All the faithful share in understanding and handing on revealed truth. They have received the anointing of the Holy Spirit, who instructs them and guides them into all truth. - 243-244 (in 'The Father and the Son revealed by the Spirit') - Before his Passover, Jesus announced the sending of \"another Paraclete\" (Advocate), the Holy Spirit. At work since creation, having previously \"spoken through the prophets\", the Spirit will now be with and in the disciples, to teach them and guide them \"into all the truth\". The Holy Spirit is thus revealed as another divine person with Jesus and the Father. The eternal origin of the Holy Spirit is revealed in his mission in time. the Spirit is sent to the apostles and to the Church both by the Father in the name of the Son, and by the Son in person, once he had returned to the Father. The sending of the person of the Spirit after Jesus' glorification reveals in its fullness the mystery of the Holy Trinity. - 687 (in 'I Believe in the Holy Spirit') - \"No one comprehends the thoughts of God except the Spirit of God.\" Now God's Spirit, who reveals God, makes known to us Christ, his Word, his living Utterance, but the Spirit does not speak of himself. the Spirit who \"has spoken through the prophets\" makes us hear the Father's Word, but we do not hear the Spirit himself. We know him only in the movement by which he reveals the Word to us and disposes us to welcome him in faith. the Spirit of truth who \"unveils\" Christ to us \"will not speak on his own.\" Such properly divine self-effacement explains why \"the world cannot receive (him), because it neither sees him nor knows him,\" while those who believe in Christ know the Spirit because he dwells with them. - 1117 (in 'The Sacraments of the Church') - As she has done for the canon of Sacred Scripture and for the doctrine of the faith, the Church, by the power of the Spirit who guides her \"into all truth,\" has gradually recognized this treasure received from Christ and, as the faithful steward of God's mysteries, has determined its \"dispensation.\" Thus the Church has discerned over the centuries that among liturgical celebrations there are seven that are, in the strict sense of the term, sacraments instituted by the Lord. - 2466 (in 'Living in the Truth') - To follow Jesus is to live in \"the Spirit of truth,\" whom the Father sends in his name and who leads \"into all the truth\" (abbreviated). - 485 (in 'Conceived by the Power of the Holy Spirit') - The mission of the Holy Spirit is always conjoined and ordered to that of the Son (abbreviated). - 690 (in 'The Joint Mission of the Son and the Spirit')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1105362,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0eM7cR1RROU4UCiU4V8CsU"
    },
    "href": "https://api.spotify.com/v1/episodes/0eM7cR1RROU4UCiU4V8CsU",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 16: 12-15 - &#39;The Spirit of truth will lead you to the complete truth.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 221 (in &#39;God is Love&#39;) - God&#39;s very being is love. By sending his only Son and the Spirit of Love in the fullness of time, God has revealed his innermost secret: God himself is an eternal exchange of love, Father, Son and Holy Spirit, and he has destined us to share in that exchange (abbreviated).</p><br/><p>- 91 (in &#39;The Supernatural Sense of Faith&#39;) - All the faithful share in understanding and handing on revealed truth. They have received the anointing of the Holy Spirit, who instructs them and guides them into all truth.</p><br/><p>- 243-244 (in &#39;The Father and the Son revealed by the Spirit&#39;) - Before his Passover, Jesus announced the sending of &#34;another Paraclete&#34; (Advocate), the Holy Spirit. At work since creation, having previously &#34;spoken through the prophets&#34;, the Spirit will now be with and in the disciples, to teach them and guide them &#34;into all the truth&#34;. The Holy Spirit is thus revealed as another divine person with Jesus and the Father. The eternal origin of the Holy Spirit is revealed in his mission in time. the Spirit is sent to the apostles and to the Church both by the Father in the name of the Son, and by the Son in person, once he had returned to the Father. The sending of the person of the Spirit after Jesus&#39; glorification reveals in its fullness the mystery of the Holy Trinity.</p><br/><p>- 687 (in &#39;I Believe in the Holy Spirit&#39;) - &#34;No one comprehends the thoughts of God except the Spirit of God.&#34; Now God&#39;s Spirit, who reveals God, makes known to us Christ, his Word, his living Utterance, but the Spirit does not speak of himself. the Spirit who &#34;has spoken through the prophets&#34; makes us hear the Father&#39;s Word, but we do not hear the Spirit himself. We know him only in the movement by which he reveals the Word to us and disposes us to welcome him in faith. the Spirit of truth who &#34;unveils&#34; Christ to us &#34;will not speak on his own.&#34; Such properly divine self-effacement explains why &#34;the world cannot receive (him), because it neither sees him nor knows him,&#34; while those who believe in Christ know the Spirit because he dwells with them.</p><br/><p>- 1117 (in &#39;The Sacraments of the Church&#39;) - As she has done for the canon of Sacred Scripture and for the doctrine of the faith, the Church, by the power of the Spirit who guides her &#34;into all truth,&#34; has gradually recognized this treasure received from Christ and, as the faithful steward of God&#39;s mysteries, has determined its &#34;dispensation.&#34; Thus the Church has discerned over the centuries that among liturgical celebrations there are seven that are, in the strict sense of the term, sacraments instituted by the Lord.</p><br/><p>- 2466 (in &#39;Living in the Truth&#39;) - To follow Jesus is to live in &#34;the Spirit of truth,&#34; whom the Father sends in his name and who leads &#34;into all the truth&#34; (abbreviated).</p><br/><p>- 485 (in &#39;Conceived by the Power of the Holy Spirit&#39;) - The mission of the Holy Spirit is always conjoined and ordered to that of the Son (abbreviated).</p><br/><p>- 690 (in &#39;The Joint Mission of the Son and the Spirit&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0eM7cR1RROU4UCiU4V8CsU",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of the Most Holy Trinity (Year C) - John 16: 12-15",
    "release_date": "2022-06-11",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0eM7cR1RROU4UCiU4V8CsU"
}