{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1rlmUbJ8qMEoAWF1iVWZbU/clip_427236_487236.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 15: 9-17 -'You are my friends if you do what I command you.'  Catechism of the Catholic Church Paragraphs: - 1823-1824 (in 'Charity') - Jesus makes charity the new commandment. By loving his own \"to the end,\" he makes manifest the Father's love which he receives. By loving one another, the disciples imitate the love of Jesus which they themselves receive. Whence Jesus says: \"As the Father has loved me, so have I loved you; abide in my love.\" and again: \"This is my commandment, that you love one another as I have loved you.\" Fruit of the Spirit and fullness of the Law, charity keeps the commandments of God and his Christ: \"Abide in my love. If you keep my commandments, you will abide in my love.\" - 1970 (in 'The New Law') - The entire Law of the Gospel is contained in the \"new commandment\" of Jesus, to love one another as he has loved us (abbreviated). - 609 (in 'Jesus freely embraced the Father's redeeming love') - By embracing in his human heart the Father's love for men, Jesus \"loved them to the end\", for \"greater love has no man than this, that a man lay down his life for his friends.\" In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: \"No one takes [my life] from me, but I lay it down of my own accord.\" Hence the sovereign freedom of God's Son as he went out to his death. - 1972 (in 'The New Law') - The New Law is called a law of love because it makes us act out of the love infused by the Holy Spirit, rather than from fear; a law of grace, because it confers the strength of grace to act, by means of faith and the sacraments; a law of freedom, because it sets us free from the ritual and juridical observances of the Old Law, inclines us to act spontaneously by the prompting of charity and, finally, lets us pass from the condition of a servant who \"does not know what his master is doing\" to that of a friend of Christ - \"For all that I have heard from my Father I have made known to you\" - or even to the status of son and heir. - 2347 (in 'The Integrality of the gift of self') - The virtue of chastity blossoms in friendship. It shows the disciple how to follow and imitate him who has chosen us as his friends, who has given himself totally to us and allows us to participate in his divine estate. Chastity is a promise of immortality. Chastity is expressed notably in friendship with one's neighbor. Whether it develops between persons of the same or opposite sex, friendship represents a great good for all. It leads to spiritual communion. - 459 (in 'Why did the Word become Flesh') - Jesus is the model for the Beatitudes and the norm of the new law: \"Love one another as I have loved you.\" This love implies an effective offering of oneself, after his example (abbreviated). - 737 (in 'The Holy Spirit and the Church') - He makes present the mystery of Christ, supremely in the Eucharist, in order to reconcile them, to bring them into communion with God, that they may \"bear much fruit\" (abbreviated). - 2074 (in 'The Decalogue and the Natural Law') - 2745 (in 'Persevering in Love') - 2615 (in 'Jesus teaches us how to pray')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1460721,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0ey2Ml44Hh87PM2T1U5cXM"
    },
    "href": "https://api.spotify.com/v1/episodes/0ey2Ml44Hh87PM2T1U5cXM",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 15: 9-17 -&#39;You are my friends if you do what I command you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1823-1824 (in &#39;Charity&#39;) - Jesus makes charity the new commandment. By loving his own &#34;to the end,&#34; he makes manifest the Father&#39;s love which he receives. By loving one another, the disciples imitate the love of Jesus which they themselves receive. Whence Jesus says: &#34;As the Father has loved me, so have I loved you; abide in my love.&#34; and again: &#34;This is my commandment, that you love one another as I have loved you.&#34; Fruit of the Spirit and fullness of the Law, charity keeps the commandments of God and his Christ: &#34;Abide in my love. If you keep my commandments, you will abide in my love.&#34;</p><br/><p>- 1970 (in &#39;The New Law&#39;) - The entire Law of the Gospel is contained in the &#34;new commandment&#34; of Jesus, to love one another as he has loved us (abbreviated).</p><br/><p>- 609 (in &#39;Jesus freely embraced the Father&#39;s redeeming love&#39;) - By embracing in his human heart the Father&#39;s love for men, Jesus &#34;loved them to the end&#34;, for &#34;greater love has no man than this, that a man lay down his life for his friends.&#34; In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: &#34;No one takes [my life] from me, but I lay it down of my own accord.&#34; Hence the sovereign freedom of God&#39;s Son as he went out to his death.</p><br/><p>- 1972 (in &#39;The New Law&#39;) - The New Law is called a law of love because it makes us act out of the love infused by the Holy Spirit, rather than from fear; a law of grace, because it confers the strength of grace to act, by means of faith and the sacraments; a law of freedom, because it sets us free from the ritual and juridical observances of the Old Law, inclines us to act spontaneously by the prompting of charity and, finally, lets us pass from the condition of a servant who &#34;does not know what his master is doing&#34; to that of a friend of Christ - &#34;For all that I have heard from my Father I have made known to you&#34; - or even to the status of son and heir.</p><br/><p>- 2347 (in &#39;The Integrality of the gift of self&#39;) - The virtue of chastity blossoms in friendship. It shows the disciple how to follow and imitate him who has chosen us as his friends, who has given himself totally to us and allows us to participate in his divine estate. Chastity is a promise of immortality. Chastity is expressed notably in friendship with one&#39;s neighbor. Whether it develops between persons of the same or opposite sex, friendship represents a great good for all. It leads to spiritual communion.</p><br/><p>- 459 (in &#39;Why did the Word become Flesh&#39;) - Jesus is the model for the Beatitudes and the norm of the new law: &#34;Love one another as I have loved you.&#34; This love implies an effective offering of oneself, after his example (abbreviated).</p><br/><p>- 737 (in &#39;The Holy Spirit and the Church&#39;) - He makes present the mystery of Christ, supremely in the Eucharist, in order to reconcile them, to bring them into communion with God, that they may &#34;bear much fruit&#34; (abbreviated).</p><br/><p>- 2074 (in &#39;The Decalogue and the Natural Law&#39;)</p><br/><p>- 2745 (in &#39;Persevering in Love&#39;)</p><br/><p>- 2615 (in &#39;Jesus teaches us how to pray&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0ey2Ml44Hh87PM2T1U5cXM",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of Saint Matthias, Apostle - John 15: 9-17",
    "release_date": "2023-05-13",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0ey2Ml44Hh87PM2T1U5cXM"
}