{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/007MNMa9TR8Rkkb2UKAom2/clip_822800_872200.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 9: 14-29 - 'Help the little faith I have.'  Catechism of the Catholic Church Paragraphs: - 2610 (in 'Jesus teaches us how to pray') - Just as Jesus prays to the Father and gives thanks before receiving his gifts, so he teaches us filial boldness: \"Whatever you ask in prayer, believe that you receive it, and you will.\" Such is the power of prayer and of faith that does not doubt: \"all things are possible to him who believes.\" Jesus is as saddened by the \"lack of faith\" of his own neighbors and the \"little faith\" of his own disciples as he is struck with admiration at the great faith of the Roman centurion and the Canaanite woman. - 162 (in 'Perseverance in faith') - Faith is an entirely free gift that God makes to man. We can lose this priceless gift, as St. Paul indicated to St. Timothy: \"Wage the good warfare, holding faith and a good conscience. By rejecting conscience, certain persons have made shipwreck of their faith.\" To live, grow and persevere in the faith until the end we must nourish it with the word of God; we must beg the Lord to increase our faith; it must be \"working through charity,\" abounding in hope, and rooted in the faith of the Church.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1021886,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0Fo48XRbTB4QEVb7kFsI0Q"
    },
    "href": "https://api.spotify.com/v1/episodes/0Fo48XRbTB4QEVb7kFsI0Q",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 9: 14-29 - &#39;Help the little faith I have.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2610 (in &#39;Jesus teaches us how to pray&#39;) - Just as Jesus prays to the Father and gives thanks before receiving his gifts, so he teaches us filial boldness: &#34;Whatever you ask in prayer, believe that you receive it, and you will.&#34; Such is the power of prayer and of faith that does not doubt: &#34;all things are possible to him who believes.&#34; Jesus is as saddened by the &#34;lack of faith&#34; of his own neighbors and the &#34;little faith&#34; of his own disciples as he is struck with admiration at the great faith of the Roman centurion and the Canaanite woman.</p><br/><p>- 162 (in &#39;Perseverance in faith&#39;) - Faith is an entirely free gift that God makes to man. We can lose this priceless gift, as St. Paul indicated to St. Timothy: &#34;Wage the good warfare, holding faith and a good conscience. By rejecting conscience, certain persons have made shipwreck of their faith.&#34; To live, grow and persevere in the faith until the end we must nourish it with the word of God; we must beg the Lord to increase our faith; it must be &#34;working through charity,&#34; abounding in hope, and rooted in the faith of the Church.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0Fo48XRbTB4QEVb7kFsI0Q",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 7 in Ordinary Time - Mark 9: 14-29",
    "release_date": "2023-02-19",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0Fo48XRbTB4QEVb7kFsI0Q"
}