{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5oXQWzUyZZcYLp0abExoLo/clip_423350_469350.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 11: 15-26 - 'The finger of God has overtaken you.'  Catechism of the Catholic Church Paragraphs: - 700 (in 'Symbols of the Holy Spirit') - The finger. \"It is by the finger of God that [Jesus] cast out demons.\" If God's law was written on tablets of stone \"by the finger of God,\" then the \"letter from Christ\" entrusted to the care of the apostles, is written \"with the Spirit of the living God, not on tablets of stone, but on tablets of human hearts.\" The hymn Veni Creator Spiritus invokes the Holy Spirit as the \"finger of the Father's right hand.\" - 385 (in 'The Fall') - God is infinitely good and all his works are good. Yet no one can escape the experience of suffering or the evils in nature which seem to be linked to the limitations proper to creatures: and above all to the question of moral evil. Where does evil come from? \"I sought whence evil comes and there was no solution\", said St. Augustine, and his own painful quest would only be resolved by his conversion to the living God. For \"the mystery of lawlessness\" is clarified only in the light of the \"mystery of our religion\". The revelation of divine love in Christ manifested at the same time the extent of evil and the superabundance of grace. We must therefore approach the question of the origin of evil by fixing the eyes of our faith on him who alone is its conqueror.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1624584,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0hnAljA83FTuoejjGJG0Wj"
    },
    "href": "https://api.spotify.com/v1/episodes/0hnAljA83FTuoejjGJG0Wj",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 11: 15-26 - &#39;The finger of God has overtaken you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 700 (in &#39;Symbols of the Holy Spirit&#39;) - The finger. &#34;It is by the finger of God that [Jesus] cast out demons.&#34; If God&#39;s law was written on tablets of stone &#34;by the finger of God,&#34; then the &#34;letter from Christ&#34; entrusted to the care of the apostles, is written &#34;with the Spirit of the living God, not on tablets of stone, but on tablets of human hearts.&#34; The hymn Veni Creator Spiritus invokes the Holy Spirit as the &#34;finger of the Father&#39;s right hand.&#34;</p><br/><p>- 385 (in &#39;The Fall&#39;) - God is infinitely good and all his works are good. Yet no one can escape the experience of suffering or the evils in nature which seem to be linked to the limitations proper to creatures: and above all to the question of moral evil. Where does evil come from? &#34;I sought whence evil comes and there was no solution&#34;, said St. Augustine, and his own painful quest would only be resolved by his conversion to the living God. For &#34;the mystery of lawlessness&#34; is clarified only in the light of the &#34;mystery of our religion&#34;. The revelation of divine love in Christ manifested at the same time the extent of evil and the superabundance of grace. We must therefore approach the question of the origin of evil by fixing the eyes of our faith on him who alone is its conqueror.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0hnAljA83FTuoejjGJG0Wj",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 27 in Ordinary Time - Luke 11: 14-26",
    "release_date": "2023-10-12",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0hnAljA83FTuoejjGJG0Wj"
}