{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3TtH7SZzbhkMwu2rNCocb2/clip_359166_419166.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 10: 2-16 - 'What God has united, man must not divide.'  Catechism of the Catholic Church Paragraphs: - 1639 (in 'The Marriage Bond') - The consent by which the spouses mutually give and receive one another is sealed by God himself. From their covenant arises \"an institution, confirmed by the divine law, . . . even in the eyes of society.\" The covenant between the spouses is integrated into God's covenant with man: \"Authentic married love is caught up into divine love.\" - 2364 (in 'Conjugal Fidelity') - The married couple forms \"the intimate partnership of life and love established by the Creator and governed by his laws; it is rooted in the conjugal covenant, that is, in their irrevocable personal consent. Both give themselves definitively and totally to one another. They are no longer two; from now on they form one flesh. the covenant they freely contracted imposes on the spouses the obligation to preserve it as unique and indissoluble.\" What therefore God has joined together, let not man put asunder.\" - 2382 (in 'Divorce') - The Lord Jesus insisted on the original intention of the Creator who willed that marriage be indissoluble. He abrogates the accommodations that had slipped into the old Law. - 1650 (in 'The Unity and Indissolubility of Marriage') - Today there are numerous Catholics in many countries who have recourse to civil divorce and contract new civil unions. In fidelity to the words of Jesus Christ - \"Whoever divorces his wife and marries another, commits adultery against her; and if she divorces her husband and marries another, she commits adultery\" The Church maintains that a new union cannot be recognized as valid, if the first marriage was. If the divorced are remarried civilly, they find themselves in a situation that objectively contravenes God's law. Consequently, they cannot receive Eucharistic communion as long as this situation persists. For the same reason, they cannot exercise certain ecclesial responsibilities. Reconciliation through the sacrament of Penance can be granted only to those who have repented for having violated the sign of the covenant and of fidelity to Christ, and who are committed to living in complete continence. - 2380 (in 'Adultery') - Adultery refers to marital infidelity. When two partners, of whom at least one is married to another party, have sexual relations - even transient ones - they commit adultery. Christ condemns even adultery of mere desire. The sixth commandment and the New Testament forbid adultery absolutely. The prophets denounce the gravity of adultery; they see it as an image of the sin of idolatry. - 1261 (in 'The Necessity of Baptism') - As regards children who have died without Baptism, the Church can only entrust them to the mercy of God, as she does in her funeral rites for them. Indeed, the great mercy of God who desires that all men should be saved, and Jesus' tenderness toward children which caused him to say: \"Let the children come to me, do not hinder them,\" allow us to hope that there is a way of salvation for children who have died without Baptism. All the more urgent is the Church's call not to prevent little children coming to Christ through the gift of holy Baptism.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2680929,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0IoWDUlhlzxD49kmfJooVR"
    },
    "href": "https://api.spotify.com/v1/episodes/0IoWDUlhlzxD49kmfJooVR",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 10: 2-16 - &#39;What God has united, man must not divide.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1639 (in &#39;The Marriage Bond&#39;) - The consent by which the spouses mutually give and receive one another is sealed by God himself. From their covenant arises &#34;an institution, confirmed by the divine law, . . . even in the eyes of society.&#34; The covenant between the spouses is integrated into God&#39;s covenant with man: &#34;Authentic married love is caught up into divine love.&#34;</p><br/><p>- 2364 (in &#39;Conjugal Fidelity&#39;) - The married couple forms &#34;the intimate partnership of life and love established by the Creator and governed by his laws; it is rooted in the conjugal covenant, that is, in their irrevocable personal consent. Both give themselves definitively and totally to one another. They are no longer two; from now on they form one flesh. the covenant they freely contracted imposes on the spouses the obligation to preserve it as unique and indissoluble.&#34; What therefore God has joined together, let not man put asunder.&#34;</p><br/><p>- 2382 (in &#39;Divorce&#39;) - The Lord Jesus insisted on the original intention of the Creator who willed that marriage be indissoluble. He abrogates the accommodations that had slipped into the old Law.</p><br/><p>- 1650 (in &#39;The Unity and Indissolubility of Marriage&#39;) - Today there are numerous Catholics in many countries who have recourse to civil divorce and contract new civil unions. In fidelity to the words of Jesus Christ - &#34;Whoever divorces his wife and marries another, commits adultery against her; and if she divorces her husband and marries another, she commits adultery&#34; The Church maintains that a new union cannot be recognized as valid, if the first marriage was. If the divorced are remarried civilly, they find themselves in a situation that objectively contravenes God&#39;s law. Consequently, they cannot receive Eucharistic communion as long as this situation persists. For the same reason, they cannot exercise certain ecclesial responsibilities. Reconciliation through the sacrament of Penance can be granted only to those who have repented for having violated the sign of the covenant and of fidelity to Christ, and who are committed to living in complete continence.</p><br/><p>- 2380 (in &#39;Adultery&#39;) - Adultery refers to marital infidelity. When two partners, of whom at least one is married to another party, have sexual relations - even transient ones - they commit adultery. Christ condemns even adultery of mere desire. The sixth commandment and the New Testament forbid adultery absolutely. The prophets denounce the gravity of adultery; they see it as an image of the sin of idolatry.</p><br/><p>- 1261 (in &#39;The Necessity of Baptism&#39;) - As regards children who have died without Baptism, the Church can only entrust them to the mercy of God, as she does in her funeral rites for them. Indeed, the great mercy of God who desires that all men should be saved, and Jesus&#39; tenderness toward children which caused him to say: &#34;Let the children come to me, do not hinder them,&#34; allow us to hope that there is a way of salvation for children who have died without Baptism. All the more urgent is the Church&#39;s call not to prevent little children coming to Christ through the gift of holy Baptism.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0IoWDUlhlzxD49kmfJooVR",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "27th Sunday in Ordinary Time (Year B) - Mark 10: 2-16",
    "release_date": "2021-10-02",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0IoWDUlhlzxD49kmfJooVR"
}