{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0v2fRZ5UxAc9QQh8i0Tagx/clip_186350_246350.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 24: 1-12 - 'Why look among the dead for someone who is alive.'  Catechism of the Catholic Church Paragraphs: - 2174 (in 'The Day of the Resurrection, the new Creation') - Jesus rose from the dead \"on the first day of the week.\" Because it is the \"first day,\" the day of Christ's Resurrection recalls the first creation. Because it is the \"eighth day\" following the sabbath, it symbolizes the new creation ushered in by Christ's Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord's Day (he kuriake hemera, dies dominica) Sunday: We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead. - 640 (in 'The Empty Tomb') - “Why do you seek the living among the dead? He is not here, but has risen.” The first element we encounter in the framework of the Easter events is the empty tomb. In itself it is not a direct proof of Resurrection; the absence of Christ’s body from the tomb could be explained otherwise. Nonetheless the empty tomb was still an essential sign for all. Its discovery by the disciples was the first step toward recognizing the very fact of the Resurrection. This was the case, first with the holy women, and then with Peter (abbreviated). - 641 (in 'The Appearances of the Risen One') - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ's Resurrection for the apostles themselves. They were the next to whom Jesus appears: first Peter, then the Twelve (abbreviated). - 643 (in 'The Appearances of the Risen One') - Given all these testimonies, Christ's Resurrection cannot be interpreted as something outside the physical order, and it is impossible not to acknowledge it as an historical fact. It is clear from the facts that the disciples' faith was drastically put to the test by their master's Passion and death on the cross, which he had foretold. The shock provoked by the Passion was so great that at least some of the disciples did not at once believe in the news of the Resurrection. Far from showing us a community seized by a mystical exaltation, the Gospels present us with disciples demoralized (\"looking sad\") and frightened. For they had not believed the holy women returning from the tomb and had regarded their words as an \"idle tale\". When Jesus reveals himself to the Eleven on Easter evening, \"he upbraided them for their unbelief and hardness of heart, because they had not believed those who saw him after he had risen.\" - 652 (in 'The Meaning and Saving Significance of the Resurrection') - Christ's Resurrection is the fulfilment of the promises both of the Old Testament and of Jesus himself during his earthly life. The phrase \"in accordance with the Scriptures\" indicates that Christ's Resurrection fulfilled these predictions. - 626 (in 'Christ in the tomb in his body')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1340093,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0lIACjs89TmilbkkDnoglX"
    },
    "href": "https://api.spotify.com/v1/episodes/0lIACjs89TmilbkkDnoglX",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 24: 1-12 - &#39;Why look among the dead for someone who is alive.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2174 (in &#39;The Day of the Resurrection, the new Creation&#39;) - Jesus rose from the dead &#34;on the first day of the week.&#34; Because it is the &#34;first day,&#34; the day of Christ&#39;s Resurrection recalls the first creation. Because it is the &#34;eighth day&#34; following the sabbath, it symbolizes the new creation ushered in by Christ&#39;s Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord&#39;s Day (he kuriake hemera, dies dominica) Sunday:</p><br/><p>We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead.</p><br/><p>- 640 (in &#39;The Empty Tomb&#39;) - “Why do you seek the living among the dead? He is not here, but has risen.” The first element we encounter in the framework of the Easter events is the empty tomb. In itself it is not a direct proof of Resurrection; the absence of Christ’s body from the tomb could be explained otherwise. Nonetheless the empty tomb was still an essential sign for all. Its discovery by the disciples was the first step toward recognizing the very fact of the Resurrection. This was the case, first with the holy women, and then with Peter (abbreviated).</p><br/><p>- 641 (in &#39;The Appearances of the Risen One&#39;) - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ&#39;s Resurrection for the apostles themselves. They were the next to whom Jesus appears: first Peter, then the Twelve (abbreviated).</p><br/><p>- 643 (in &#39;The Appearances of the Risen One&#39;) - Given all these testimonies, Christ&#39;s Resurrection cannot be interpreted as something outside the physical order, and it is impossible not to acknowledge it as an historical fact. It is clear from the facts that the disciples&#39; faith was drastically put to the test by their master&#39;s Passion and death on the cross, which he had foretold. The shock provoked by the Passion was so great that at least some of the disciples did not at once believe in the news of the Resurrection. Far from showing us a community seized by a mystical exaltation, the Gospels present us with disciples demoralized (&#34;looking sad&#34;) and frightened. For they had not believed the holy women returning from the tomb and had regarded their words as an &#34;idle tale&#34;. When Jesus reveals himself to the Eleven on Easter evening, &#34;he upbraided them for their unbelief and hardness of heart, because they had not believed those who saw him after he had risen.&#34;</p><br/><p>- 652 (in &#39;The Meaning and Saving Significance of the Resurrection&#39;) - Christ&#39;s Resurrection is the fulfilment of the promises both of the Old Testament and of Jesus himself during his earthly life. The phrase &#34;in accordance with the Scriptures&#34; indicates that Christ&#39;s Resurrection fulfilled these predictions.</p><br/><p>- 626 (in &#39;Christ in the tomb in his body&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0lIACjs89TmilbkkDnoglX",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Holy Saturday (Year C) - Luke 24: 1-12",
    "release_date": "2022-04-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0lIACjs89TmilbkkDnoglX"
}