{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4yBGTEUvNuyBeD8GZXq289/clip_404387_464387.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 24: 46-53 - 'He withdrew from them and was carried up into Heaven.'  Catechism of the Catholic Church Paragraphs: - 981 (in 'The Power of the Keys') - After his Resurrection, Christ sent his apostles \"so that repentance and forgiveness of sins should be preached in his name to all nations.\" The apostles and their successors carry out this \"ministry of reconciliation,\" not only by announcing to men God's forgiveness merited for us by Christ, and calling them to conversion and faith; but also by communicating to them the forgiveness of sins in Baptism, and reconciling them with God and with the Church through the power of the keys, received from Christ (abbreviated). - 1120 (in 'The Sacraments of the Church') - The ordained priesthood guarantees that it really is Christ who acts in the sacraments through the Holy Spirit for the Church. the saving mission entrusted by the Father to his incarnate Son was committed to the apostles and through them to their successors: they receive the Spirit of Jesus to act in his name and in his person (abbreviated). - 1122 (in 'The Sacraments of Faith') - Christ sent his apostles so that \"repentance and forgiveness of sins should be preached in his name to all nations.\" (abbreviated). - 1304 (in 'Confirmation') - Like Baptism which it completes, Confirmation is given only once, for it too imprints on the soul an indelible spiritual mark, the \"character,\" which is the sign that Jesus Christ has marked a Christian with the seal of his Spirit by clothing him with power from on high so that he may be his witness. - 659 (in 'He Ascended into Heaven and is seated at the right hand of the Father') - \"So then the Lord Jesus, after he had spoken to them, was taken up into heaven, and sat down at the right hand of God.\" Christ's body was glorified at the moment of his Resurrection, as proved by the new and supernatural properties it subsequently and permanently enjoys. But during the forty days when he eats and drinks familiarly with his disciples and teaches them about the kingdom, his glory remains veiled under the appearance of ordinary humanity. Jesus' final apparition ends with the irreversible entry of his humanity into divine glory, symbolized by the cloud and by heaven, where he is seated from that time forward at God's right hand (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1731929,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0LjY0m7vw1gI39umY7mLBK"
    },
    "href": "https://api.spotify.com/v1/episodes/0LjY0m7vw1gI39umY7mLBK",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 24: 46-53 - &#39;He withdrew from them and was carried up into Heaven.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 981 (in &#39;The Power of the Keys&#39;) - After his Resurrection, Christ sent his apostles &#34;so that repentance and forgiveness of sins should be preached in his name to all nations.&#34; The apostles and their successors carry out this &#34;ministry of reconciliation,&#34; not only by announcing to men God&#39;s forgiveness merited for us by Christ, and calling them to conversion and faith; but also by communicating to them the forgiveness of sins in Baptism, and reconciling them with God and with the Church through the power of the keys, received from Christ (abbreviated).</p><br/><p>- 1120 (in &#39;The Sacraments of the Church&#39;) - The ordained priesthood guarantees that it really is Christ who acts in the sacraments through the Holy Spirit for the Church. the saving mission entrusted by the Father to his incarnate Son was committed to the apostles and through them to their successors: they receive the Spirit of Jesus to act in his name and in his person (abbreviated).</p><br/><p>- 1122 (in &#39;The Sacraments of Faith&#39;) - Christ sent his apostles so that &#34;repentance and forgiveness of sins should be preached in his name to all nations.&#34; (abbreviated).</p><br/><p>- 1304 (in &#39;Confirmation&#39;) - Like Baptism which it completes, Confirmation is given only once, for it too imprints on the soul an indelible spiritual mark, the &#34;character,&#34; which is the sign that Jesus Christ has marked a Christian with the seal of his Spirit by clothing him with power from on high so that he may be his witness.</p><br/><p>- 659 (in &#39;He Ascended into Heaven and is seated at the right hand of the Father&#39;) - &#34;So then the Lord Jesus, after he had spoken to them, was taken up into heaven, and sat down at the right hand of God.&#34; Christ&#39;s body was glorified at the moment of his Resurrection, as proved by the new and supernatural properties it subsequently and permanently enjoys. But during the forty days when he eats and drinks familiarly with his disciples and teaches them about the kingdom, his glory remains veiled under the appearance of ordinary humanity. Jesus&#39; final apparition ends with the irreversible entry of his humanity into divine glory, symbolized by the cloud and by heaven, where he is seated from that time forward at God&#39;s right hand (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0LjY0m7vw1gI39umY7mLBK",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of the Ascension of the Lord (Year C) - Luke 24: 46-53",
    "release_date": "2022-05-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0LjY0m7vw1gI39umY7mLBK"
}