{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/32uZXFkbxB1VdAyZqm1Mie/clip_343132_403132.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 21: 33-46- 'This is the landlord's heir: come, let us kill him'  Catechism of the Catholic Church Paragraphs: - 755-756 (in 'Symbols of the Church') - \"The Church is a cultivated field, the tillage of God. On that land the ancient olive tree grows whose holy roots were the prophets and in which the reconciliation of Jews and Gentiles has been brought about and will be brought about again. That land, like a choice vineyard, has been planted by the heavenly cultivator. Yet the true vine is Christ who gives life and fruitfulness to the branches, that is, to us, who through the Church remain in Christ, without whom we can do nothing. \"Often, too, the Church is called the building of God. the Lord compared himself to the stone which the builders rejected, but which was made into the comer-stone. On this foundation the Church is built by the apostles and from it the Church receives solidity and unity. This edifice has many names to describe it: the house of God in which his family dwells; the household of God in the Spirit; the dwelling-place of God among men; and, especially, the holy temple. This temple, symbolized in places of worship built out of stone, is praised by the Fathers and, not without reason, is compared in the liturgy to the Holy City, the New Jerusalem. As living stones we here on earth are built into it. It is this holy city that is seen by John as it comes down out of heaven from God when the world is made anew, prepared like a bride adorned for her husband.\" - 443 (in 'The Only Son of God') - Peter could recognize the transcendent character of the Messiah's divine sonship because Jesus had clearly allowed it to be so understood. To his accusers' question before the Sanhedrin, \"Are you the Son of God, then?\" Jesus answered, \"You say that I am.\" Well before this, Jesus referred to himself as \"the Son\" who knows the Father, as distinct from the \"servants\" God had earlier sent to his people; he is superior even to the angels (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1132646,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0OGjZFgZTTfy65lbWeJAcu"
    },
    "href": "https://api.spotify.com/v1/episodes/0OGjZFgZTTfy65lbWeJAcu",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 21: 33-46- &#39;This is the landlord&#39;s heir: come, let us kill him&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 755-756 (in &#39;Symbols of the Church&#39;) - &#34;The Church is a cultivated field, the tillage of God. On that land the ancient olive tree grows whose holy roots were the prophets and in which the reconciliation of Jews and Gentiles has been brought about and will be brought about again. That land, like a choice vineyard, has been planted by the heavenly cultivator. Yet the true vine is Christ who gives life and fruitfulness to the branches, that is, to us, who through the Church remain in Christ, without whom we can do nothing. &#34;Often, too, the Church is called the building of God. the Lord compared himself to the stone which the builders rejected, but which was made into the comer-stone. On this foundation the Church is built by the apostles and from it the Church receives solidity and unity. This edifice has many names to describe it: the house of God in which his family dwells; the household of God in the Spirit; the dwelling-place of God among men; and, especially, the holy temple. This temple, symbolized in places of worship built out of stone, is praised by the Fathers and, not without reason, is compared in the liturgy to the Holy City, the New Jerusalem. As living stones we here on earth are built into it. It is this holy city that is seen by John as it comes down out of heaven from God when the world is made anew, prepared like a bride adorned for her husband.&#34;</p><br/><p>- 443 (in &#39;The Only Son of God&#39;) - Peter could recognize the transcendent character of the Messiah&#39;s divine sonship because Jesus had clearly allowed it to be so understood. To his accusers&#39; question before the Sanhedrin, &#34;Are you the Son of God, then?&#34; Jesus answered, &#34;You say that I am.&#34; Well before this, Jesus referred to himself as &#34;the Son&#34; who knows the Father, as distinct from the &#34;servants&#34; God had earlier sent to his people; he is superior even to the angels (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0OGjZFgZTTfy65lbWeJAcu",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 2 of Lent - Matt 21: 33-46",
    "release_date": "2023-03-09",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0OGjZFgZTTfy65lbWeJAcu"
}