{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0XlpBObKUnnEF8gGZ2zMcl/clip_514600_574300.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 9: 18-24 - 'You are the Christ of God.'  Catechism of the Catholic Church Paragraphs: - 2600 (in 'Jesus prays') - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ's ministry. Jesus prays before the decisive moments of his mission: before his Father's witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father's plan of love by his Passion. He also prays before the decisive moments involving the mission of his apostles: at his election and call of the Twelve, before Peter's confession of him as \"the Christ of God,\" and again that the faith of the chief of the Apostles may not fail when tempted. Jesus' prayer before the events of salvation that the Father has asked him to fulfill is a humble and trusting commitment of his human will to the loving will of the Father. - 1435 (in 'The Many Forms of Penance in the Christian Life') - Conversion is accomplished in daily life by gestures of reconciliation, concern for the poor, the exercise and defense of justice and right, by the admission of faults to one's brethren, fraternal correction, revision of life, examination of conscience, spiritual direction, acceptance of suffering, endurance of persecution for the sake of righteousness. Taking up one's cross each day and following Jesus is the surest way of penance.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1407268,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0pq2X6smlehTIfXbEtR58B"
    },
    "href": "https://api.spotify.com/v1/episodes/0pq2X6smlehTIfXbEtR58B",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 9: 18-24 - &#39;You are the Christ of God.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2600 (in &#39;Jesus prays&#39;) - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ&#39;s ministry. Jesus prays before the decisive moments of his mission: before his Father&#39;s witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father&#39;s plan of love by his Passion. He also prays before the decisive moments involving the mission of his apostles: at his election and call of the Twelve, before Peter&#39;s confession of him as &#34;the Christ of God,&#34; and again that the faith of the chief of the Apostles may not fail when tempted. Jesus&#39; prayer before the events of salvation that the Father has asked him to fulfill is a humble and trusting commitment of his human will to the loving will of the Father.</p><br/><p>- 1435 (in &#39;The Many Forms of Penance in the Christian Life&#39;) - Conversion is accomplished in daily life by gestures of reconciliation, concern for the poor, the exercise and defense of justice and right, by the admission of faults to one&#39;s brethren, fraternal correction, revision of life, examination of conscience, spiritual direction, acceptance of suffering, endurance of persecution for the sake of righteousness. Taking up one&#39;s cross each day and following Jesus is the surest way of penance.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0pq2X6smlehTIfXbEtR58B",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "12th Sunday in Ordinary Time (Year C) - Luke 9: 18-24",
    "release_date": "2022-06-18",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0pq2X6smlehTIfXbEtR58B"
}