{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/2NSIks3zQZ88gJDSckE3kZ/clip_617236_677236.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 10: 13-16 - 'It is to such as these little children that the kingdom of God belongs.'  Catechism of the Catholic Church Paragraphs: - 1244 (in 'Christian Initiation') - First Holy Communion. Having become a child of God clothed with the wedding garment, the neophyte is admitted \"to the marriage supper of the Lamb\" and receives the food of the new life, the body and blood of Christ. the Eastern Churches maintain a lively awareness of the unity of Christian initiation by giving Holy Communion to all the newly baptized and confirmed, even little children, recalling the Lord's words: \"Let the children come to me, do not hinder them.\" The Latin Church, which reserves admission to Holy Communion to those who have attained the age of reason, expresses the orientation of Baptism to the Eucharist by having the newly baptized child brought to the altar for the praying of the Our Father.\" - 1261 (in 'The Necessity of Baptism') - As regards children who have died without Baptism, the Church can only entrust them to the mercy of God, as she does in her funeral rites for them. Indeed, the great mercy of God who desires that all men should be saved, and Jesus' tenderness toward children which caused him to say: \"Let the children come to me, do not hinder them,\" allow us to hope that there is a way of salvation for children who have died without Baptism. All the more urgent is the Church's call not to prevent little children coming to Christ through the gift of holy Baptism. - 699 (in 'Symbols of the Holy Spirit') - The hand. Jesus heals the sick and blesses little children by laying hands on them. In his name the apostles will do the same. Even more pointedly, it is by the Apostles' imposition of hands that the Holy Spirit is given. The Letter to the Hebrews lists the imposition of hands among the \"fundamental elements\" of its teaching. The Church has kept this sign of the all-powerful outpouring of the Holy Spirit in its sacramental epicleses.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 929680,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0rZu7HBYid3SiNJUxmMq7Y"
    },
    "href": "https://api.spotify.com/v1/episodes/0rZu7HBYid3SiNJUxmMq7Y",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 10: 13-16 - &#39;It is to such as these little children that the kingdom of God belongs.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1244 (in &#39;Christian Initiation&#39;) - First Holy Communion. Having become a child of God clothed with the wedding garment, the neophyte is admitted &#34;to the marriage supper of the Lamb&#34; and receives the food of the new life, the body and blood of Christ. the Eastern Churches maintain a lively awareness of the unity of Christian initiation by giving Holy Communion to all the newly baptized and confirmed, even little children, recalling the Lord&#39;s words: &#34;Let the children come to me, do not hinder them.&#34; The Latin Church, which reserves admission to Holy Communion to those who have attained the age of reason, expresses the orientation of Baptism to the Eucharist by having the newly baptized child brought to the altar for the praying of the Our Father.&#34;</p><br/><p>- 1261 (in &#39;The Necessity of Baptism&#39;) - As regards children who have died without Baptism, the Church can only entrust them to the mercy of God, as she does in her funeral rites for them. Indeed, the great mercy of God who desires that all men should be saved, and Jesus&#39; tenderness toward children which caused him to say: &#34;Let the children come to me, do not hinder them,&#34; allow us to hope that there is a way of salvation for children who have died without Baptism. All the more urgent is the Church&#39;s call not to prevent little children coming to Christ through the gift of holy Baptism.</p><br/><p>- 699 (in &#39;Symbols of the Holy Spirit&#39;) - The hand. Jesus heals the sick and blesses little children by laying hands on them. In his name the apostles will do the same. Even more pointedly, it is by the Apostles&#39; imposition of hands that the Holy Spirit is given. The Letter to the Hebrews lists the imposition of hands among the &#34;fundamental elements&#34; of its teaching. The Church has kept this sign of the all-powerful outpouring of the Holy Spirit in its sacramental epicleses.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0rZu7HBYid3SiNJUxmMq7Y",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 7 in Ordinary Time - Mark 10: 13-16",
    "release_date": "2023-02-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0rZu7HBYid3SiNJUxmMq7Y"
}