{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0xxOIF2jLJWQnxQ08kGUP4/clip_932600_993500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 5: 27-32 - 'If your right eye should cause you to sin, tear it out.'  Catechism of the Catholic Church Paragraphs: - 2336 (in 'Male and Female he created them') - Jesus came to restore creation to the purity of its origins. In the Sermon on the Mount, he interprets God's plan strictly: \"You have heard that it was said, 'You shall not commit adultery.' But I say to you that every one who looks at a woman lustfully has already committed adultery with her in his heart.\" What God has joined together, let not man put asunder. The tradition of the Church has understood the sixth commandment as encompassing the whole of human sexuality. - 1456 (in 'The Confession of Sins') - Confession to a priest is an essential part of the sacrament of Penance: \"All mortal sins of which penitents after a diligent self-examination are conscious must be recounted by them in confession, even if they are most secret and have been committed against the last two precepts of the Decalogue; for these sins sometimes wound the soul more grievously and are more dangerous than those which are committed openly.\" - 2528 (in 'The Ninth Commandment') - \"Everyone who looks at a woman lustfully has already committed adultery with her in his heart\" - 226 (in 'The Implications of Faith in One God') - It means making good use of created things: faith in God, the only One, leads us to use everything that is not God only insofar as it brings us closer to him, and to detach ourselves from it insofar as it turns us away from him: My Lord and my God, take from me everything that distances me from you. My Lord and my God, give me everything that brings me closer to you My Lord and my God, detach me from myself to give my all to you. - 1034 (in 'Hell') - Jesus often speaks of \"Gehenna\" of \"the unquenchable fire\" reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he \"will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,\" and that he will pronounce the condemnation: \"Depart from me, you cursed, into the eternal fire!\" - 2382 (in 'Divorce') - The Lord Jesus insisted on the original intention of the Creator who willed that marriage be indissoluble. He abrogates the accommodations that had slipped into the old Law. Between the baptized, \"a ratified and consummated marriage cannot be dissolved by any human power or for any reason other than death.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2221801,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/0UjsWbVtLnVZay8TLQeDCc"
    },
    "href": "https://api.spotify.com/v1/episodes/0UjsWbVtLnVZay8TLQeDCc",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 5: 27-32 - &#39;If your right eye should cause you to sin, tear it out.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2336 (in &#39;Male and Female he created them&#39;) - Jesus came to restore creation to the purity of its origins. In the Sermon on the Mount, he interprets God&#39;s plan strictly: &#34;You have heard that it was said, &#39;You shall not commit adultery.&#39; But I say to you that every one who looks at a woman lustfully has already committed adultery with her in his heart.&#34; What God has joined together, let not man put asunder. The tradition of the Church has understood the sixth commandment as encompassing the whole of human sexuality.</p><br/><p>- 1456 (in &#39;The Confession of Sins&#39;) - Confession to a priest is an essential part of the sacrament of Penance: &#34;All mortal sins of which penitents after a diligent self-examination are conscious must be recounted by them in confession, even if they are most secret and have been committed against the last two precepts of the Decalogue; for these sins sometimes wound the soul more grievously and are more dangerous than those which are committed openly.&#34;</p><br/><p>- 2528 (in &#39;The Ninth Commandment&#39;) - &#34;Everyone who looks at a woman lustfully has already committed adultery with her in his heart&#34;</p><br/><p>- 226 (in &#39;The Implications of Faith in One God&#39;) - It means making good use of created things: faith in God, the only One, leads us to use everything that is not God only insofar as it brings us closer to him, and to detach ourselves from it insofar as it turns us away from him: My Lord and my God, take from me everything that distances me from you. My Lord and my God, give me everything that brings me closer to you My Lord and my God, detach me from myself to give my all to you.</p><br/><p>- 1034 (in &#39;Hell&#39;) - Jesus often speaks of &#34;Gehenna&#34; of &#34;the unquenchable fire&#34; reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he &#34;will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,&#34; and that he will pronounce the condemnation: &#34;Depart from me, you cursed, into the eternal fire!&#34;</p><br/><p>- 2382 (in &#39;Divorce&#39;) - The Lord Jesus insisted on the original intention of the Creator who willed that marriage be indissoluble. He abrogates the accommodations that had slipped into the old Law. Between the baptized, &#34;a ratified and consummated marriage cannot be dissolved by any human power or for any reason other than death.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "0UjsWbVtLnVZay8TLQeDCc",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 10 in Ordinary Time - Matt 5: 27-32",
    "release_date": "2023-06-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:0UjsWbVtLnVZay8TLQeDCc"
}