{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7pR5m8Trx5x9TrA2vE8exh/clip_1046500_1098700.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 10: 24-33 - 'Everything now hidden will be made clear.'  Catechism of the Catholic Church Paragraphs: - 765 (in 'The Church - Instituted by Christ Jesus') - The Twelve and the other disciples share in Christ's mission and his power, but also in his lot (abbreviated). - 363 (in 'Body and Soul but Truly One') - In Sacred Scripture the term \"soul\" often refers to human life or the entire human person. But \"soul\" also refers to the innermost aspect of man, that which is of greatest value in him, that by which he is most especially in God's image: \"soul\" signifies the spiritual principle in man. - 1034 (in 'Hell') - Jesus often speaks of \"Gehenna\" of \"the unquenchable fire\" reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he \"will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,\" and that he will pronounce the condemnation: \"Depart from me, you cursed, into the eternal fire!\" - 305 (in 'God Carries out his plan: Divine Providence') - Jesus asks for childlike abandonment to the providence of our heavenly Father who takes care of his children's smallest needs: \"Therefore do not be anxious, saying, \"What shall we eat?\" or \"What shall we drink?\". . . Your heavenly Father knows that you need them all. But seek first his kingdom and his righteousness, and all these things shall be yours as well.\" - 1816 (in 'Faith') - The disciple of Christ must not only keep the faith and live on it, but also profess it, confidently bear witness to it, and spread it: \"All however must be prepared to confess Christ before men and to follow him along the way of the Cross, amidst the persecutions which the Church never lacks.\" Service of and witness to the faith are necessary for salvation: \"So every one who acknowledges me before men, I also will acknowledge before my Father who is in heaven; but whoever denies me before men, I also will deny before my Father who is in heaven.\" - 14 (in 'Prologue') - Those who belong to Christ through faith and Baptism must confess their baptismal faith before men (abbreviated). - 2145 (in 'The Name of the Lord is Holy') - The faithful should bear witness to the Lord's name by confessing the faith without giving way to fear. Preaching and catechizing should be permeated with adoration and respect for the name of our Lord Jesus Christ.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1425264,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/16FJpBMsFApAxnifgQ4Ulq"
    },
    "href": "https://api.spotify.com/v1/episodes/16FJpBMsFApAxnifgQ4Ulq",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 10: 24-33 - &#39;Everything now hidden will be made clear.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 765 (in &#39;The Church - Instituted by Christ Jesus&#39;) - The Twelve and the other disciples share in Christ&#39;s mission and his power, but also in his lot (abbreviated).</p><br/><p>- 363 (in &#39;Body and Soul but Truly One&#39;) - In Sacred Scripture the term &#34;soul&#34; often refers to human life or the entire human person. But &#34;soul&#34; also refers to the innermost aspect of man, that which is of greatest value in him, that by which he is most especially in God&#39;s image: &#34;soul&#34; signifies the spiritual principle in man.</p><br/><p>- 1034 (in &#39;Hell&#39;) - Jesus often speaks of &#34;Gehenna&#34; of &#34;the unquenchable fire&#34; reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he &#34;will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,&#34; and that he will pronounce the condemnation: &#34;Depart from me, you cursed, into the eternal fire!&#34;</p><br/><p>- 305 (in &#39;God Carries out his plan: Divine Providence&#39;) - Jesus asks for childlike abandonment to the providence of our heavenly Father who takes care of his children&#39;s smallest needs: &#34;Therefore do not be anxious, saying, &#34;What shall we eat?&#34; or &#34;What shall we drink?&#34;. . . Your heavenly Father knows that you need them all. But seek first his kingdom and his righteousness, and all these things shall be yours as well.&#34;</p><br/><p>- 1816 (in &#39;Faith&#39;) - The disciple of Christ must not only keep the faith and live on it, but also profess it, confidently bear witness to it, and spread it: &#34;All however must be prepared to confess Christ before men and to follow him along the way of the Cross, amidst the persecutions which the Church never lacks.&#34; Service of and witness to the faith are necessary for salvation: &#34;So every one who acknowledges me before men, I also will acknowledge before my Father who is in heaven; but whoever denies me before men, I also will deny before my Father who is in heaven.&#34;</p><br/><p>- 14 (in &#39;Prologue&#39;) - Those who belong to Christ through faith and Baptism must confess their baptismal faith before men (abbreviated).</p><br/><p>- 2145 (in &#39;The Name of the Lord is Holy&#39;) - The faithful should bear witness to the Lord&#39;s name by confessing the faith without giving way to fear. Preaching and catechizing should be permeated with adoration and respect for the name of our Lord Jesus Christ.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "16FJpBMsFApAxnifgQ4Ulq",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 14 in Ordinary Time - Matt 10: 24-33",
    "release_date": "2023-07-14",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:16FJpBMsFApAxnifgQ4Ulq"
}