{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3dyvpot51m9oXlOjhwG4oD/clip_904100_962010.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 12: 38-42 - 'There is something greater than Solomon here.'  Catechism of the Catholic Church Paragraphs: - 994 (in 'The Progressive Nature of the Resurrection') - Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the \"sign of Jonah,\" The sign of the temple: he announces that he will be put to death but rise thereafter on the third day (abbreviated). - 627 (in 'You will not let your holy one see corruption') - Jesus' Resurrection \"on the third day\" was the sign of this, also because bodily decay was held to begin on the fourth day after death (abbreviated). - 635 (in 'Christ Descended into Hell') - Christ went down into the depths of death so that \"the dead will hear the voice of the Son of God, and those who hear will live.\" Jesus, \"the Author of life\", by dying destroyed \"him who has the power of death, that is, the devil, and [delivered] all those who through fear of death were subject to lifelong bondage. \"Henceforth the risen Christ holds \"the keys of Death and Hades\", so that \"at the name of Jesus every knee should bow, in heaven and on earth and under the earth\" (abbreviated). - 590 (in 'Jesus and Israel's faith in the one God and Saviour') - Only the divine identity of Jesus' person can justify so absolute a claim as \"He who is not with me is against me\"; and his saying that there was in him \"something greater than Jonah,. . . greater than Solomon\", something \"greater than the Temple\"; his reminder that David had called the Messiah his Lord, and his affirmations, \"Before Abraham was, I AM\", and even \"I and the Father are one.\" - 678 (in 'To Judge the Living and the Dead') - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1319613,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1bEtwt0uq4XAg68GIVdLIN"
    },
    "href": "https://api.spotify.com/v1/episodes/1bEtwt0uq4XAg68GIVdLIN",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 12: 38-42 - &#39;There is something greater than Solomon here.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 994 (in &#39;The Progressive Nature of the Resurrection&#39;) - Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the &#34;sign of Jonah,&#34; The sign of the temple: he announces that he will be put to death but rise thereafter on the third day (abbreviated).</p><br/><p>- 627 (in &#39;You will not let your holy one see corruption&#39;) - Jesus&#39; Resurrection &#34;on the third day&#34; was the sign of this, also because bodily decay was held to begin on the fourth day after death (abbreviated).</p><br/><p>- 635 (in &#39;Christ Descended into Hell&#39;) - Christ went down into the depths of death so that &#34;the dead will hear the voice of the Son of God, and those who hear will live.&#34; Jesus, &#34;the Author of life&#34;, by dying destroyed &#34;him who has the power of death, that is, the devil, and [delivered] all those who through fear of death were subject to lifelong bondage. &#34;Henceforth the risen Christ holds &#34;the keys of Death and Hades&#34;, so that &#34;at the name of Jesus every knee should bow, in heaven and on earth and under the earth&#34; (abbreviated).</p><br/><p>- 590 (in &#39;Jesus and Israel&#39;s faith in the one God and Saviour&#39;) - Only the divine identity of Jesus&#39; person can justify so absolute a claim as &#34;He who is not with me is against me&#34;; and his saying that there was in him &#34;something greater than Jonah,. . . greater than Solomon&#34;, something &#34;greater than the Temple&#34;; his reminder that David had called the Messiah his Lord, and his affirmations, &#34;Before Abraham was, I AM&#34;, and even &#34;I and the Father are one.&#34;</p><br/><p>- 678 (in &#39;To Judge the Living and the Dead&#39;) - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1bEtwt0uq4XAg68GIVdLIN",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 16 in Ordinary Time - Matt 12: 38-42",
    "release_date": "2023-07-23",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1bEtwt0uq4XAg68GIVdLIN"
}