{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1k5Dcd4YnNTX791EmWloPL/clip_1327700_1405600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 8: 4-15 - 'The parable of the sower.'  Catechism of the Catholic Church Paragraphs: - 2731 (in 'Facing Difficulties in Prayer') - Another difficulty, especially for those who sincerely want to pray, is dryness. Dryness belongs to contemplative prayer when the heart is separated from God, with no taste for thoughts, memories, and feelings, even spiritual ones. This is the moment of sheer faith clinging faithfully to Jesus in his agony and in his tomb. \"Unless a grain of wheat falls into the earth and dies, it remains alone; but if dies, it bears much fruit.\" If dryness is due to the lack of roots, because the word has fallen on rocky soil, the battle requires conversion. - 1151 (in 'Signs and Symbols') - Signs taken up by Christ. In his preaching the Lord Jesus often makes use of the signs of creation to make known the mysteries of the Kingdom of God (abbreviated). - 2847 (in 'And Lead us not into Temptation') - The Holy Spirit makes us discern between trials, which are necessary for the growth of the inner man, and temptation, which leads to sin and death. We must also discern between being tempted and consenting to temptation. Finally, discernment unmasks the lie of temptation, whose object appears to be good, a \"delight to the eyes\" and desirable, when in reality its fruit is death. God does not want to impose the good, but wants free beings.... There is a certain usefulness to temptation. No one but God knows what our soul has received from him, not even we ourselves. But temptation reveals it in order to teach us to know ourselves, and in this way we discover our evil inclinations and are obliged to give thanks for the goods that temptation has revealed to us. - 368 (in 'Body and Soul but Truly One') - The spiritual tradition of the Church also emphasizes the heart, in the biblical sense of the depths of one's being, where the person decides for or against God. - 2668 (in 'Prayer to Jesus') - The invocation of the holy name of Jesus is the simplest way of praying always. When the holy name is repeated often by a humbly attentive heart, the prayer is not lost by heaping up empty phrases, but holds fast to the word and \"brings forth fruit with patience.\" This prayer is possible \"at all times\" because it is not one occupation among others but the only occupation: that of loving God, which animates and transfigures every action in Christ Jesus.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1825250,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1BHuYx6NizWDaZChQNxzbI"
    },
    "href": "https://api.spotify.com/v1/episodes/1BHuYx6NizWDaZChQNxzbI",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 8: 4-15 - &#39;The parable of the sower.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2731 (in &#39;Facing Difficulties in Prayer&#39;) - Another difficulty, especially for those who sincerely want to pray, is dryness. Dryness belongs to contemplative prayer when the heart is separated from God, with no taste for thoughts, memories, and feelings, even spiritual ones. This is the moment of sheer faith clinging faithfully to Jesus in his agony and in his tomb. &#34;Unless a grain of wheat falls into the earth and dies, it remains alone; but if dies, it bears much fruit.&#34; If dryness is due to the lack of roots, because the word has fallen on rocky soil, the battle requires conversion.</p><br/><p>- 1151 (in &#39;Signs and Symbols&#39;) - Signs taken up by Christ. In his preaching the Lord Jesus often makes use of the signs of creation to make known the mysteries of the Kingdom of God (abbreviated).</p><br/><p>- 2847 (in &#39;And Lead us not into Temptation&#39;) - The Holy Spirit makes us discern between trials, which are necessary for the growth of the inner man, and temptation, which leads to sin and death. We must also discern between being tempted and consenting to temptation. Finally, discernment unmasks the lie of temptation, whose object appears to be good, a &#34;delight to the eyes&#34; and desirable, when in reality its fruit is death. God does not want to impose the good, but wants free beings.... There is a certain usefulness to temptation. No one but God knows what our soul has received from him, not even we ourselves. But temptation reveals it in order to teach us to know ourselves, and in this way we discover our evil inclinations and are obliged to give thanks for the goods that temptation has revealed to us.</p><br/><p>- 368 (in &#39;Body and Soul but Truly One&#39;) - The spiritual tradition of the Church also emphasizes the heart, in the biblical sense of the depths of one&#39;s being, where the person decides for or against God.</p><br/><p>- 2668 (in &#39;Prayer to Jesus&#39;) - The invocation of the holy name of Jesus is the simplest way of praying always. When the holy name is repeated often by a humbly attentive heart, the prayer is not lost by heaping up empty phrases, but holds fast to the word and &#34;brings forth fruit with patience.&#34; This prayer is possible &#34;at all times&#34; because it is not one occupation among others but the only occupation: that of loving God, which animates and transfigures every action in Christ Jesus.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1BHuYx6NizWDaZChQNxzbI",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 24 in Ordinary Time - Luke 8: 4-15",
    "release_date": "2023-09-22",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1BHuYx6NizWDaZChQNxzbI"
}