{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1RZcBbWVHkv2Ac70Z2Fd4g/clip_620100_676500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 11: 19-27 - 'I am the resurrection and the life.'  Catechism of the Catholic Church Paragraphs: - 994 (in 'The Progressive Revelation of the Resurrection') - But there is more. Jesus links faith in the resurrection to his own person: \"I am the Resurrection and the life.\" It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the \"sign of Jonah,\" The sign of the temple: he announces that he will be put to death but rise thereafter on the third day. - 1001 (in 'How do the dead rise?') - When? Definitively \"at the last day,\" \"at the end of the world.\" Indeed, the resurrection of the dead is closely associated with Christ's Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel's call, and with the sound of the trumpet of God, and the dead in Christ will rise first. - 439 (in 'Christ') - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic \"Son of David\", promised by God to Israel (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 985385,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1cQcRUUGgHIKcG8Fvubn6B"
    },
    "href": "https://api.spotify.com/v1/episodes/1cQcRUUGgHIKcG8Fvubn6B",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 11: 19-27 - &#39;I am the resurrection and the life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 994 (in &#39;The Progressive Revelation of the Resurrection&#39;) - But there is more. Jesus links faith in the resurrection to his own person: &#34;I am the Resurrection and the life.&#34; It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the &#34;sign of Jonah,&#34; The sign of the temple: he announces that he will be put to death but rise thereafter on the third day.</p><br/><p>- 1001 (in &#39;How do the dead rise?&#39;) - When? Definitively &#34;at the last day,&#34; &#34;at the end of the world.&#34; Indeed, the resurrection of the dead is closely associated with Christ&#39;s Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel&#39;s call, and with the sound of the trumpet of God, and the dead in Christ will rise first.</p><br/><p>- 439 (in &#39;Christ&#39;) - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic &#34;Son of David&#34;, promised by God to Israel (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1cQcRUUGgHIKcG8Fvubn6B",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Memorial of Saint Martha, Mary and Lazarus - John 11: 19-27",
    "release_date": "2023-07-28",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1cQcRUUGgHIKcG8Fvubn6B"
}