{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6lwsth6TDhbTAGLzl4wpQw/clip_1114100_1157300.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 6: 7-15 - 'How to pray.'  Catechism of the Catholic Church Paragraphs: - 2759-2856 - Entire section of the Catechism which covers the Our Father. - 2608 (in 'Jesus teaches us how to pray') - From the Sermon on the Mount onwards, Jesus insists on conversion of heart: reconciliation with one's brother before presenting an offering on the altar, love of enemies, and prayer for persecutors, prayer to the Father in secret, not heaping up empty phrases, prayerful forgiveness from the depths of the heart, purity of heart, and seeking the Kingdom before all else. This filial conversion is entirely directed to the Father. - 2668 (in 'Prayer to Jesus') - The invocation of the holy name of Jesus is the simplest way of praying always. When the holy name is repeated often by a humbly attentive heart, the prayer is not lost by heaping up empty phrases, but holds fast to the word and \"brings forth fruit with patience.\" This prayer is possible \"at all times\" because it is not one occupation among others but the only occupation: that of loving God, which animates and transfigures every action in Christ Jesus. - 443 (in 'The Only Son of God') - He distinguished his sonship from that of his disciples by never saying \"our Father\", except to command them: \"You, then, pray like this: 'Our Father'\", and he emphasized this distinction, saying \"my Father and your Father\" (abbreviated) - 2736 (in 'Filial Trust') - Are we asking God for \"what is good for us\"? Our Father knows what we need before we ask him, but he awaits our petition because the dignity of his children lies in their freedom. We must pray, then, with his Spirit of freedom, to be able truly to know what he wants. - 1969 (in 'The New Law') - The New Law practices the acts of religion: almsgiving, prayer and fasting, directing them to the \"Father who sees in secret,\" in contrast with the desire to \"be seen by men.\" Its prayer is the Our Father. - 268 (in 'The Almighty') - of all the divine attributes, only God's omnipotence is named in the Creed: to confess this power has great bearing on our lives. We believe that his might is universal, for God who created everything also rules everything and can do everything. God's power is loving, for he is our Father, and mysterious, for only faith can discern it when it \"is made perfect in weakness\". - 2632 (in 'Prayer of Petition') - Christian petition is centered on the desire and search for the Kingdom to come, in keeping with the teaching of Christ. There is a hierarchy in these petitions: we pray first for the Kingdom, then for what is necessary to welcome it and cooperate with its coming. .. By prayer every baptized person works for the coming of the Kingdom (abbreviated) - 2659 (in 'Today') - We learn to pray at certain moments by hearing the Word of the Lord and sharing in his Paschal mystery, but his Spirit is offered us at all times, in the events of each day, to make prayer spring up from us. Jesus' teaching about praying to our Father is in the same vein as his teaching about providence: time is in the Father's hands; it is in the present that we encounter him, not yesterday nor tomorrow, but today: \"O that today you would hearken to his voice! Harden not your hearts.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1422338,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1D0QnFZWY8rNxEb3kQnASy"
    },
    "href": "https://api.spotify.com/v1/episodes/1D0QnFZWY8rNxEb3kQnASy",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 6: 7-15 - &#39;How to pray.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2759-2856 - Entire section of the Catechism which covers the Our Father.</p><br/><p>- 2608 (in &#39;Jesus teaches us how to pray&#39;) - From the Sermon on the Mount onwards, Jesus insists on conversion of heart: reconciliation with one&#39;s brother before presenting an offering on the altar, love of enemies, and prayer for persecutors, prayer to the Father in secret, not heaping up empty phrases, prayerful forgiveness from the depths of the heart, purity of heart, and seeking the Kingdom before all else. This filial conversion is entirely directed to the Father.</p><br/><p>- 2668 (in &#39;Prayer to Jesus&#39;) - The invocation of the holy name of Jesus is the simplest way of praying always. When the holy name is repeated often by a humbly attentive heart, the prayer is not lost by heaping up empty phrases, but holds fast to the word and &#34;brings forth fruit with patience.&#34; This prayer is possible &#34;at all times&#34; because it is not one occupation among others but the only occupation: that of loving God, which animates and transfigures every action in Christ Jesus.</p><br/><p>- 443 (in &#39;The Only Son of God&#39;) - He distinguished his sonship from that of his disciples by never saying &#34;our Father&#34;, except to command them: &#34;You, then, pray like this: &#39;Our Father&#39;&#34;, and he emphasized this distinction, saying &#34;my Father and your Father&#34; (abbreviated)</p><br/><p>- 2736 (in &#39;Filial Trust&#39;) - Are we asking God for &#34;what is good for us&#34;? Our Father knows what we need before we ask him, but he awaits our petition because the dignity of his children lies in their freedom. We must pray, then, with his Spirit of freedom, to be able truly to know what he wants.</p><br/><p>- 1969 (in &#39;The New Law&#39;) - The New Law practices the acts of religion: almsgiving, prayer and fasting, directing them to the &#34;Father who sees in secret,&#34; in contrast with the desire to &#34;be seen by men.&#34; Its prayer is the Our Father.</p><br/><p>- 268 (in &#39;The Almighty&#39;) - of all the divine attributes, only God&#39;s omnipotence is named in the Creed: to confess this power has great bearing on our lives. We believe that his might is universal, for God who created everything also rules everything and can do everything. God&#39;s power is loving, for he is our Father, and mysterious, for only faith can discern it when it &#34;is made perfect in weakness&#34;.</p><br/><p>- 2632 (in &#39;Prayer of Petition&#39;) - Christian petition is centered on the desire and search for the Kingdom to come, in keeping with the teaching of Christ. There is a hierarchy in these petitions: we pray first for the Kingdom, then for what is necessary to welcome it and cooperate with its coming. .. By prayer every baptized person works for the coming of the Kingdom (abbreviated)</p><br/><p>- 2659 (in &#39;Today&#39;) - We learn to pray at certain moments by hearing the Word of the Lord and sharing in his Paschal mystery, but his Spirit is offered us at all times, in the events of each day, to make prayer spring up from us. Jesus&#39; teaching about praying to our Father is in the same vein as his teaching about providence: time is in the Father&#39;s hands; it is in the present that we encounter him, not yesterday nor tomorrow, but today: &#34;O that today you would hearken to his voice! Harden not your hearts.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1D0QnFZWY8rNxEb3kQnASy",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 1 of Lent - Matt 6: 7-15",
    "release_date": "2023-02-27",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1D0QnFZWY8rNxEb3kQnASy"
}