{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/38NEdwKYpPhcya0dPD0n2q/clip_427900_501700.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 9: 9-13 - 'It is not the healthy who need the doctor, but the sick.'  Catechism of the Catholic Church Paragraphs: - 581 (in 'Jesus and the Law') - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people \"as one who had authority, and not as their scribes\" In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes. Jesus did not abolish the Law but fulfilled it by giving its ultimate interpretation in a divine way: \"You have heard that it was said to the men of old. . . But I say to you. . .\"With this same divine authority, he disavowed certain human traditions of the Pharisees that were \"making void the word of God\" - 589 (in 'Jesus and Israel's faith in the one God and Saviour') - Jesus gave scandal above all when he identified his merciful conduct toward sinners with God's own attitude toward them. He went so far as to hint that by sharing the table of sinners he was admitting them to the messianic banquet (abbreviated). - 2100 (in 'Sacrifice') - Outward sacrifice, to be genuine, must be the expression of spiritual sacrifice: \"The sacrifice acceptable to God is a broken spirit....\" The prophets of the Old Covenant often denounced sacrifices that were not from the heart or not coupled with love of neighbor. Jesus recalls the words of the prophet Hosea: \"I desire mercy, and not sacrifice\" (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 970478,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1DzR3VEavjF6T0r7vwvt16"
    },
    "href": "https://api.spotify.com/v1/episodes/1DzR3VEavjF6T0r7vwvt16",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 9: 9-13 - &#39;It is not the healthy who need the doctor, but the sick.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 581 (in &#39;Jesus and the Law&#39;) - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people &#34;as one who had authority, and not as their scribes&#34; In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes. Jesus did not abolish the Law but fulfilled it by giving its ultimate interpretation in a divine way: &#34;You have heard that it was said to the men of old. . . But I say to you. . .&#34;With this same divine authority, he disavowed certain human traditions of the Pharisees that were &#34;making void the word of God&#34;</p><br/><p>- 589 (in &#39;Jesus and Israel&#39;s faith in the one God and Saviour&#39;) - Jesus gave scandal above all when he identified his merciful conduct toward sinners with God&#39;s own attitude toward them. He went so far as to hint that by sharing the table of sinners he was admitting them to the messianic banquet (abbreviated).</p><br/><p>- 2100 (in &#39;Sacrifice&#39;) - Outward sacrifice, to be genuine, must be the expression of spiritual sacrifice: &#34;The sacrifice acceptable to God is a broken spirit....&#34; The prophets of the Old Covenant often denounced sacrifices that were not from the heart or not coupled with love of neighbor. Jesus recalls the words of the prophet Hosea: &#34;I desire mercy, and not sacrifice&#34; (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1DzR3VEavjF6T0r7vwvt16",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of Saint Matthew, Apostle, Evangelist - Matt 9: 9-13",
    "release_date": "2023-09-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1DzR3VEavjF6T0r7vwvt16"
}