{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6UXBk7yXVAzAWxkxzAiU0p/clip_390400_457500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠  Mark 16: 9-15 - 'Go out to the whole world; proclaim the Good News.'  Catechism of the Catholic Church Paragraphs: - 643 (in 'The Appearances of the Risen One') - Given all these testimonies, Christ's Resurrection cannot be interpreted as something outside the physical order, and it is impossible not to acknowledge it as an historical fact. It is clear from the facts that the disciples' faith was drastically put to the test by their master's Passion and death on the cross, which he had foretold. The shock provoked by the Passion was so great that at least some of the disciples did not at once believe in the news of the Resurrection. Far from showing us a community seized by a mystical exaltation, the Gospels present us with disciples demoralized (\"looking sad\") and frightened. For they had not believed the holy women returning from the tomb and had regarded their words as an \"idle tale\". When Jesus reveals himself to the Eleven on Easter evening, \"he upbraided them for their unbelief and hardness of heart, because they had not believed those who saw him after he had risen.\" - 888 (in 'The Teaching Office') - Bishops, with priests as co-workers, have as their first task \"to preach the Gospel of God to all men,\" in keeping with the Lord's command. They are \"heralds of faith, who draw new disciples to Christ; they are authentic teachers\" of the apostolic faith \"endowed with the authority of Christ.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 853077,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1F79FWtkbAwqVCxcDb1Jth"
    },
    "href": "https://api.spotify.com/v1/episodes/1F79FWtkbAwqVCxcDb1Jth",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠</a></p><br/><p><br /></p><br/><p>Mark 16: 9-15 - &#39;Go out to the whole world; proclaim the Good News.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 643 (in &#39;The Appearances of the Risen One&#39;) - Given all these testimonies, Christ&#39;s Resurrection cannot be interpreted as something outside the physical order, and it is impossible not to acknowledge it as an historical fact. It is clear from the facts that the disciples&#39; faith was drastically put to the test by their master&#39;s Passion and death on the cross, which he had foretold. The shock provoked by the Passion was so great that at least some of the disciples did not at once believe in the news of the Resurrection. Far from showing us a community seized by a mystical exaltation, the Gospels present us with disciples demoralized (&#34;looking sad&#34;) and frightened. For they had not believed the holy women returning from the tomb and had regarded their words as an &#34;idle tale&#34;. When Jesus reveals himself to the Eleven on Easter evening, &#34;he upbraided them for their unbelief and hardness of heart, because they had not believed those who saw him after he had risen.&#34;</p><br/><p>- 888 (in &#39;The Teaching Office&#39;) - Bishops, with priests as co-workers, have as their first task &#34;to preach the Gospel of God to all men,&#34; in keeping with the Lord&#39;s command. They are &#34;heralds of faith, who draw new disciples to Christ; they are authentic teachers&#34; of the apostolic faith &#34;endowed with the authority of Christ.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1F79FWtkbAwqVCxcDb1Jth",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Easter Saturday - Mark 16: 9-15",
    "release_date": "2023-04-14",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1F79FWtkbAwqVCxcDb1Jth"
}