{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/13vB2DV9MkKJFd13wJI5Sc/clip_566600_629400.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 8: 5-17 - 'I am not worthy to have you under my roof: give the word, and my servant will be healed.'  Catechism of the Catholic Church Paragraphs: - 1386 (In 'Take this all of you and eat') - Before so great a sacrament, the faithful can only echo humbly and with ardent faith the words of the Centurion: “Domine, non sum dignus ut intres sub tectum meum, sed tantum dic verbo, et sanabitur anima mea” (“Lord, I am not worthy that you should enter under my roof, but only say the word and my soul shall be healed)” (abbreviated) - 2610 (In 'Jesus prays') - Jesus is as saddened by the “lack of faith” of his own neighbors and the “little faith” of his own disciples as he is struck with admiration at the great faith of the Roman centurion and the Canaanite woman. (abbreviated) - 543 (In 'The Proclamation of the Kingdom of God') - Everyone is called to enter the kingdom. First announced to the children of Israel, this messianic kingdom is intended to accept men of all nations (abbreviated). - 517 (in 'Characteristics common to Jesus' mysteries') - Christ's whole life is a mystery of redemption. Redemption comes to us above all through the blood of his cross, but this mystery is at work throughout Christ's entire life: -already in his Incarnation through which by becoming poor he enriches us with his poverty; - in his hidden life which by his submission atones for our disobedience; - in his word which purifies its hearers; - in his healings and exorcisms by which \"he took our infirmities and bore our diseases\"; - and in his Resurrection by which he justifies us. - 1505 (in 'Christ the Physician') - Moved by so much suffering Christ not only allows himself to be touched by the sick, but he makes their miseries his own: \"He took our infirmities and bore our diseases.\" But he did not heal all the sick. His healings were signs of the coming of the Kingdom of God. They announced a more radical healing: the victory over sin and death through his Passover. On the cross Christ took upon himself the whole weight of evil and took away the \"sin of the world,\" of which illness is only a consequence. By his passion and death on the cross Christ has given a new meaning to suffering: it can henceforth configure us to him and unite us with his redemptive Passion..  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1374737,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1LQkOfrB4k5uvlk71ErnKo"
    },
    "href": "https://api.spotify.com/v1/episodes/1LQkOfrB4k5uvlk71ErnKo",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 8: 5-17 - &#39;I am not worthy to have you under my roof: give the word, and my servant will be healed.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1386 (In &#39;Take this all of you and eat&#39;) - Before so great a sacrament, the faithful can only echo humbly and with ardent faith the words of the Centurion: “Domine, non sum dignus ut intres sub tectum meum, sed tantum dic verbo, et sanabitur anima mea” (“Lord, I am not worthy that you should enter under my roof, but only say the word and my soul shall be healed)” (abbreviated)</p><br/><p>- 2610 (In &#39;Jesus prays&#39;) - Jesus is as saddened by the “lack of faith” of his own neighbors and the “little faith” of his own disciples as he is struck with admiration at the great faith of the Roman centurion and the Canaanite woman. (abbreviated)</p><br/><p>- 543 (In &#39;The Proclamation of the Kingdom of God&#39;) - Everyone is called to enter the kingdom. First announced to the children of Israel, this messianic kingdom is intended to accept men of all nations (abbreviated).</p><br/><p>- 517 (in &#39;Characteristics common to Jesus&#39; mysteries&#39;) - Christ&#39;s whole life is a mystery of redemption. Redemption comes to us above all through the blood of his cross, but this mystery is at work throughout Christ&#39;s entire life: -already in his Incarnation through which by becoming poor he enriches us with his poverty; - in his hidden life which by his submission atones for our disobedience; - in his word which purifies its hearers; - in his healings and exorcisms by which &#34;he took our infirmities and bore our diseases&#34;; - and in his Resurrection by which he justifies us.</p><br/><p>- 1505 (in &#39;Christ the Physician&#39;) - Moved by so much suffering Christ not only allows himself to be touched by the sick, but he makes their miseries his own: &#34;He took our infirmities and bore our diseases.&#34; But he did not heal all the sick. His healings were signs of the coming of the Kingdom of God. They announced a more radical healing: the victory over sin and death through his Passover. On the cross Christ took upon himself the whole weight of evil and took away the &#34;sin of the world,&#34; of which illness is only a consequence. By his passion and death on the cross Christ has given a new meaning to suffering: it can henceforth configure us to him and unite us with his redemptive Passion..</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1LQkOfrB4k5uvlk71ErnKo",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 12 in Ordinary Time - Matt 8: 5-17",
    "release_date": "2023-06-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1LQkOfrB4k5uvlk71ErnKo"
}