{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3vR6eND6PUUFq6JLRKlQx5/clip_1720500_1771800.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 9: 28b-36 - 'Jesus was transfigured before them.'  Catechism of the Catholic Church Paragraphs: - 2600 (in 'Jesus Prays') - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ's ministry. Jesus prays before the decisive moments of his mission: before his Father's witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father's plan of love by his Passion (abbreviated). - 2583 (in Elijah, the prophets and conversion of heart') - Finally, taking the desert road that leads to the place where the living and true God reveals himself to his people, Elijah, like Moses before him, hides \"in a cleft of the rock\" until the mysterious presence of God has passed by. But only on the mountain of the Transfiguration will Moses and Elijah behold the unveiled face of him whom they sought; \"the light of the knowledge of the glory of God [shines] in the face of Christ,\" crucified and risen (abbreviated). - 554 (in 'A Foretaste of the Kingdom: the Transfiguration) - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master \"began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised.\" Peter scorns this prediction, nor do the others understand it any better than he. In this context the mysterious episode of Jesus' Transfiguration takes place on a high mountain, before three witnesses chosen by himself: Peter, James and John. Jesus' face and clothes become dazzling with light, and Moses and Elijah appear, speaking \"of his departure, which he was to accomplish at Jerusalem\". A cloud covers him and a voice from heaven says: \"This is my Son, my Chosen; listen to him!\" - 556 (in 'A Foretaste of the Kingdom: the Transfiguration) - On the threshold of the public life: the baptism; on the threshold of the Passover: the Transfiguration. Jesus' baptism proclaimed \"the mystery of the first regeneration\", namely, our Baptism; the Transfiguration \"is the sacrament of the second regeneration\": our own Resurrection. From now on we share in the Lord's Resurrection through the Spirit who acts in the sacraments of the Body of Christ. the Transfiguration gives us a foretaste of Christ's glorious coming, when he \"will change our lowly body to be like his glorious body.\" But it also recalls that \"it is through many persecutions that we must enter the kingdom of God\": - 1151 (in 'Signs and Symbols') - He gives new meaning to the deeds and signs of the Old Covenant, above all to the Exodus and the Passover, for he himself is the meaning of all these signs (abbreviated). - 516 (in 'Characteristics common to Jesus' mysteries') - Christ's whole earthly life - his words and deeds, his silences and sufferings, indeed his manner of being and speaking - is Revelation of the Father. Jesus can say: \"Whoever has seen me has seen the Father\", and the Father can say: \"This is my Son, my Chosen; listen to him!\" (abbreviated). - 697 (in 'Symbols of the Holy Spirit')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1854322,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1oqvqPkktjVtIqkH8kU3bq"
    },
    "href": "https://api.spotify.com/v1/episodes/1oqvqPkktjVtIqkH8kU3bq",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 9: 28b-36 - &#39;Jesus was transfigured before them.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2600 (in &#39;Jesus Prays&#39;) - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ&#39;s ministry. Jesus prays before the decisive moments of his mission: before his Father&#39;s witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father&#39;s plan of love by his Passion (abbreviated).</p><br/><p>- 2583 (in Elijah, the prophets and conversion of heart&#39;) - Finally, taking the desert road that leads to the place where the living and true God reveals himself to his people, Elijah, like Moses before him, hides &#34;in a cleft of the rock&#34; until the mysterious presence of God has passed by. But only on the mountain of the Transfiguration will Moses and Elijah behold the unveiled face of him whom they sought; &#34;the light of the knowledge of the glory of God [shines] in the face of Christ,&#34; crucified and risen (abbreviated).</p><br/><p>- 554 (in &#39;A Foretaste of the Kingdom: the Transfiguration) - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master &#34;began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised.&#34; Peter scorns this prediction, nor do the others understand it any better than he. In this context the mysterious episode of Jesus&#39; Transfiguration takes place on a high mountain, before three witnesses chosen by himself: Peter, James and John. Jesus&#39; face and clothes become dazzling with light, and Moses and Elijah appear, speaking &#34;of his departure, which he was to accomplish at Jerusalem&#34;. A cloud covers him and a voice from heaven says: &#34;This is my Son, my Chosen; listen to him!&#34;</p><br/><p>- 556 (in &#39;A Foretaste of the Kingdom: the Transfiguration) - On the threshold of the public life: the baptism; on the threshold of the Passover: the Transfiguration. Jesus&#39; baptism proclaimed &#34;the mystery of the first regeneration&#34;, namely, our Baptism; the Transfiguration &#34;is the sacrament of the second regeneration&#34;: our own Resurrection. From now on we share in the Lord&#39;s Resurrection through the Spirit who acts in the sacraments of the Body of Christ. the Transfiguration gives us a foretaste of Christ&#39;s glorious coming, when he &#34;will change our lowly body to be like his glorious body.&#34; But it also recalls that &#34;it is through many persecutions that we must enter the kingdom of God&#34;:</p><br/><p>- 1151 (in &#39;Signs and Symbols&#39;) - He gives new meaning to the deeds and signs of the Old Covenant, above all to the Exodus and the Passover, for he himself is the meaning of all these signs (abbreviated).</p><br/><p>- 516 (in &#39;Characteristics common to Jesus&#39; mysteries&#39;) - Christ&#39;s whole earthly life - his words and deeds, his silences and sufferings, indeed his manner of being and speaking - is Revelation of the Father. Jesus can say: &#34;Whoever has seen me has seen the Father&#34;, and the Father can say: &#34;This is my Son, my Chosen; listen to him!&#34; (abbreviated).</p><br/><p>- 697 (in &#39;Symbols of the Holy Spirit&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1oqvqPkktjVtIqkH8kU3bq",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of the Transfiguration of the Lord (Year C) - Luke 9: 28-36",
    "release_date": "2022-08-05",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1oqvqPkktjVtIqkH8kU3bq"
}