{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/46jGiLGMAsu88rUsZBte6A/clip_870800_926700.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 12: 1-11 - 'She had to keep this scent for the day of my burial.'  Catechism of the Catholic Church Paragraphs: - 2449 (in 'Love for the Poor') - Beginning with the Old Testament, all kinds of juridical measures (the jubilee year of forgiveness of debts, prohibition of loans at interest and the keeping of collateral, the obligation to tithe, the daily payment of the day-laborer, the right to glean vines and fields) answer the exhortation of Deuteronomy: \"For the poor will never cease out of the land; therefore I command you, 'You shall open wide your hand to your brother, to the needy and to the poor in the land.'\" Jesus makes these words his own: \"The poor you always have with you, but you do not always have me.\" In so doing he does not soften the vehemence of former oracles against \"buying the poor for silver and the needy for a pair of sandals . . .,\" but invites us to recognize his own presence in the poor who are his brethren: When her mother reproached her for caring for the poor and the sick at home, St. Rose of Lima said to her: \"When we serve the poor and the sick, we serve Jesus. We must not fail to help our neighbors, because in them we serve Jesus.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1178435,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1PRifQS55JPKlklxaqI0ap"
    },
    "href": "https://api.spotify.com/v1/episodes/1PRifQS55JPKlklxaqI0ap",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 12: 1-11 - &#39;She had to keep this scent for the day of my burial.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2449 (in &#39;Love for the Poor&#39;) - Beginning with the Old Testament, all kinds of juridical measures (the jubilee year of forgiveness of debts, prohibition of loans at interest and the keeping of collateral, the obligation to tithe, the daily payment of the day-laborer, the right to glean vines and fields) answer the exhortation of Deuteronomy: &#34;For the poor will never cease out of the land; therefore I command you, &#39;You shall open wide your hand to your brother, to the needy and to the poor in the land.&#39;&#34; Jesus makes these words his own: &#34;The poor you always have with you, but you do not always have me.&#34; In so doing he does not soften the vehemence of former oracles against &#34;buying the poor for silver and the needy for a pair of sandals . . .,&#34; but invites us to recognize his own presence in the poor who are his brethren:<br /><br/>When her mother reproached her for caring for the poor and the sick at home, St. Rose of Lima said to her: &#34;When we serve the poor and the sick, we serve Jesus. We must not fail to help our neighbors, because in them we serve Jesus.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1PRifQS55JPKlklxaqI0ap",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Holy Week - John 12: 1-11",
    "release_date": "2023-04-02",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1PRifQS55JPKlklxaqI0ap"
}