{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5uLly9ShUVhvN3zyoQKpyK/clip_930700_976500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 19: 3-12 - 'Husband and wife are no longer two, but one body.'  Catechism of the Catholic Church Paragraphs: - 1614-1615 (in 'Marriage in the Lord') - In his preaching Jesus unequivocally taught the original meaning of the union of man and woman as the Creator willed it from the beginning permission given by Moses to divorce one's wife was a concession to the hardness of hearts. The matrimonial union of man and woman is indissoluble: God himself has determined it \"what therefore God has joined together, let no man put asunder.\" This unequivocal insistence on the indissolubility of the marriage bond may have left some perplexed and could seem to be a demand impossible to realize. However, Jesus has not placed on spouses a burden impossible to bear, or too heavy - heavier than the Law of Moses. By coming to restore the original order of creation disturbed by sin, he himself gives the strength and grace to live marriage in the new dimension of the Reign of God. It is by following Christ, renouncing themselves, and taking up their crosses that spouses will be able to \"receive\" the original meaning of marriage and live it with the help of Christ. This grace of Christian marriage is a fruit of Christ's cross, the source of all Christian life. - 1618 (in 'Virginity for the sake of the Kingdom') - Christ is the center of all Christian life. the bond with him takes precedence over all other bonds, familial or social. From the very beginning of the Church there have been men and women who have renounced the great good of marriage to follow the Lamb wherever he goes, to be intent on the things of the Lord, to seek to please him, and to go out to meet the Bridegroom who is coming. Christ himself has invited certain persons to follow him in this way of life, of which he remains the model: \"For there are eunuchs who have been so from birth, and there are eunuchs who have been made eunuchs by men, and there are eunuchs who have made themselves eunuchs for the sake of the kingdom of heaven. He who is able to receive this, let him receive it.\" - 1579 (in 'Who can receive this sacrament?') - All the ordained ministers of the Latin Church, with the exception of permanent deacons, are normally chosen from among men of faith who live a celibate life and who intend to remain celibate \"for the sake of the kingdom of heaven.\" Called to consecrate themselves with undivided heart to the Lord and to \"the affairs of the Lord,\" they give themselves entirely to God and to men. Celibacy is a sign of this new life to the service of which the Church's minister is consecrated; accepted with a joyous heart celibacy radiantly proclaims the Reign of God. - 922 (in 'Consecrated Virgins') - From apostolic times Christian virgins and widows, called by the Lord to cling only to him with greater freedom of heart, body, and spirit, have decided with the Church's approval to live in a state of virginity \"for the sake of the Kingdom of heaven.\" - 2364 (in 'Conjugal Fidelity') - 2380 (in 'Adultery') - 2382 (in' Divorce') - 2400 (in 'The Sixth Commandment') - 1605 (in 'Marriage in the Order of Creation') - 1610 (in 'Marriage under the pedagogy of the Law') - 1620 (in 'Virginity for the sake of the Kingdom') - 1644 (in 'The Unity and Indissolubility of Marriage') - 1652 (in 'The Openness to Fertility')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2700364,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1tfbD65cZkwH3noxw8Dl37"
    },
    "href": "https://api.spotify.com/v1/episodes/1tfbD65cZkwH3noxw8Dl37",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 19: 3-12 - &#39;Husband and wife are no longer two, but one body.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1614-1615 (in &#39;Marriage in the Lord&#39;) - In his preaching Jesus unequivocally taught the original meaning of the union of man and woman as the Creator willed it from the beginning permission given by Moses to divorce one&#39;s wife was a concession to the hardness of hearts. The matrimonial union of man and woman is indissoluble: God himself has determined it &#34;what therefore God has joined together, let no man put asunder.&#34; This unequivocal insistence on the indissolubility of the marriage bond may have left some perplexed and could seem to be a demand impossible to realize. However, Jesus has not placed on spouses a burden impossible to bear, or too heavy - heavier than the Law of Moses. By coming to restore the original order of creation disturbed by sin, he himself gives the strength and grace to live marriage in the new dimension of the Reign of God. It is by following Christ, renouncing themselves, and taking up their crosses that spouses will be able to &#34;receive&#34; the original meaning of marriage and live it with the help of Christ. This grace of Christian marriage is a fruit of Christ&#39;s cross, the source of all Christian life.</p><br/><p>- 1618 (in &#39;Virginity for the sake of the Kingdom&#39;) - Christ is the center of all Christian life. the bond with him takes precedence over all other bonds, familial or social. From the very beginning of the Church there have been men and women who have renounced the great good of marriage to follow the Lamb wherever he goes, to be intent on the things of the Lord, to seek to please him, and to go out to meet the Bridegroom who is coming. Christ himself has invited certain persons to follow him in this way of life, of which he remains the model: &#34;For there are eunuchs who have been so from birth, and there are eunuchs who have been made eunuchs by men, and there are eunuchs who have made themselves eunuchs for the sake of the kingdom of heaven. He who is able to receive this, let him receive it.&#34;</p><br/><p>- 1579 (in &#39;Who can receive this sacrament?&#39;) - All the ordained ministers of the Latin Church, with the exception of permanent deacons, are normally chosen from among men of faith who live a celibate life and who intend to remain celibate &#34;for the sake of the kingdom of heaven.&#34; Called to consecrate themselves with undivided heart to the Lord and to &#34;the affairs of the Lord,&#34; they give themselves entirely to God and to men. Celibacy is a sign of this new life to the service of which the Church&#39;s minister is consecrated; accepted with a joyous heart celibacy radiantly proclaims the Reign of God.</p><br/><p>- 922 (in &#39;Consecrated Virgins&#39;) - From apostolic times Christian virgins and widows, called by the Lord to cling only to him with greater freedom of heart, body, and spirit, have decided with the Church&#39;s approval to live in a state of virginity &#34;for the sake of the Kingdom of heaven.&#34;</p><br/><p>- 2364 (in &#39;Conjugal Fidelity&#39;)</p><br/><p>- 2380 (in &#39;Adultery&#39;)</p><br/><p>- 2382 (in&#39; Divorce&#39;)</p><br/><p>- 2400 (in &#39;The Sixth Commandment&#39;)</p><br/><p>- 1605 (in &#39;Marriage in the Order of Creation&#39;)</p><br/><p>- 1610 (in &#39;Marriage under the pedagogy of the Law&#39;)</p><br/><p>- 1620 (in &#39;Virginity for the sake of the Kingdom&#39;)</p><br/><p>- 1644 (in &#39;The Unity and Indissolubility of Marriage&#39;)</p><br/><p>- 1652 (in &#39;The Openness to Fertility&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1tfbD65cZkwH3noxw8Dl37",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 19 in Ordinary Time - Matt 19: 2-12",
    "release_date": "2023-08-17",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1tfbD65cZkwH3noxw8Dl37"
}