{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0nDZV96upGKktlcdpjgI1F/clip_572593_632593.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 4: 5-42 - 'A spring of water welling up to eternal life.'  Catechism of the Catholic Church Paragraphs: - 544 (in 'The Proclamation of the Kingdom of God') - Jesus shares the life of the poor, from the cradle to the cross; he experiences hunger, thirst and privation. Jesus identifies himself with the poor of every kind and makes active love toward them the condition for entering his kingdom (abbreviated). - 694 (in 'Symbols of the Holy Spirit') - Water. the symbolism of water signifies the Holy Spirit's action in Baptism, since after the invocation of the Holy Spirit it becomes the efficacious sacramental sign of new birth: just as the gestation of our first birth took place in water, so the water of Baptism truly signifies that our birth into the divine life is given to us in the Holy Spirit. As \"by one Spirit we were all baptized,\" so we are also \"made to drink of one Spirit.\" Thus the Spirit is also personally the living water welling up from Christ crucified as its source and welling up in us to eternal life. - 586 (in' Jesus and the Temple') - Far from having been hostile to the Temple, where he gave the essential part of his teaching, Jesus was willing to pay the Temple-tax, associating with him Peter, whom he had just made the foundation of his future Church. He even identified himself with the Temple by presenting himself as God's definitive dwelling-place among men .Therefore his being put to bodily death presaged the destruction of the Temple, which would manifest the dawning of a new age in the history of salvation: \"The hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.\" - 439 (in 'Christ') - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic \"Son of David\", promised by God to Israel. Jesus accepted his rightful title of Messiah, though with some reserve because it was understood by some of his contemporaries in too human a sense, as essentially political.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 690282,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1v87n2EiqWQmJOvLZEFWdG"
    },
    "href": "https://api.spotify.com/v1/episodes/1v87n2EiqWQmJOvLZEFWdG",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 4: 5-42 - &#39;A spring of water welling up to eternal life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 544 (in &#39;The Proclamation of the Kingdom of God&#39;) - Jesus shares the life of the poor, from the cradle to the cross; he experiences hunger, thirst and privation. Jesus identifies himself with the poor of every kind and makes active love toward them the condition for entering his kingdom (abbreviated).</p><br/><p>- 694 (in &#39;Symbols of the Holy Spirit&#39;) - Water. the symbolism of water signifies the Holy Spirit&#39;s action in Baptism, since after the invocation of the Holy Spirit it becomes the efficacious sacramental sign of new birth: just as the gestation of our first birth took place in water, so the water of Baptism truly signifies that our birth into the divine life is given to us in the Holy Spirit. As &#34;by one Spirit we were all baptized,&#34; so we are also &#34;made to drink of one Spirit.&#34; Thus the Spirit is also personally the living water welling up from Christ crucified as its source and welling up in us to eternal life.</p><br/><p>- 586 (in&#39; Jesus and the Temple&#39;) - Far from having been hostile to the Temple, where he gave the essential part of his teaching, Jesus was willing to pay the Temple-tax, associating with him Peter, whom he had just made the foundation of his future Church. He even identified himself with the Temple by presenting himself as God&#39;s definitive dwelling-place among men .Therefore his being put to bodily death presaged the destruction of the Temple, which would manifest the dawning of a new age in the history of salvation: &#34;The hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.&#34;</p><br/><p>- 439 (in &#39;Christ&#39;) - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic &#34;Son of David&#34;, promised by God to Israel. Jesus accepted his rightful title of Messiah, though with some reserve because it was understood by some of his contemporaries in too human a sense, as essentially political.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1v87n2EiqWQmJOvLZEFWdG",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "3rd Sunday of Lent (Year A) - John 4: 5-42",
    "release_date": "2023-03-11",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1v87n2EiqWQmJOvLZEFWdG"
}