{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/04ed3q1t7w5yMqyZsyDM58/clip_1522100_1587600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 5: 1-12 - 'How happy are the poor in spirit.'  Catechism of the Catholic Church Paragraphs: - 1716-1717 ('The Beatitudes') - The Beatitudes are at the heart of Jesus' preaching. They take up the promises made to the chosen people since Abraham. the Beatitudes fulfill the promises by ordering them no longer merely to the possession of a territory, but to the Kingdom of heaven....The Beatitudes depict the countenance of Jesus Christ and portray his charity. They express the vocation of the faithful associated with the glory of his Passion and Resurrection; they shed light on the actions and attitudes characteristic of the Christian life; they are the paradoxical promises that sustain hope in the midst of tribulations; they proclaim the blessings and rewards already secured, however dimly, for Christ's disciples; they have begun in the lives of the Virgin Mary and all the saints. - 581 (in 'Jesus and the Law') - In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes (abbreviated). - 544 (in 'The Proclamation of the Kingdom of God') - The kingdom belongs to the poor and lowly, which means those who have accepted it with humble hearts. Jesus is sent to \"preach good news to the poor\"; he declares them blessed, for \"theirs is the kingdom of heaven.\" To them - the \"little ones\" the Father is pleased to reveal what remains hidden from the wise and the learned (abbreviated). - 2546 (in 'Poverty of Heart') - \"Blessed are the poor in spirit.\" The Beatitudes reveal an order of happiness and grace, of beauty and peace. Jesus celebrates the joy of the poor, to whom the Kingdom already belongs: The Word speaks of voluntary humility as \"poverty in spirit\"; the Apostle gives an example of God's poverty when he says: \"For your sakes he became poor.\" - 1720 (in 'Christian Beatitude') - The New Testament uses several expressions to characterize the beatitude to which God calls man: the vision of God: \"Blessed are the pure in heart, for they shall see God\"...There we shall rest and see, we shall see and love, we shall love and praise. Behold what will be at the end without end. For what other end do we have, if not to reach the kingdom which has no end? (abbreviated). - 2518 (in 'Purification of the Heart') - The sixth beatitude proclaims, \"Blessed are the pure in heart, for they shall see God.\" \"Pure in heart\" refers to those who have attuned their intellects and wills to the demands of God's holiness, chiefly in three areas: charity; chastity or sexual rectitude; love of truth and orthodoxy of faith. There is a connection between purity of heart, of body, and of faith: The faithful must believe the articles of the Creed \"so that by believing they may obey God, by obeying may live well, by living well may purify their hearts, and with pure hearts may understand what they believe. - 2330 (in 'The Fifth Commandment') - \"Blessed are the peacemakers, for they shall be called sons of God\" - 520 (in 'Our Communion in the mysteries of Jesus') - In all of his life Jesus presents himself as our model. He is \"the perfect man\", who invites us to become his disciples and follow him. In humbling himself, he has given us an example to imitate, through his prayer he draws us to pray, and by his poverty he calls us to accept freely the privation and persecutions that may come our way.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2079856,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/1wZw9kchwbB76SYAlVN43r"
    },
    "href": "https://api.spotify.com/v1/episodes/1wZw9kchwbB76SYAlVN43r",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 5: 1-12 - &#39;How happy are the poor in spirit.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1716-1717 (&#39;The Beatitudes&#39;) - The Beatitudes are at the heart of Jesus&#39; preaching. They take up the promises made to the chosen people since Abraham. the Beatitudes fulfill the promises by ordering them no longer merely to the possession of a territory, but to the Kingdom of heaven....The Beatitudes depict the countenance of Jesus Christ and portray his charity. They express the vocation of the faithful associated with the glory of his Passion and Resurrection; they shed light on the actions and attitudes characteristic of the Christian life; they are the paradoxical promises that sustain hope in the midst of tribulations; they proclaim the blessings and rewards already secured, however dimly, for Christ&#39;s disciples; they have begun in the lives of the Virgin Mary and all the saints.</p><br/><p>- 581 (in &#39;Jesus and the Law&#39;) - In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes (abbreviated).</p><br/><p>- 544 (in &#39;The Proclamation of the Kingdom of God&#39;) - The kingdom belongs to the poor and lowly, which means those who have accepted it with humble hearts. Jesus is sent to &#34;preach good news to the poor&#34;; he declares them blessed, for &#34;theirs is the kingdom of heaven.&#34; To them - the &#34;little ones&#34; the Father is pleased to reveal what remains hidden from the wise and the learned (abbreviated).</p><br/><p>- 2546 (in &#39;Poverty of Heart&#39;) - &#34;Blessed are the poor in spirit.&#34; The Beatitudes reveal an order of happiness and grace, of beauty and peace. Jesus celebrates the joy of the poor, to whom the Kingdom already belongs: The Word speaks of voluntary humility as &#34;poverty in spirit&#34;; the Apostle gives an example of God&#39;s poverty when he says: &#34;For your sakes he became poor.&#34;</p><br/><p>- 1720 (in &#39;Christian Beatitude&#39;) - The New Testament uses several expressions to characterize the beatitude to which God calls man: the vision of God: &#34;Blessed are the pure in heart, for they shall see God&#34;...There we shall rest and see, we shall see and love, we shall love and praise. Behold what will be at the end without end. For what other end do we have, if not to reach the kingdom which has no end? (abbreviated).</p><br/><p>- 2518 (in &#39;Purification of the Heart&#39;) - The sixth beatitude proclaims, &#34;Blessed are the pure in heart, for they shall see God.&#34; &#34;Pure in heart&#34; refers to those who have attuned their intellects and wills to the demands of God&#39;s holiness, chiefly in three areas: charity; chastity or sexual rectitude; love of truth and orthodoxy of faith. There is a connection between purity of heart, of body, and of faith: The faithful must believe the articles of the Creed &#34;so that by believing they may obey God, by obeying may live well, by living well may purify their hearts, and with pure hearts may understand what they believe.</p><br/><p>- 2330 (in &#39;The Fifth Commandment&#39;) - &#34;Blessed are the peacemakers, for they shall be called sons of God&#34;</p><br/><p>- 520 (in &#39;Our Communion in the mysteries of Jesus&#39;) - In all of his life Jesus presents himself as our model. He is &#34;the perfect man&#34;, who invites us to become his disciples and follow him. In humbling himself, he has given us an example to imitate, through his prayer he draws us to pray, and by his poverty he calls us to accept freely the privation and persecutions that may come our way.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "1wZw9kchwbB76SYAlVN43r",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of All Saints - Matt 5: 1-12",
    "release_date": "2023-10-31",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:1wZw9kchwbB76SYAlVN43r"
}