{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7CpyiGbUyYg6DmPveDPLry/clip_638743_698743.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 18: 9-14 - 'The tax collector, not the Pharisee, went home justified.'  Catechism of the Catholic Church Paragraphs: - 2559 (in 'Prayer as God's gift') - \"Prayer is the raising of one's mind and heart to God or the requesting of good things from God.\" But when we pray, do we speak from the height of our pride and will, or \"out of the depths\" of a humble and contrite heart? He who humbles himself will be exalted; humility is the foundation of prayer, Only when we humbly acknowledge that \"we do not know how to pray as we ought,\" are we ready to receive freely the gift of prayer. \"Man is a beggar before God.\" - 2613 (in 'Jesus teaches us how to pray') - Three principal parables on prayer are transmitted to us by St. Luke: - the third parable, \"the Pharisee and the tax collector,\" concerns the humility of the heart that prays. \"God, be merciful to me a sinner!\" the Church continues to make this prayer its own: Kyrie eleison! (abbreviated). - 588 (in 'Jesus and Israel's faith in one God and Saviour') - Jesus scandalized the Pharisees by eating with tax collectors and sinners as familiarly as with themselves. Against those among them \"who trusted in themselves that they were righteous and despised others\", Jesus affirmed: \"I have not come to call the righteous, but sinners to repentance.\" - 2631 (in 'Prayer of Petition') - The first movement of the prayer of petition is asking forgiveness, like the tax collector in the parable: \"God, be merciful to me a sinner!\" It is a prerequisite for righteous and pure prayer. A trusting humility brings us back into the light of communion between the Father and his Son Jesus Christ and with one another, so that \"we receive from him whatever we ask.\" (abbreviated) - 2667 (in 'Prayer to Jesus') - This simple invocation of faith developed in the tradition of prayer under many forms in East and West. the most usual formulation, transmitted by the spiritual writers of the Sinai, Syria, and Mt. Athos, is the invocation, \"Lord Jesus Christ, Son of God, have mercy on us sinners.\" It combines the Christological hymn of Philippians 2:6-11 with the cry of the publican and the blind men begging for light. By it the heart is opened to human wretchedness and the Savior's mercy. - 2839 (in 'and forgive us our trespasses') - With bold confidence, we began praying to our Father. In begging him that his name be hallowed, we were in fact asking him that we ourselves might be always made more holy. But though we are clothed with the baptismal garment, we do not cease to sin, to turn away from God. Now, in this new petition, we return to him like the prodigal son and, like the tax collector, recognize that we are sinners before him. Our petition begins with a \"confession\" of our wretchedness and his mercy. Our hope is firm because, in his Son, \"we have redemption, the forgiveness of sins.\" We find the efficacious and undoubted sign of his forgiveness in the sacraments of his Church.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 923364,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/24PRuBGBtTiWVFiLzRLMN8"
    },
    "href": "https://api.spotify.com/v1/episodes/24PRuBGBtTiWVFiLzRLMN8",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 18: 9-14 - &#39;The tax collector, not the Pharisee, went home justified.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2559 (in &#39;Prayer as God&#39;s gift&#39;) - &#34;Prayer is the raising of one&#39;s mind and heart to God or the requesting of good things from God.&#34; But when we pray, do we speak from the height of our pride and will, or &#34;out of the depths&#34; of a humble and contrite heart? He who humbles himself will be exalted; humility is the foundation of prayer, Only when we humbly acknowledge that &#34;we do not know how to pray as we ought,&#34; are we ready to receive freely the gift of prayer. &#34;Man is a beggar before God.&#34;</p><br/><p>- 2613 (in &#39;Jesus teaches us how to pray&#39;) - Three principal parables on prayer are transmitted to us by St. Luke: - the third parable, &#34;the Pharisee and the tax collector,&#34; concerns the humility of the heart that prays. &#34;God, be merciful to me a sinner!&#34; the Church continues to make this prayer its own: Kyrie eleison! (abbreviated).</p><br/><p>- 588 (in &#39;Jesus and Israel&#39;s faith in one God and Saviour&#39;) - Jesus scandalized the Pharisees by eating with tax collectors and sinners as familiarly as with themselves. Against those among them &#34;who trusted in themselves that they were righteous and despised others&#34;, Jesus affirmed: &#34;I have not come to call the righteous, but sinners to repentance.&#34;</p><br/><p>- 2631 (in &#39;Prayer of Petition&#39;) - The first movement of the prayer of petition is asking forgiveness, like the tax collector in the parable: &#34;God, be merciful to me a sinner!&#34; It is a prerequisite for righteous and pure prayer. A trusting humility brings us back into the light of communion between the Father and his Son Jesus Christ and with one another, so that &#34;we receive from him whatever we ask.&#34; (abbreviated)</p><br/><p>- 2667 (in &#39;Prayer to Jesus&#39;) - This simple invocation of faith developed in the tradition of prayer under many forms in East and West. the most usual formulation, transmitted by the spiritual writers of the Sinai, Syria, and Mt. Athos, is the invocation, &#34;Lord Jesus Christ, Son of God, have mercy on us sinners.&#34; It combines the Christological hymn of Philippians 2:6-11 with the cry of the publican and the blind men begging for light. By it the heart is opened to human wretchedness and the Savior&#39;s mercy.</p><br/><p>- 2839 (in &#39;and forgive us our trespasses&#39;) - With bold confidence, we began praying to our Father. In begging him that his name be hallowed, we were in fact asking him that we ourselves might be always made more holy. But though we are clothed with the baptismal garment, we do not cease to sin, to turn away from God. Now, in this new petition, we return to him like the prodigal son and, like the tax collector, recognize that we are sinners before him. Our petition begins with a &#34;confession&#34; of our wretchedness and his mercy. Our hope is firm because, in his Son, &#34;we have redemption, the forgiveness of sins.&#34; We find the efficacious and undoubted sign of his forgiveness in the sacraments of his Church.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "24PRuBGBtTiWVFiLzRLMN8",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 3 of Lent - Luke 18: 9-14",
    "release_date": "2023-03-17",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:24PRuBGBtTiWVFiLzRLMN8"
}