{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6oR8EHU0pRKLAPREyBLsph/clip_422147_482147.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 4: 1-13 - 'The temptation in the wilderness.'  Catechism of the Catholic Church Paragraphs: - 695 (in 'Symbols of the Holy Spirit') - Anointing. the symbolism of anointing with oil also signifies the Holy Spirit, to the point of becoming a synonym for the Holy Spirit. In Christian initiation, anointing is the sacramental sign of Confirmation, called \"chrismation\" in the Churches of the East. Its full force can be grasped only in relation to the primary anointing accomplished by the Holy Spirit, that of Jesus. Christ (in Hebrew \"messiah\") means the one \"anointed\" by God's Spirit (abbreviated). - 2855 (in 'The Final Doxology') - The ruler of this world has mendaciously attributed to himself the three titles of kingship, power, and glory. Christ, the Lord, restores them to his Father and our Father, until he hands over the kingdom to him when the mystery of salvation will be brought to its completion and God will be all in all (abbreviated). - 2096 (in 'Adoration') - Adoration is the first act of the virtue of religion. To adore God is to acknowledge him as God, as the Creator and Savior, the Lord and Master of everything that exists, as infinite and merciful Love. \"You shall worship the Lord your God, and him only shall you serve,\" says Jesus, citing Deuteronomy. - 2119 (in 'Irreligion') - Tempting God consists in putting his goodness and almighty power to the test by word or deed. Thus Satan tried to induce Jesus to throw himself down from the Temple and, by this gesture, force God to act. Jesus opposed Satan with the word of God: \"You shall not put the LORD your God to the test.\" The challenge contained in such tempting of God wounds the respect and trust we owe our Creator and Lord. It always harbors doubt about his love, his providence, and his power. - 538 (in 'Jesus' Temptations') - The Gospels speak of a time of solitude for Jesus in the desert immediately after his baptism by John. Driven by the Spirit into the desert, Jesus remains there for forty days without eating; he lives among wild beasts, and angels minister to him. At the end of this time Satan tempts him three times, seeking to compromise his filial attitude toward God. Jesus rebuffs these attacks, which recapitulate the temptations of Adam in Paradise and of Israel in the desert, and the devil leaves him \"until an opportune time\".  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1668794,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/269olBD5NoN9h8H7DD3XO2"
    },
    "href": "https://api.spotify.com/v1/episodes/269olBD5NoN9h8H7DD3XO2",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 4: 1-13 - &#39;The temptation in the wilderness.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 695 (in &#39;Symbols of the Holy Spirit&#39;) - Anointing. the symbolism of anointing with oil also signifies the Holy Spirit, to the point of becoming a synonym for the Holy Spirit. In Christian initiation, anointing is the sacramental sign of Confirmation, called &#34;chrismation&#34; in the Churches of the East. Its full force can be grasped only in relation to the primary anointing accomplished by the Holy Spirit, that of Jesus. Christ (in Hebrew &#34;messiah&#34;) means the one &#34;anointed&#34; by God&#39;s Spirit (abbreviated).</p><br/><p>- 2855 (in &#39;The Final Doxology&#39;) - The ruler of this world has mendaciously attributed to himself the three titles of kingship, power, and glory. Christ, the Lord, restores them to his Father and our Father, until he hands over the kingdom to him when the mystery of salvation will be brought to its completion and God will be all in all (abbreviated).</p><br/><p>- 2096 (in &#39;Adoration&#39;) - Adoration is the first act of the virtue of religion. To adore God is to acknowledge him as God, as the Creator and Savior, the Lord and Master of everything that exists, as infinite and merciful Love. &#34;You shall worship the Lord your God, and him only shall you serve,&#34; says Jesus, citing Deuteronomy.</p><br/><p>- 2119 (in &#39;Irreligion&#39;) - Tempting God consists in putting his goodness and almighty power to the test by word or deed. Thus Satan tried to induce Jesus to throw himself down from the Temple and, by this gesture, force God to act. Jesus opposed Satan with the word of God: &#34;You shall not put the LORD your God to the test.&#34; The challenge contained in such tempting of God wounds the respect and trust we owe our Creator and Lord. It always harbors doubt about his love, his providence, and his power.</p><br/><p>- 538 (in &#39;Jesus&#39; Temptations&#39;) - The Gospels speak of a time of solitude for Jesus in the desert immediately after his baptism by John. Driven by the Spirit into the desert, Jesus remains there for forty days without eating; he lives among wild beasts, and angels minister to him. At the end of this time Satan tempts him three times, seeking to compromise his filial attitude toward God. Jesus rebuffs these attacks, which recapitulate the temptations of Adam in Paradise and of Israel in the desert, and the devil leaves him &#34;until an opportune time&#34;.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "269olBD5NoN9h8H7DD3XO2",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "1st Sunday of Lent (Year C) - Luke 4: 1-13",
    "release_date": "2022-03-05",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:269olBD5NoN9h8H7DD3XO2"
}