{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3ZucFI3pvzdpuzmWp7txtA/clip_923800_992200.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 4: 41-51 - 'Anyone who eats this bread will live forever.'  Catechism of the Catholic Church Paragraphs: - 259 (in 'The Divine Works and the Trinitarian Missions') - Being a work at once common and personal, the whole divine economy makes known both what is proper to the divine persons, and their one divine nature. Hence the whole Christian life is a communion with each of the divine persons, without in any way separating them. Everyone who glorifies the Father does so through the Son in the Holy Spirit; everyone who follows Christ does so because the Father draws him and the Spirit moves him. - 1001 (in 'How do the dead rise?') - When? Definitively \"at the last day,\" \"at the end of the world.\" Indeed, the resurrection of the dead is closely associated with Christ's Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel's call, and with the sound of the trumpet of God. and the dead in Christ will rise first. - 151 (in 'To Believe in Jesus Christ, the Son of God') - For a Christian, believing in God cannot be separated from believing in the One he sent, his \"beloved Son\", in whom the Father is \"well pleased\"; God tells us to listen to him. The Lord himself said to his disciples: \"Believe in God, believe also in me.\" We can believe in Jesus Christ because he is himself God, the Word made flesh: \"No one has ever seen God; the only Son, who is in the bosom of the Father, he has made him known.\" Because he \"has seen the Father\", Jesus Christ is the only one who knows him and can reveal him. - 728 (in 'Christ Jesus') - Jesus does not reveal the Holy Spirit fully, until he himself has been glorified through his Death and Resurrection. Nevertheless, little by little he alludes to him even in his teaching of the multitudes, as when he reveals that his own flesh will be food for the life of the world (abbreviated). - 1355 (in 'The Movement of the Eucharistic Celebration') - In the communion, preceded by the Lord's prayer and the breaking of the bread, the faithful receive \"the bread of heaven\" and \"the cup of salvation,\" the body and blood of Christ who offered himself \"for the life of the world.\" Because this bread and wine have been made Eucharist (\"eucharisted,\" according to an ancient expression), \"we call this food Eucharist, and no one may take part in it unless he believes that what we teach is true, has received baptism for the forgiveness of sins and new birth, and lives in keeping with what Christ taught.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1312252,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2fVtCs5rvdDFOIs2irxLNm"
    },
    "href": "https://api.spotify.com/v1/episodes/2fVtCs5rvdDFOIs2irxLNm",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 4: 41-51 - &#39;Anyone who eats this bread will live forever.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 259 (in &#39;The Divine Works and the Trinitarian Missions&#39;) - Being a work at once common and personal, the whole divine economy makes known both what is proper to the divine persons, and their one divine nature. Hence the whole Christian life is a communion with each of the divine persons, without in any way separating them. Everyone who glorifies the Father does so through the Son in the Holy Spirit; everyone who follows Christ does so because the Father draws him and the Spirit moves him.</p><br/><p>- 1001 (in &#39;How do the dead rise?&#39;) - When? Definitively &#34;at the last day,&#34; &#34;at the end of the world.&#34; Indeed, the resurrection of the dead is closely associated with Christ&#39;s Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel&#39;s call, and with the sound of the trumpet of God. and the dead in Christ will rise first.</p><br/><p>- 151 (in &#39;To Believe in Jesus Christ, the Son of God&#39;) - For a Christian, believing in God cannot be separated from believing in the One he sent, his &#34;beloved Son&#34;, in whom the Father is &#34;well pleased&#34;; God tells us to listen to him. The Lord himself said to his disciples: &#34;Believe in God, believe also in me.&#34; We can believe in Jesus Christ because he is himself God, the Word made flesh: &#34;No one has ever seen God; the only Son, who is in the bosom of the Father, he has made him known.&#34; Because he &#34;has seen the Father&#34;, Jesus Christ is the only one who knows him and can reveal him.</p><br/><p>- 728 (in &#39;Christ Jesus&#39;) - Jesus does not reveal the Holy Spirit fully, until he himself has been glorified through his Death and Resurrection. Nevertheless, little by little he alludes to him even in his teaching of the multitudes, as when he reveals that his own flesh will be food for the life of the world (abbreviated).</p><br/><p>- 1355 (in &#39;The Movement of the Eucharistic Celebration&#39;) - In the communion, preceded by the Lord&#39;s prayer and the breaking of the bread, the faithful receive &#34;the bread of heaven&#34; and &#34;the cup of salvation,&#34; the body and blood of Christ who offered himself &#34;for the life of the world.&#34; Because this bread and wine have been made Eucharist (&#34;eucharisted,&#34; according to an ancient expression), &#34;we call this food Eucharist, and no one may take part in it unless he believes that what we teach is true, has received baptism for the forgiveness of sins and new birth, and lives in keeping with what Christ taught.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2fVtCs5rvdDFOIs2irxLNm",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "19th Sunday in Ordinary Time (Year B) - John 6: 41-51",
    "release_date": "2021-08-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2fVtCs5rvdDFOIs2irxLNm"
}