{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/47skDIaYscPjowlAQAq7Eo/clip_92300_143100.mp3",
    "description": "Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy  Note: At the Palm Sunday Mass, there are 2 different gospel readings - one 'Palm Sunday' gospel which is read as part of the entrance procession, and one 'Passion' gospel which is read at the normal gospel time. This episode will focus on the Palm Sunday gospel.  Matthew 21: 1-11 - 'Blessings on he who comes in the name of the Lord!'  Catechism of the Catholic Church Paragraphs: - 559 (in 'Jesus' Messianic Entrance into Jerusalem') - How will Jerusalem welcome her Messiah? Although Jesus had always refused popular attempts to make him king, he chooses the time and prepares the details for his messianic entry into the city of \"his father David\". Acclaimed as son of David, as the one who brings salvation (Hosanna means \"Save!\" or \"Give salvation!\"), the \"King of glory\" enters his City \"riding on an ass\". Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth. and so the subjects of his kingdom on that day are children and God's poor, who acclaim him as had the angels when they announced him to the shepherds. Their acclamation, \"Blessed be he who comes in the name of the Lord\", is taken up by the Church in the Sanctus of the Eucharistic liturgy that introduces the memorial of the Lord's Passover. - 439 (in 'Christ') - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic \"Son of David\", promised by God to Israel. Jesus accepted his rightful title of Messiah, though with some reserve because it was understood by some of his contemporaries in too human a sense, as essentially political.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1640652,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2JvyP0FNT6g3zeEDyvZnBN"
    },
    "href": "https://api.spotify.com/v1/episodes/2JvyP0FNT6g3zeEDyvZnBN",
    "html_description": "<p>Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Note: At the Palm Sunday Mass, there are 2 different gospel readings - one &#39;Palm Sunday&#39; gospel which is read as part of the entrance procession, and one &#39;Passion&#39; gospel which is read at the normal gospel time. This episode will focus on the Palm Sunday gospel.</p><br/><p><br /></p><br/><p>Matthew 21: 1-11 - &#39;Blessings on he who comes in the name of the Lord!&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 559 (in &#39;Jesus&#39; Messianic Entrance into Jerusalem&#39;) - How will Jerusalem welcome her Messiah? Although Jesus had always refused popular attempts to make him king, he chooses the time and prepares the details for his messianic entry into the city of &#34;his father David&#34;. Acclaimed as son of David, as the one who brings salvation (Hosanna means &#34;Save!&#34; or &#34;Give salvation!&#34;), the &#34;King of glory&#34; enters his City &#34;riding on an ass&#34;. Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth. and so the subjects of his kingdom on that day are children and God&#39;s poor, who acclaim him as had the angels when they announced him to the shepherds. Their acclamation, &#34;Blessed be he who comes in the name of the Lord&#34;, is taken up by the Church in the Sanctus of the Eucharistic liturgy that introduces the memorial of the Lord&#39;s Passover.</p><br/><p>- 439 (in &#39;Christ&#39;) - Many Jews and even certain Gentiles who shared their hope recognized in Jesus the fundamental attributes of the messianic &#34;Son of David&#34;, promised by God to Israel. Jesus accepted his rightful title of Messiah, though with some reserve because it was understood by some of his contemporaries in too human a sense, as essentially political.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2JvyP0FNT6g3zeEDyvZnBN",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Palm Sunday (Year A) - Matt 21: 1-11",
    "release_date": "2023-04-01",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2JvyP0FNT6g3zeEDyvZnBN"
}