{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4ypFERrH5bloJir2MUqFbg/clip_992400_1040000.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 8: 21-30 - 'When you have lifted up the Son of Man then you will know what I am He.'  Catechism of the Catholic Church Paragraphs: - 211 (in 'a God merciful and gracious') - By giving his life to free us from sin, Jesus reveals that he himself bears the divine name: \"When you have lifted up the Son of man, then you will realize that \"I AM\".\" (abbreviated) - 653 (in 'The Meaning and Saving Significance of the Resurrection') - The truth of Jesus' divinity is confirmed by his Resurrection. He had said: \"When you have lifted up the Son of man, then you will know that I am he.\" The Resurrection of the crucified one shows that he was truly \"I AM\", the Son of God and God himself (abbreviated). - 1693 (in 'Life in Christ') - Christ Jesus always did what was pleasing to the Father, and always lived in perfect communion with him. Likewise Christ's disciples are invited to live in the sight of the Father \"who sees in secret,\" in order to become \"perfect as your heavenly Father is perfect.\" - 2824 (in 'Thy Will be done on earth as it is in heaven') - In Christ, and through his human will, the will of the Father has been perfectly fulfilled once for all. Jesus said on entering into this world: \"Lo, I have come to do your will, O God.\" Only Jesus can say: \"I always do what is pleasing to him.\" In the prayer of his agony, he consents totally to this will: \"not my will, but yours be done\" (abbreviated). - 2825 (in 'Thy Will be done on earth as it is in heaven') - Although he was a Son, [Jesus] learned obedience through what he suffered.\" How much more reason have we sinful creatures to learn obedience - we who in him have become children of adoption. We ask our Father to unite our will to his Son's, in order to fulfill his will, his plan of salvation for the life of the world. We are radically incapable of this, but united with Jesus and with the power of his Holy Spirit, we can surrender our will to him and decide to choose what his Son has always chosen: to do what is pleasing to the Father.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1313018,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2nCT9t2BO3E8Y9Gmm2xYFU"
    },
    "href": "https://api.spotify.com/v1/episodes/2nCT9t2BO3E8Y9Gmm2xYFU",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 8: 21-30 - &#39;When you have lifted up the Son of Man then you will know what I am He.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 211 (in &#39;a God merciful and gracious&#39;) - By giving his life to free us from sin, Jesus reveals that he himself bears the divine name: &#34;When you have lifted up the Son of man, then you will realize that &#34;I AM&#34;.&#34; (abbreviated)</p><br/><p>- 653 (in &#39;The Meaning and Saving Significance of the Resurrection&#39;) - The truth of Jesus&#39; divinity is confirmed by his Resurrection. He had said: &#34;When you have lifted up the Son of man, then you will know that I am he.&#34; The Resurrection of the crucified one shows that he was truly &#34;I AM&#34;, the Son of God and God himself (abbreviated).</p><br/><p>- 1693 (in &#39;Life in Christ&#39;) - Christ Jesus always did what was pleasing to the Father, and always lived in perfect communion with him. Likewise Christ&#39;s disciples are invited to live in the sight of the Father &#34;who sees in secret,&#34; in order to become &#34;perfect as your heavenly Father is perfect.&#34;</p><br/><p>- 2824 (in &#39;Thy Will be done on earth as it is in heaven&#39;) - In Christ, and through his human will, the will of the Father has been perfectly fulfilled once for all. Jesus said on entering into this world: &#34;Lo, I have come to do your will, O God.&#34; Only Jesus can say: &#34;I always do what is pleasing to him.&#34; In the prayer of his agony, he consents totally to this will: &#34;not my will, but yours be done&#34; (abbreviated).</p><br/><p>- 2825 (in &#39;Thy Will be done on earth as it is in heaven&#39;) - Although he was a Son, [Jesus] learned obedience through what he suffered.&#34; How much more reason have we sinful creatures to learn obedience - we who in him have become children of adoption. We ask our Father to unite our will to his Son&#39;s, in order to fulfill his will, his plan of salvation for the life of the world. We are radically incapable of this, but united with Jesus and with the power of his Holy Spirit, we can surrender our will to him and decide to choose what his Son has always chosen: to do what is pleasing to the Father.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2nCT9t2BO3E8Y9Gmm2xYFU",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 5 of Lent - John 8: 21-30",
    "release_date": "2023-03-27",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2nCT9t2BO3E8Y9Gmm2xYFU"
}