{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1cAMk8KC19zDBENPzhOVte/clip_182893_242893.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 2: 1-11 - 'My hour has not come yet; do whatever he tells you.'  Catechism of the Catholic Church Paragraphs: - 2618 (in 'The Prayer of the Virgin Mary') - The Gospel reveals to us how Mary prays and intercedes in faith. At Cana, The mother of Jesus asks her son for the needs of a wedding feast; this is the sign of another feast - that of the wedding of the Lamb where he gives his body and blood at the request of the Church, his Bride (abbreviated). - 1613 (in 'Marriage in the Lord') - On the threshold of his public life Jesus performs his first sign - at his mother's request - during a wedding feast. The Church attaches great importance to Jesus' presence at the wedding at Cana. She sees in it the confirmation of the goodness of marriage and the proclamation that thenceforth marriage will be an efficacious sign of Christ's presence. - 495 (in 'Mary's Divine Motherhood') - Called in the Gospels \"the mother of Jesus\", Mary is acclaimed by Elizabeth, at the prompting of the Spirit and even before the birth of her son, as \"the mother of my Lord\". In fact, the One whom she conceived as man by the Holy Spirit, who truly became her Son according to the flesh, was none other than the Father's eternal Son, the second person of the Holy Trinity. Hence the Church confesses that Mary is truly \"Mother of God\" (Theotokos). - 1335 (in 'The Signs of Bread and Wine') - The miracles of the multiplication of the loaves, when the Lord says the blessing, breaks and distributes the loaves through his disciples to feed the multitude, prefigure the superabundance of this unique bread of his Eucharist. The sign of water turned into wine at Cana already announces the Hour of Jesus' glorification. It makes manifest the fulfillment of the wedding feast in the Father's kingdom, where the faithful will drink the new wine that has become the Blood of Christ.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2269564,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2nHjJMMG8Jnoi94Ja4VFzT"
    },
    "href": "https://api.spotify.com/v1/episodes/2nHjJMMG8Jnoi94Ja4VFzT",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 2: 1-11 - &#39;My hour has not come yet; do whatever he tells you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2618 (in &#39;The Prayer of the Virgin Mary&#39;) - The Gospel reveals to us how Mary prays and intercedes in faith. At Cana, The mother of Jesus asks her son for the needs of a wedding feast; this is the sign of another feast - that of the wedding of the Lamb where he gives his body and blood at the request of the Church, his Bride (abbreviated).</p><br/><p>- 1613 (in &#39;Marriage in the Lord&#39;) - On the threshold of his public life Jesus performs his first sign - at his mother&#39;s request - during a wedding feast. The Church attaches great importance to Jesus&#39; presence at the wedding at Cana. She sees in it the confirmation of the goodness of marriage and the proclamation that thenceforth marriage will be an efficacious sign of Christ&#39;s presence.</p><br/><p>- 495 (in &#39;Mary&#39;s Divine Motherhood&#39;) - Called in the Gospels &#34;the mother of Jesus&#34;, Mary is acclaimed by Elizabeth, at the prompting of the Spirit and even before the birth of her son, as &#34;the mother of my Lord&#34;. In fact, the One whom she conceived as man by the Holy Spirit, who truly became her Son according to the flesh, was none other than the Father&#39;s eternal Son, the second person of the Holy Trinity. Hence the Church confesses that Mary is truly &#34;Mother of God&#34; (Theotokos).</p><br/><p>- 1335 (in &#39;The Signs of Bread and Wine&#39;) - The miracles of the multiplication of the loaves, when the Lord says the blessing, breaks and distributes the loaves through his disciples to feed the multitude, prefigure the superabundance of this unique bread of his Eucharist. The sign of water turned into wine at Cana already announces the Hour of Jesus&#39; glorification. It makes manifest the fulfillment of the wedding feast in the Father&#39;s kingdom, where the faithful will drink the new wine that has become the Blood of Christ.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2nHjJMMG8Jnoi94Ja4VFzT",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "2nd Sunday in Ordinary Time (Year C) - John 2: 1-11",
    "release_date": "2022-01-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2nHjJMMG8Jnoi94Ja4VFzT"
}