{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0PW1qQVAWPgykCjYoyw9gu/clip_500100_558000.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 6: 22-29 - 'Do not work for food that cannot last, but for food that endures to eternal life.'  Catechism of the Catholic Church Paragraphs: - 2835 (in 'Give us this day our daily bread') - This petition, with the responsibility it involves, also applies to another hunger from which men are perishing: \"Man does not live by bread alone, but . . . by every word that proceeds from the mouth of God,\" that is, by the Word he speaks and the Spirit he breathes forth. Christians must make every effort \"to proclaim the good news to the poor.\" There is a famine on earth, \"not a famine of bread, nor a thirst for water, but of hearing the words of the LORD.\" For this reason the specifically Christian sense of this fourth petition concerns the Bread of Life: the Word of God accepted in faith, the Body of Christ received in the Eucharist. - 698 (in 'Symbols of the Holy Spirit') - The seal is a symbol close to that of anointing. \"The Father has set his seal\" on Christ and also seals us in him. Because this seal indicates the indelible effect of the anointing with the Holy Spirit in the sacraments of Baptism, Confirmation, and Holy Orders, the image of the seal (sphragis) has been used in some theological traditions to express the indelible \"character\" imprinted by these three unrepeatable sacraments. - 1296 (in 'The Rite of Confirmation') - Christ himself declared that he was marked with his Father's seal. Christians are also marked with a seal: \"It is God who establishes us with you in Christ and has commissioned us; he has put his seal on us and given us his Spirit in our hearts as a guarantee.\" This seal of the Holy Spirit marks our total belonging to Christ, our enrollment in his service for ever, as well as the promise of divine protection in the great eschatological trial.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1154867,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2Qvg5N3tObGQOWlpH30fkF"
    },
    "href": "https://api.spotify.com/v1/episodes/2Qvg5N3tObGQOWlpH30fkF",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 6: 22-29 - &#39;Do not work for food that cannot last, but for food that endures to eternal life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2835 (in &#39;Give us this day our daily bread&#39;) - This petition, with the responsibility it involves, also applies to another hunger from which men are perishing: &#34;Man does not live by bread alone, but . . . by every word that proceeds from the mouth of God,&#34; that is, by the Word he speaks and the Spirit he breathes forth. Christians must make every effort &#34;to proclaim the good news to the poor.&#34; There is a famine on earth, &#34;not a famine of bread, nor a thirst for water, but of hearing the words of the LORD.&#34; For this reason the specifically Christian sense of this fourth petition concerns the Bread of Life: the Word of God accepted in faith, the Body of Christ received in the Eucharist.</p><br/><p>- 698 (in &#39;Symbols of the Holy Spirit&#39;) - The seal is a symbol close to that of anointing. &#34;The Father has set his seal&#34; on Christ and also seals us in him. Because this seal indicates the indelible effect of the anointing with the Holy Spirit in the sacraments of Baptism, Confirmation, and Holy Orders, the image of the seal (sphragis) has been used in some theological traditions to express the indelible &#34;character&#34; imprinted by these three unrepeatable sacraments.</p><br/><p>- 1296 (in &#39;The Rite of Confirmation&#39;) - Christ himself declared that he was marked with his Father&#39;s seal. Christians are also marked with a seal: &#34;It is God who establishes us with you in Christ and has commissioned us; he has put his seal on us and given us his Spirit in our hearts as a guarantee.&#34; This seal of the Holy Spirit marks our total belonging to Christ, our enrollment in his service for ever, as well as the promise of divine protection in the great eschatological trial.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2Qvg5N3tObGQOWlpH30fkF",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 3 of Eastertide - John 6: 22-29",
    "release_date": "2023-04-23",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2Qvg5N3tObGQOWlpH30fkF"
}