{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1zasBme3sjVEXN4UlLXVyo/clip_544400_593500.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 19: 25-27 - 'Woman, this is your Son.'  Catechism of the Catholic Church Paragraphs: - 726 (in 'Rejoice you who are full of grace') - At the end of this mission of the Spirit, Mary became the Woman, the new Eve (\"mother of the living\"), the mother of the \"whole Christ\" (abbreviated). - 2618 (in 'The Prayer of the Virgin Mary') - It is at the hour of the New Covenant, at the foot of the cross, that Mary is heard as the Woman, the new Eve, the true \"Mother of all the living\" (abbreviated). - 501 (in 'Mary ever-virgin') - Jesus is Mary's only son, but her spiritual motherhood extends to all men whom indeed he came to save: \"The Son whom she brought forth is he whom God placed as the first-born among many brethren, that is, the faithful in whose generation and formation she co-operates with a mother's love.\" - 964 (in 'Wholly united with her Son') - Mary's role in the Church is inseparable from her union with Christ and flows directly from it. \"This union of the mother with the Son in the work of salvation is made manifest from the time of Christ's virginal conception up to his death\"; it is made      manifest above all at the hour of his Passion: Thus the Blessed Virgin advanced in her pilgrimage of faith, and faithfully persevered in her union with her Son unto the cross. There she stood, in keeping with the divine plan, enduring with her only begotten Son the intensity of his suffering, joining herself with his sacrifice in her mother's heart, and lovingly consenting to the immolation of this victim, born of her: to be given, by the same Christ Jesus dying on the cross, as a mother to his disciple, with these words: \"Woman, behold your son.\" - 2677-2679 (in 'In Communion with the Holy Mother of God') - Pray for us sinners, now and at the hour of our death: By asking Mary to pray for us, we acknowledge ourselves to be poor sinners and we address ourselves to the \"Mother of Mercy,\" the All-Holy One. We give ourselves over to her now, in the Today of our lives. and our trust broadens further, already at the present moment, to surrender \"the hour of our death\" wholly to her care. May she be there as she was at her son's death on the cross. May she welcome us as our mother at the hour of our passing to lead us to her son, Jesus, in paradise...Mary is the perfect Orans (prayer), a figure of the Church. When we pray to her, we are adhering with her to the plan of the Father, who sends his Son to save all men. Like the beloved disciple we welcome Jesus' mother into our homes, for she has become the mother of all the living. We can pray with and to her. the prayer of the Church is sustained by the prayer of Mary and united with it in hope. (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1388808,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2RuNlRky2oFH1Bo2xpWoID"
    },
    "href": "https://api.spotify.com/v1/episodes/2RuNlRky2oFH1Bo2xpWoID",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 19: 25-27 - &#39;Woman, this is your Son.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 726 (in &#39;Rejoice you who are full of grace&#39;) - At the end of this mission of the Spirit, Mary became the Woman, the new Eve (&#34;mother of the living&#34;), the mother of the &#34;whole Christ&#34; (abbreviated).</p><br/><p>- 2618 (in &#39;The Prayer of the Virgin Mary&#39;) - It is at the hour of the New Covenant, at the foot of the cross, that Mary is heard as the Woman, the new Eve, the true &#34;Mother of all the living&#34; (abbreviated).</p><br/><p>- 501 (in &#39;Mary ever-virgin&#39;) - Jesus is Mary&#39;s only son, but her spiritual motherhood extends to all men whom indeed he came to save: &#34;The Son whom she brought forth is he whom God placed as the first-born among many brethren, that is, the faithful in whose generation and formation she co-operates with a mother&#39;s love.&#34;</p><br/><p>- 964 (in &#39;Wholly united with her Son&#39;) - Mary&#39;s role in the Church is inseparable from her union with Christ and flows directly from it. &#34;This union of the mother with the Son in the work of salvation is made manifest from the time of Christ&#39;s virginal conception up to his death&#34;; it is made      manifest above all at the hour of his Passion: Thus the Blessed Virgin advanced in her pilgrimage of faith, and faithfully persevered in her union with her Son unto the cross. There she stood, in keeping with the divine plan, enduring with her only begotten Son the intensity of his suffering, joining herself with his sacrifice in her mother&#39;s heart, and lovingly consenting to the immolation of this victim, born of her: to be given, by the same Christ Jesus dying on the cross, as a mother to his disciple, with these words: &#34;Woman, behold your son.&#34;</p><br/><p>- 2677-2679 (in &#39;In Communion with the Holy Mother of God&#39;) - Pray for us sinners, now and at the hour of our death: By asking Mary to pray for us, we acknowledge ourselves to be poor sinners and we address ourselves to the &#34;Mother of Mercy,&#34; the All-Holy One. We give ourselves over to her now, in the Today of our lives. and our trust broadens further, already at the present moment, to surrender &#34;the hour of our death&#34; wholly to her care. May she be there as she was at her son&#39;s death on the cross. May she welcome us as our mother at the hour of our passing to lead us to her son, Jesus, in paradise...Mary is the perfect Orans (prayer), a figure of the Church. When we pray to her, we are adhering with her to the plan of the Father, who sends his Son to save all men. Like the beloved disciple we welcome Jesus&#39; mother into our homes, for she has become the mother of all the living. We can pray with and to her. the prayer of the Church is sustained by the prayer of Mary and united with it in hope. (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2RuNlRky2oFH1Bo2xpWoID",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Memorial of Our Lady of Sorrows - John 19: 25-27",
    "release_date": "2023-09-14",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2RuNlRky2oFH1Bo2xpWoID"
}