{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/2eX4E7mVzHoVLiTnOd3saQ/clip_992600_1037800.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 5: 17-19 - 'I have not come to abolish the Law and the Prophets but to complete them.'  Catechism of the Catholic Church Paragraphs: - 577 (in 'Jesus and the Law') - At the beginning of the Sermon on the Mount Jesus issued a solemn warning in which he presented God's law, given on Sinai during thefirst covenant, in light of the grace of the New Covenant: Do not think that I have come to abolish the law or the prophets: I have come not to abolish but to fulfil. For truly I tell you, until heaven and earth pass away, not one letter, not one stroke of a letter, will pass from the law, until all is accomplished. Therefore, whoever breaks one of the least of these commandments, and teaches others to do the same, will be called least in the kingdom of heaven; but whoever does them and teaches them will be called great in the kingdom of heaven. - 592 (in 'Jesus and Israel's Faith in the One God and Saviour') - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf Mt 5:17-19) with such perfection (cf Jn 8:46) that he revealed its ultimate meaning (cf Mt 5:33) and redeemed the transgressions against it (cf Heb 9:15). - 1967 (in 'The New Law of the Law of the Gospel') - The Law of the Gospel \"fulfills,\" refines, surpasses, and leads the Old Law to its perfection. In the      Beatitudes, the New Law fulfills the divine promises by elevating and orienting them toward the \"kingdom of heaven.\" It is addressed to those open to accepting this new hope with faith - the poor, the humble, the afflicted, the pure of heart, those persecuted on account of Christ and so marks out the surprising ways of the Kingdom. - 2053 (in 'The Ten Commandments') - To this first reply Jesus adds a second: \"If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.\" This reply does not do away with the first: following Jesus Christ involves keeping the Commandments. the Law has not been abolished, but rather man is invited to rediscover it in the person of his Master who is its perfect fulfillment. In the three synoptic Gospels, Jesus' call to the rich young man to follow him, in the obedience of a disciple and in the observance of the Commandments, is joined to the call to poverty and chastity. The evangelical counsels are inseparable from the Commandments.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1258684,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2sSiZMGfUJ4kIKfZmPkVIo"
    },
    "href": "https://api.spotify.com/v1/episodes/2sSiZMGfUJ4kIKfZmPkVIo",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 5: 17-19 - &#39;I have not come to abolish the Law and the Prophets but to complete them.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 577 (in &#39;Jesus and the Law&#39;) - At the beginning of the Sermon on the Mount Jesus issued a solemn warning in which he presented God&#39;s law, given on Sinai during thefirst covenant, in light of the grace of the New Covenant: Do not think that I have come to abolish the law or the prophets: I have come not to abolish but to fulfil. For truly I tell you, until heaven and earth pass away, not one letter, not one stroke of a letter, will pass from the law, until all is accomplished. Therefore, whoever breaks one of the least of these commandments, and teaches others to do the same, will be called least in the kingdom of heaven; but whoever does them and teaches them will be called great in the kingdom of heaven.</p><br/><p>- 592 (in &#39;Jesus and Israel&#39;s Faith in the One God and Saviour&#39;) - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf Mt 5:17-19) with such perfection (cf Jn 8:46) that he revealed its ultimate meaning (cf Mt 5:33) and redeemed the transgressions against it (cf Heb 9:15).</p><br/><p>- 1967 (in &#39;The New Law of the Law of the Gospel&#39;) - The Law of the Gospel &#34;fulfills,&#34; refines, surpasses, and leads the Old Law to its perfection. In the      Beatitudes, the New Law fulfills the divine promises by elevating and orienting them toward the &#34;kingdom of heaven.&#34; It is addressed to those open to accepting this new hope with faith - the poor, the humble, the afflicted, the pure of heart, those persecuted on account of Christ and so marks out the surprising ways of the Kingdom.</p><br/><p>- 2053 (in &#39;The Ten Commandments&#39;) - To this first reply Jesus adds a second: &#34;If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.&#34; This reply does not do away with the first: following Jesus Christ involves keeping the Commandments. the Law has not been abolished, but rather man is invited to rediscover it in the person of his Master who is its perfect fulfillment. In the three synoptic Gospels, Jesus&#39; call to the rich young man to follow him, in the obedience of a disciple and in the observance of the Commandments, is joined to the call to poverty and chastity. The evangelical counsels are inseparable from the Commandments.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2sSiZMGfUJ4kIKfZmPkVIo",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 10 in Ordinary Time - Matt 5: 17-19",
    "release_date": "2023-06-13",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2sSiZMGfUJ4kIKfZmPkVIo"
}