{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3f9OogJLe5O02RZqaTnZm1/clip_397763_457763.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 5: 33-37 - 'Do not swear: say 'Yes' if you mean Yes, 'No' if you mean No.'  Catechism of the Catholic Church Paragraphs: - 581 (in 'Jesus and the Law') - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people \"as one who had authority, and not as their scribes\". In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes. Jesus did not abolish the Law but fulfilled it by giving its ultimate interpretation in a divine way: \"You have heard that it was said to the men of old. . . But I say to you. . .\" (abbreviated). - 2153 (in 'Taking the Name of the Lord in Vain') - In the Sermon on the Mount, Jesus explained the second commandment: \"You have heard that it was said to the men of old, 'You shall not swear falsely, but shall perform to the Lord what you have sworn.' But I say to you, Do not swear at all.... Let what you say be simply 'Yes' or 'No'; anything more than this comes from the evil one.\" Jesus teaches that every oath involves a reference to God and that God's presence and his truth must be honored in all speech. Discretion in calling upon God is allied with a respectful awareness of his presence, which all our assertions either witness to or mock. - 592 (in 'Jesus and Israel's faith in the one God and Saviour') - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf Mt 5:17-19) with such perfection (cf Jn 8:46) that he revealed its ultimate meaning (cf Mt 5:33) and redeemed the transgressions against it (cf Heb 9:15). - 2466 (in 'Living in the Truth') - In Jesus Christ, the whole of God's truth has been made manifest. \"Full of grace and truth,\" he came as the \"light of the world,\" he is the Truth. \"Whoever believes in me may not remain in darkness.\" The disciple of Jesus continues in his word so as to know \"the truth [that] will make you free\" and that sanctifies. To follow Jesus is to live in \"the Spirit of truth,\" whom the Father sends in his name and who leads \"into all the truth.\" To his disciples Jesus teaches the unconditional love of truth: \"Let what you say be simply 'Yes or No.'\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1140494,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2tIcr1RoFMCqr8blnPuXj3"
    },
    "href": "https://api.spotify.com/v1/episodes/2tIcr1RoFMCqr8blnPuXj3",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 5: 33-37 - &#39;Do not swear: say &#39;Yes&#39; if you mean Yes, &#39;No&#39; if you mean No.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 581 (in &#39;Jesus and the Law&#39;) - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people &#34;as one who had authority, and not as their scribes&#34;. In Jesus, the same Word of God that had resounded on Mount Sinai to give the written Law to Moses, made itself heard anew on the Mount of the Beatitudes. Jesus did not abolish the Law but fulfilled it by giving its ultimate interpretation in a divine way: &#34;You have heard that it was said to the men of old. . . But I say to you. . .&#34; (abbreviated).</p><br/><p>- 2153 (in &#39;Taking the Name of the Lord in Vain&#39;) - In the Sermon on the Mount, Jesus explained the second commandment: &#34;You have heard that it was said to the men of old, &#39;You shall not swear falsely, but shall perform to the Lord what you have sworn.&#39; But I say to you, Do not swear at all.... Let what you say be simply &#39;Yes&#39; or &#39;No&#39;; anything more than this comes from the evil one.&#34; Jesus teaches that every oath involves a reference to God and that God&#39;s presence and his truth must be honored in all speech. Discretion in calling upon God is allied with a respectful awareness of his presence, which all our assertions either witness to or mock.</p><br/><p>- 592 (in &#39;Jesus and Israel&#39;s faith in the one God and Saviour&#39;) - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf Mt 5:17-19) with such perfection (cf Jn 8:46) that he revealed its ultimate meaning (cf Mt 5:33) and redeemed the transgressions against it (cf Heb 9:15).</p><br/><p>- 2466 (in &#39;Living in the Truth&#39;) - In Jesus Christ, the whole of God&#39;s truth has been made manifest. &#34;Full of grace and truth,&#34; he came as the &#34;light of the world,&#34; he is the Truth. &#34;Whoever believes in me may not remain in darkness.&#34; The disciple of Jesus continues in his word so as to know &#34;the truth [that] will make you free&#34; and that sanctifies. To follow Jesus is to live in &#34;the Spirit of truth,&#34; whom the Father sends in his name and who leads &#34;into all the truth.&#34; To his disciples Jesus teaches the unconditional love of truth: &#34;Let what you say be simply &#39;Yes or No.&#39;&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2tIcr1RoFMCqr8blnPuXj3",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 10 in Ordinary Time - Matt 5: 33-37",
    "release_date": "2023-06-16",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2tIcr1RoFMCqr8blnPuXj3"
}