{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5ATjtuFLbAgIcgsiuoX4AQ/clip_1061700_1123300.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 14: 1-12 - 'I am the Way, the Truth and the Life.'  Catechism of the Catholic Church Paragraphs: - 151 (in 'To Believe in Jesus Christ, the Son of God') - For a Christian, believing in God cannot be separated from believing in the One he sent, his \"beloved Son\", in whom the Father is \"well pleased\"; God tells us to listen to him. The Lord himself said to his disciples: \"Believe in God, believe also in me.\" (abbreviated). - 2795 (in 'Who Art in Heaven') - He is in heaven, his dwelling place; the Father's house is our homeland. Sin has exiled us from the land of the covenant, but conversion of heart enables us to return to the Father, to heaven. In Christ, then, heaven and earth are reconciled, for the Son alone \"descended from heaven\" and causes us to ascend there with him, by his Cross, Resurrection, and Ascension (abbreviated). - 661 (in 'He Ascended into Heaven and is seated at the right hand of the Father') - This final stage stays closely linked to the first, that is, to his descent from heaven in the Incarnation. Only the one who \"came from the Father\" can return to the Father: Christ Jesus. \"No one has ascended into heaven but he who descended from heaven, the Son of man.\" Left to its own natural powers humanity does not have access to the \"Father's house\", to God's life and happiness Only Christ can open to man such access that we, his members, might have confidence that we too shall go where he, our Head and our Source, has preceded us. - 1025 (in 'Heaven') - To live in heaven is \"to be with Christ.\" the elect live \"in Christ,\" but they retain, or rather find, their true identity, their own name. For life is to be with Christ; where Christ is, there is life, there is the kingdom. - 74 (in 'The Transmission of Divine Revelation') - God \"desires all men to be saved and to come to the knowledge of the truth: that is, of Christ Jesus Christ must be proclaimed to all nations and individuals, so that this revelation may reach to the ends of the earth. - 459 (in 'Why did the Word become Flesh?') - The Word became flesh to be our model of holiness: \"Take my yoke upon you, and learn from me.\" \"I am the way, and the truth, and the life; no one comes to the Father, but by me\" (abbreviated). - 1698 (in 'Life in Christ') - The first and last point of reference of this catechesis will always be Jesus Christ himself, who is \"the way, and the truth, and the life\" (abbreviated). - 2466 (in 'Living in the Truth') - In Jesus Christ, the whole of God's truth has been made manifest. \"Full of grace and truth,\" he came as the \"light of the world,\" he is the Truth. \"Whoever believes in me may not remain in darkness.\" The disciple of Jesus continues in his word so as to know \"the truth [that] will make you free\" and that sanctifies (abbreviated). - 2614 (in 'Jesus teaches us how to pray') - When Jesus openly entrusts to his disciples the mystery of prayer to the Father, he reveals to them what their prayer and ours must be, once he has returned to the Father in his glorified humanity. What is new is to \"ask in his name.\" Faith in the Son introduces the disciples into the knowledge of the Father, because Jesus is \"the way, and the truth, and the life.\" - 470 (in 'How is the Son of God Man?') - The Son of God therefore communicates to his humanity his own personal mode of existence in the Trinity. In his soul as in his body, Christ thus expresses humanly the divine ways of the Trinity (abbreviated). Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1608724,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2TOGkKaj4iFjZUkd61jrX8"
    },
    "href": "https://api.spotify.com/v1/episodes/2TOGkKaj4iFjZUkd61jrX8",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 14: 1-12 - &#39;I am the Way, the Truth and the Life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 151 (in &#39;To Believe in Jesus Christ, the Son of God&#39;) - For a Christian, believing in God cannot be separated from believing in the One he sent, his &#34;beloved Son&#34;, in whom the Father is &#34;well pleased&#34;; God tells us to listen to him. The Lord himself said to his disciples: &#34;Believe in God, believe also in me.&#34; (abbreviated).</p><br/><p>- 2795 (in &#39;Who Art in Heaven&#39;) - He is in heaven, his dwelling place; the Father&#39;s house is our homeland. Sin has exiled us from the land of the covenant, but conversion of heart enables us to return to the Father, to heaven. In Christ, then, heaven and earth are reconciled, for the Son alone &#34;descended from heaven&#34; and causes us to ascend there with him, by his Cross, Resurrection, and Ascension (abbreviated).</p><br/><p>- 661 (in &#39;He Ascended into Heaven and is seated at the right hand of the Father&#39;) - This final stage stays closely linked to the first, that is, to his descent from heaven in the Incarnation. Only the one who &#34;came from the Father&#34; can return to the Father: Christ Jesus. &#34;No one has ascended into heaven but he who descended from heaven, the Son of man.&#34; Left to its own natural powers humanity does not have access to the &#34;Father&#39;s house&#34;, to God&#39;s life and happiness Only Christ can open to man such access that we, his members, might have confidence that we too shall go where he, our Head and our Source, has preceded us.</p><br/><p>- 1025 (in &#39;Heaven&#39;) - To live in heaven is &#34;to be with Christ.&#34; the elect live &#34;in Christ,&#34; but they retain, or rather find, their true identity, their own name. For life is to be with Christ; where Christ is, there is life, there is the kingdom.</p><br/><p>- 74 (in &#39;The Transmission of Divine Revelation&#39;) - God &#34;desires all men to be saved and to come to the knowledge of the truth: that is, of Christ Jesus Christ must be proclaimed to all nations and individuals, so that this revelation may reach to the ends of the earth.</p><br/><p>- 459 (in &#39;Why did the Word become Flesh?&#39;) - The Word became flesh to be our model of holiness: &#34;Take my yoke upon you, and learn from me.&#34; &#34;I am the way, and the truth, and the life; no one comes to the Father, but by me&#34; (abbreviated).</p><br/><p>- 1698 (in &#39;Life in Christ&#39;) - The first and last point of reference of this catechesis will always be Jesus Christ himself, who is &#34;the way, and the truth, and the life&#34; (abbreviated).</p><br/><p>- 2466 (in &#39;Living in the Truth&#39;) - In Jesus Christ, the whole of God&#39;s truth has been made manifest. &#34;Full of grace and truth,&#34; he came as the &#34;light of the world,&#34; he is the Truth. &#34;Whoever believes in me may not remain in darkness.&#34; The disciple of Jesus continues in his word so as to know &#34;the truth [that] will make you free&#34; and that sanctifies (abbreviated).</p><br/><p>- 2614 (in &#39;Jesus teaches us how to pray&#39;) - When Jesus openly entrusts to his disciples the mystery of prayer to the Father, he reveals to them what their prayer and ours must be, once he has returned to the Father in his glorified humanity. What is new is to &#34;ask in his name.&#34; Faith in the Son introduces the disciples into the knowledge of the Father, because Jesus is &#34;the way, and the truth, and the life.&#34;</p><br/><p>- 470 (in &#39;How is the Son of God Man?&#39;) - The Son of God therefore communicates to his humanity his own personal mode of existence in the Trinity. In his soul as in his body, Christ thus expresses humanly the divine ways of the Trinity (abbreviated).<br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2TOGkKaj4iFjZUkd61jrX8",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a2cd291d28eac430f911845c0",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f2cd291d28eac430f911845c0",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d2cd291d28eac430f911845c0",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "5th Sunday of Easter (Year A) - John 14: 1-12",
    "release_date": "2023-05-06",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2TOGkKaj4iFjZUkd61jrX8"
}