{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3d4mBAa4UO4JodJbqBafVR/clip_408514_468514.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 6: 17, 20-26 - 'Happy are you who are poor, who are hungry, who weep.'  Catechism of the Catholic Church Paragraphs: - 2444 (in 'Love for the Poor') - The Church's love for the poor . . . is a part of her constant tradition.\" This love is inspired by the Gospel of the Beatitudes, of the poverty of Jesus, and of his concern for the poor. Love for the poor is even one of the motives for the duty of working so as to \"be able to give to those in need.\" It extends not only to material poverty but also to the many forms of cultural and religious poverty. - 2546-2547 (in 'Poverty of Heart') - \"Blessed are the poor in spirit.\" The Beatitudes reveal an order of happiness and grace, of beauty and peace. Jesus celebrates the joy of the poor, to whom the Kingdom already belongs: The Word speaks of voluntary humility as \"poverty in spirit\"; the Apostle gives an example of God's poverty when he says: \"For your sakes he became poor.\" The Lord grieves over the rich, because they find their consolation in the abundance of goods. \"Let the proud seek and love earthly kingdoms, but blessed are the poor in spirit for theirs is the Kingdom of heaven.\" Abandonment to the providence of the Father in heaven frees us from anxiety about tomorrow. Trust in God is a preparation for the blessedness of the poor. They shall see God.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1807139,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2UodVJw7hvbrlOAkMgs5lO"
    },
    "href": "https://api.spotify.com/v1/episodes/2UodVJw7hvbrlOAkMgs5lO",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 6: 17, 20-26 - &#39;Happy are you who are poor, who are hungry, who weep.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2444 (in &#39;Love for the Poor&#39;) - The Church&#39;s love for the poor . . . is a part of her constant tradition.&#34; This love is inspired by the Gospel of the Beatitudes, of the poverty of Jesus, and of his concern for the poor. Love for the poor is even one of the motives for the duty of working so as to &#34;be able to give to those in need.&#34; It extends not only to material poverty but also to the many forms of cultural and religious poverty.</p><br/><p>- 2546-2547 (in &#39;Poverty of Heart&#39;) - &#34;Blessed are the poor in spirit.&#34; The Beatitudes reveal an order of happiness and grace, of beauty and peace. Jesus celebrates the joy of the poor, to whom the Kingdom already belongs: The Word speaks of voluntary humility as &#34;poverty in spirit&#34;; the Apostle gives an example of God&#39;s poverty when he says: &#34;For your sakes he became poor.&#34; The Lord grieves over the rich, because they find their consolation in the abundance of goods. &#34;Let the proud seek and love earthly kingdoms, but blessed are the poor in spirit for theirs is the Kingdom of heaven.&#34; Abandonment to the providence of the Father in heaven frees us from anxiety about tomorrow. Trust in God is a preparation for the blessedness of the poor. They shall see God.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2UodVJw7hvbrlOAkMgs5lO",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "6th Sunday in Ordinary Time (Year C) - Luke 6: 17, 20-26",
    "release_date": "2022-02-12",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2UodVJw7hvbrlOAkMgs5lO"
}