{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6Dkgl78XbsfXpKJu7YJxq9/clip_240100_317600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 11: 25-30 - 'You have hidden these things from the wise and revealed them to little children.'  Catechism of the Catholic Church Paragraphs: - 2603 (in 'Jesus Prays') - The evangelists have preserved two more explicit prayers offered by Christ during his public ministry. Each begins with thanksgiving. In the first, Jesus confesses the Father, acknowledges, and blesses him because he has hidden the mysteries of the Kingdom from those who think themselves learned and has revealed them to infants, the poor of the Beatitudes. His exclamation, \"Yes, Father!\" expresses the depth of his heart, his adherence to the Father's \"good pleasure,\" echoing his mother's Fiat at the time of his conception and prefiguring what he will say to the Father in his agony. the whole prayer of Jesus is contained in this loving adherence of his human heart to the mystery of the will of the Father. - 2701 (in 'Vocal Prayer') - Vocal prayer is an essential element of the Christian life. To his disciples, drawn by their Master's silent prayer, Jesus teaches a vocal prayer, the Our Father. He not only prayed aloud the liturgical prayers of the synagogue but, as the Gospels show, he raised his voice to express his personal prayer, from exultant blessing of the Father to the agony of Gesthemani. - 2785 (in 'Abba-Father') - Second, a humble and trusting heart that enables us \"to turn and become like children\": for it is to \"little children\" that the Father is revealed. [The prayer is accomplished] by the contemplation of God alone, and by the warmth of love, through which the soul, molded and directed to love him, speaks very familiarly to God as to its own Father with special devotion (abbreviated). - 240 (in 'The Father Revealed by the Son') - Jesus revealed that God is Father in an unheard-of sense: he is Father not only in being Creator; he is eternally Father by his relationship to his only Son who is eternally Son only in relation to his Father: \"No one knows the Son except the Father, and no one knows the Father except the Son and any one to whom the Son chooses to reveal him.\" - 473 (in 'Christ's Soul and his human knowledge') - But at the same time, this truly human knowledge of God's Son expressed the divine life of his person. \"The human nature of God's Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.\" Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father (abbreviated). - 459 (in 'Why did the Word become Flesh') - The Word became flesh to be our model of holiness: “Take my yoke upon you, and learn from me.” “I am the way, and the truth, and the life; no one comes to the Father, but by me\" (abbreviated). - 1615 (in 'Marriage in the Lord') - This unequivocal insistence on the indissolubility of the marriage bond may have left some perplexed and could seem to be a demand impossible to realize. However, Jesus has not placed on spouses a burden impossible to bear, or too heavy—heavier than the Law of Moses. By coming to restore the original order of creation disturbed by sin, he himself gives the strength and grace to live marriage in the new dimension of the Reign of God. It is by following Christ, renouncing themselves, and taking up their crosses that spouses will be able to “receive” the original meaning of marriage and live it with the help of Christ (abbreviated). - 544 (in 'The Proclamation of the Kingdom of God')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1440658,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2v4qmdalaTEdAp82OV38FO"
    },
    "href": "https://api.spotify.com/v1/episodes/2v4qmdalaTEdAp82OV38FO",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 11: 25-30 - &#39;You have hidden these things from the wise and revealed them to little children.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2603 (in &#39;Jesus Prays&#39;) - The evangelists have preserved two more explicit prayers offered by Christ during his public ministry. Each begins with thanksgiving. In the first, Jesus confesses the Father, acknowledges, and blesses him because he has hidden the mysteries of the Kingdom from those who think themselves learned and has revealed them to infants, the poor of the Beatitudes. His exclamation, &#34;Yes, Father!&#34; expresses the depth of his heart, his adherence to the Father&#39;s &#34;good pleasure,&#34; echoing his mother&#39;s Fiat at the time of his conception and prefiguring what he will say to the Father in his agony. the whole prayer of Jesus is contained in this loving adherence of his human heart to the mystery of the will of the Father.</p><br/><p>- 2701 (in &#39;Vocal Prayer&#39;) - Vocal prayer is an essential element of the Christian life. To his disciples, drawn by their Master&#39;s silent prayer, Jesus teaches a vocal prayer, the Our Father. He not only prayed aloud the liturgical prayers of the synagogue but, as the Gospels show, he raised his voice to express his personal prayer, from exultant blessing of the Father to the agony of Gesthemani.</p><br/><p>- 2785 (in &#39;Abba-Father&#39;) - Second, a humble and trusting heart that enables us &#34;to turn and become like children&#34;: for it is to &#34;little children&#34; that the Father is revealed. [The prayer is accomplished] by the contemplation of God alone, and by the warmth of love, through which the soul, molded and directed to love him, speaks very familiarly to God as to its own Father with special devotion (abbreviated).</p><br/><p>- 240 (in &#39;The Father Revealed by the Son&#39;) - Jesus revealed that God is Father in an unheard-of sense: he is Father not only in being Creator; he is eternally Father by his relationship to his only Son who is eternally Son only in relation to his Father: &#34;No one knows the Son except the Father, and no one knows the Father except the Son and any one to whom the Son chooses to reveal him.&#34;</p><br/><p>- 473 (in &#39;Christ&#39;s Soul and his human knowledge&#39;) - But at the same time, this truly human knowledge of God&#39;s Son expressed the divine life of his person. &#34;The human nature of God&#39;s Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.&#34; Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father (abbreviated).</p><br/><p>- 459 (in &#39;Why did the Word become Flesh&#39;) - The Word became flesh to be our model of holiness: “Take my yoke upon you, and learn from me.” “I am the way, and the truth, and the life; no one comes to the Father, but by me&#34; (abbreviated).</p><br/><p>- 1615 (in &#39;Marriage in the Lord&#39;) - This unequivocal insistence on the indissolubility of the marriage bond may have left some perplexed and could seem to be a demand impossible to realize. However, Jesus has not placed on spouses a burden impossible to bear, or too heavy—heavier than the Law of Moses. By coming to restore the original order of creation disturbed by sin, he himself gives the strength and grace to live marriage in the new dimension of the Reign of God. It is by following Christ, renouncing themselves, and taking up their crosses that spouses will be able to “receive” the original meaning of marriage and live it with the help of Christ (abbreviated).</p><br/><p>- 544 (in &#39;The Proclamation of the Kingdom of God&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2v4qmdalaTEdAp82OV38FO",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "14th Sunday in Ordinary Time (Year A) - Matt 11: 25-30",
    "release_date": "2023-07-08",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2v4qmdalaTEdAp82OV38FO"
}