{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3XGTb9Tuz4vxuLAspWyaL6/clip_587859_647859.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 16: 19-31 - 'Dives and Lazarus.'  Catechism of the Catholic Church Paragraphs: - 336 (in 'Angels in the Life of the Church') - From the beginning until death, human life is surrounded by their watchful care and intercession. \"Beside each believer stands an angel as protector and shepherd leading him to life.\" Already here on earth the Christian life shares by faith in the blessed company of angels and men united in God. - 2831 (in 'Give us this day our Daily Bread') - But the presence of those who hunger because they lack bread opens up another profound meaning of this petition. the drama of hunger in the world calls Christians who pray sincerely to exercise responsibility toward their brethren, both in their personal behavior and in their solidarity with the human family. This petition of the Lord's Prayer cannot be isolated from the parables of the poor man Lazarus and of the Last Judgment. - 1021 (in 'The Particular Judgement') - Death puts an end to human life as the time open to either accepting or rejecting the divine grace manifested in Christ. The New Testament speaks of judgment primarily in its aspect of the final encounter with Christ in his second coming, but also repeatedly affirms that each will be rewarded immediately after death in accordance with his works and faith. the parable of the poor man Lazarus and the words of Christ on the cross to the good thief, as well as other New Testament texts speak of a final destiny of the soul - a destiny which can be different for some and for others. - 633 (in 'Christ descended into Hell') - Scripture calls the abode of the dead, to which the dead Christ went down, \"hell\" - Sheol in Hebrew or Hades in Greek - because those who are there are deprived of the vision of God. Such is the case for all the dead, whether evil or righteous, while they await the Redeemer: which does not mean that their lot is identical, as Jesus shows through the parable of the poor man Lazarus who was received into \"Abraham's bosom\": \"It is precisely these holy souls, who awaited their Saviour in Abraham's bosom, whom Christ the Lord delivered when he descended into hell.\" Jesus did not descend into hell to deliver the damned, nor to destroy the hell of damnation, but to free the just who had gone before him. - 1859 (in 'Sin') - Mortal sin requires full knowledge and complete consent. It presupposes knowledge of the sinful character of the act, of its opposition to God's law. It also implies a consent sufficiently deliberate to be a personal choice. Feigned ignorance and hardness of heart do not diminish, but rather increase, the voluntary character of a sin.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2137280,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/2yp4VQuyFWD1bl7AFXZVe2"
    },
    "href": "https://api.spotify.com/v1/episodes/2yp4VQuyFWD1bl7AFXZVe2",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 16: 19-31 - &#39;Dives and Lazarus.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 336 (in &#39;Angels in the Life of the Church&#39;) - From the beginning until death, human life is surrounded by their watchful care and intercession. &#34;Beside each believer stands an angel as protector and shepherd leading him to life.&#34; Already here on earth the Christian life shares by faith in the blessed company of angels and men united in God.</p><br/><p>- 2831 (in &#39;Give us this day our Daily Bread&#39;) - But the presence of those who hunger because they lack bread opens up another profound meaning of this petition. the drama of hunger in the world calls Christians who pray sincerely to exercise responsibility toward their brethren, both in their personal behavior and in their solidarity with the human family. This petition of the Lord&#39;s Prayer cannot be isolated from the parables of the poor man Lazarus and of the Last Judgment.</p><br/><p>- 1021 (in &#39;The Particular Judgement&#39;) - Death puts an end to human life as the time open to either accepting or rejecting the divine grace manifested in Christ. The New Testament speaks of judgment primarily in its aspect of the final encounter with Christ in his second coming, but also repeatedly affirms that each will be rewarded immediately after death in accordance with his works and faith. the parable of the poor man Lazarus and the words of Christ on the cross to the good thief, as well as other New Testament texts speak of a final destiny of the soul - a destiny which can be different for some and for others.</p><br/><p>- 633 (in &#39;Christ descended into Hell&#39;) - Scripture calls the abode of the dead, to which the dead Christ went down, &#34;hell&#34; - Sheol in Hebrew or Hades in Greek - because those who are there are deprived of the vision of God. Such is the case for all the dead, whether evil or righteous, while they await the Redeemer: which does not mean that their lot is identical, as Jesus shows through the parable of the poor man Lazarus who was received into &#34;Abraham&#39;s bosom&#34;: &#34;It is precisely these holy souls, who awaited their Saviour in Abraham&#39;s bosom, whom Christ the Lord delivered when he descended into hell.&#34; Jesus did not descend into hell to deliver the damned, nor to destroy the hell of damnation, but to free the just who had gone before him.</p><br/><p>- 1859 (in &#39;Sin&#39;) - Mortal sin requires full knowledge and complete consent. It presupposes knowledge of the sinful character of the act, of its opposition to God&#39;s law. It also implies a consent sufficiently deliberate to be a personal choice. Feigned ignorance and hardness of heart do not diminish, but rather increase, the voluntary character of a sin.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "2yp4VQuyFWD1bl7AFXZVe2",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 2 of Lent - Luke 16: 19-31",
    "release_date": "2023-03-08",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:2yp4VQuyFWD1bl7AFXZVe2"
}