{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/26dUCYHgWjzVJKDgQsri99/clip_343613_403613.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 17: 11b-19 - 'Father, keep those you have given me true to your name.'  Catechism of the Catholic Church Paragraphs: - 2747 (in 'The Prayer of the Hour of Jesus') - Christian Tradition rightly calls this prayer the \"priestly\" prayer of Jesus. It is the prayer of our high priest, inseparable from his sacrifice, from his passing over (Passover) to the Father to whom he is wholly \"consecrated.\" - 2750 (in 'The Prayer of the Hour of Jesus') - By entering into the holy name of the Lord Jesus we can accept, from within, the prayer he teaches us: \"Our Father!\" His priestly prayer fulfills, from within, the great petitions of the Lord's Prayer: concern for the Father's name; passionate zeal for his kingdom (Glory); The accomplishment of the will of the Father, of his plan of salvation; and deliverance from evil. - 2815 (in 'Hallowed be thy name') - his petition embodies all the others. Like the six petitions that follow, it is fulfilled by the prayer of Christ. Prayer to our Father is our prayer, if it is prayed in the name of Jesus. In his priestly prayer, Jesus asks: \"Holy Father, protect in your name those whom you have given me\" (abbreviated). - 2849 (in 'and lead us not into temptation') - In this petition to our heavenly Father, Christ unites us to his battle and his agony. He urges us to vigilance of the heart in communion with his own. Vigilance is \"custody of the heart,\" and Jesus prayed for us to the Father: \"Keep them in your name\" (abbreviated). - 2850 (in 'But deliver us from evil') - The last petition to our Father is also included in Jesus' prayer: \"I am not asking you to take them out of the world, but I ask you to protect them from the evil one.\" It touches each of us personally, but it is always \"we\" who pray, in communion with the whole Church, for the deliverance of the whole human family (abbreviated). - 2812 (in 'Hallowed be thy name') - Finally, in Jesus the name of the Holy God is revealed and given to us, in the flesh, as Savior, revealed by what he is, by his word, and by his sacrifice. This is the heart of his priestly prayer: \"Holy Father . . . for their sake I consecrate myself, that they also may be consecrated in truth.\" Because he \"sanctifies\" his own name, Jesus reveals to us the name of the Father. At the end of Christ's Passover, the Father gives him the name that is above all names: \"Jesus Christ is Lord, to the glory of God the Father.\" - 2466 (in 'Living in the Truth') - he disciple of Jesus continues in his word so as to know \"the truth [that] will make you free\" and that sanctifies (abbreviated). - 611 (in 'At the Last Supper Jesus anticipated the free offering of his life') - The Eucharist that Christ institutes at that moment will be the memorial of his sacrifice. Jesus includes the apostles in his own offering and bids them perpetuate it. By doing so, the Lord institutes his apostles as priests of the New Covenant: \"For their sakes I sanctify myself, so that they also may be sanctified in truth.\" - 858 (in 'The Apostles' Mission')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1230031,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3aprQGylCwIvMDMooST8l2"
    },
    "href": "https://api.spotify.com/v1/episodes/3aprQGylCwIvMDMooST8l2",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 17: 11b-19 - &#39;Father, keep those you have given me true to your name.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2747 (in &#39;The Prayer of the Hour of Jesus&#39;) - Christian Tradition rightly calls this prayer the &#34;priestly&#34; prayer of Jesus. It is the prayer of our high priest, inseparable from his sacrifice, from his passing over (Passover) to the Father to whom he is wholly &#34;consecrated.&#34;</p><br/><p>- 2750 (in &#39;The Prayer of the Hour of Jesus&#39;) - By entering into the holy name of the Lord Jesus we can accept, from within, the prayer he teaches us: &#34;Our Father!&#34; His priestly prayer fulfills, from within, the great petitions of the Lord&#39;s Prayer: concern for the Father&#39;s name; passionate zeal for his kingdom (Glory); The accomplishment of the will of the Father, of his plan of salvation; and deliverance from evil.</p><br/><p>- 2815 (in &#39;Hallowed be thy name&#39;) - his petition embodies all the others. Like the six petitions that follow, it is fulfilled by the prayer of Christ. Prayer to our Father is our prayer, if it is prayed in the name of Jesus. In his priestly prayer, Jesus asks: &#34;Holy Father, protect in your name those whom you have given me&#34; (abbreviated).</p><br/><p>- 2849 (in &#39;and lead us not into temptation&#39;) - In this petition to our heavenly Father, Christ unites us to his battle and his agony. He urges us to vigilance of the heart in communion with his own. Vigilance is &#34;custody of the heart,&#34; and Jesus prayed for us to the Father: &#34;Keep them in your name&#34; (abbreviated).</p><br/><p>- 2850 (in &#39;But deliver us from evil&#39;) - The last petition to our Father is also included in Jesus&#39; prayer: &#34;I am not asking you to take them out of the world, but I ask you to protect them from the evil one.&#34; It touches each of us personally, but it is always &#34;we&#34; who pray, in communion with the whole Church, for the deliverance of the whole human family (abbreviated).</p><br/><p>- 2812 (in &#39;Hallowed be thy name&#39;) - Finally, in Jesus the name of the Holy God is revealed and given to us, in the flesh, as Savior, revealed by what he is, by his word, and by his sacrifice. This is the heart of his priestly prayer: &#34;Holy Father . . . for their sake I consecrate myself, that they also may be consecrated in truth.&#34; Because he &#34;sanctifies&#34; his own name, Jesus reveals to us the name of the Father. At the end of Christ&#39;s Passover, the Father gives him the name that is above all names: &#34;Jesus Christ is Lord, to the glory of God the Father.&#34;</p><br/><p>- 2466 (in &#39;Living in the Truth&#39;) - he disciple of Jesus continues in his word so as to know &#34;the truth [that] will make you free&#34; and that sanctifies (abbreviated).</p><br/><p>- 611 (in &#39;At the Last Supper Jesus anticipated the free offering of his life&#39;) - The Eucharist that Christ institutes at that moment will be the memorial of his sacrifice. Jesus includes the apostles in his own offering and bids them perpetuate it. By doing so, the Lord institutes his apostles as priests of the New Covenant: &#34;For their sakes I sanctify myself, so that they also may be sanctified in truth.&#34;</p><br/><p>- 858 (in &#39;The Apostles&#39; Mission&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3aprQGylCwIvMDMooST8l2",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "7th Sunday of Easter (Year B) - John 17: 11b-19",
    "release_date": "2021-05-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3aprQGylCwIvMDMooST8l2"
}