{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4e12svRFEy2oMme32XNwVd/clip_437797_497797.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 14: 12-16, 22-26 - This is my body; this is my blood.'  Catechism of the Catholic Church Paragraphs: - 1328 (in 'What is this Sacrament Called?') - The inexhaustible richness of this sacrament is expressed in the different names we give it. Each name evokes certain aspects of it. It is called: Eucharist, because it is an action of thanksgiving to God. the Greek words eucharistein and eulogein recall the Jewish blessings that proclaim - especially during a meal - God's works: creation, redemption, and sanctification. - 1339 (in 'The Institution of the Eucharist') - Jesus chose the time of Passover to fulfill what he had announced at Capernaum: giving his disciples his Body and his Blood: Then came the day of Unleavened Bread, on which the passover lamb had to be sacrificed. So Jesus sent Peter and John, saying, \"Go and prepare the passover meal for us, that we may eat it....\" They went ... and prepared the passover. and when the hour came, he sat at table, and the apostles with him. and he said to them, \"I have earnestly desired to eat this passover with you before I suffer; for I tell you I shall not eat it again until it is fulfilled in the kingdom of God.\".... and he took bread, and when he had given thanks he broke it and gave it to them, saying, \"This is my body which is given for you. Do this in remembrance of me.\" and likewise the cup after supper, saying, \"This cup which is poured out for you is the New Covenant in my blood.\" - 1335 (in 'The Signs of Bread and Wine') - The miracles of the multiplication of the loaves, when the Lord says the blessing, breaks and distributes the loaves through his disciples to feed the multitude, prefigure the superabundance of this unique bread of his Eucharist. The sign of water turned into wine at Cana already announces the Hour of Jesus' glorification. It makes manifest the fulfillment of the wedding feast in the Father's kingdom, where the faithful will drink the new wine that has become the Blood of Christ. - 1403 (in 'Pledge of the Glory to Come') - At the Last Supper the Lord himself directed his disciples' attention toward the fulfillment of the Passover in the kingdom of God: \"I tell you I shall not drink again of this fruit of the vine until that day when I drink it new with you in my Father's kingdom.\" Whenever the Church celebrates the Eucharist she remembers this promise and turns her gaze \"to him who is to come.\" In her prayer she calls for his coming: \"Marana tha!\" \"Come, Lord Jesus!\" \"May your grace come and this world pass away!\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2154718,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3ArNseliuddHn0Xyd50VPQ"
    },
    "href": "https://api.spotify.com/v1/episodes/3ArNseliuddHn0Xyd50VPQ",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 14: 12-16, 22-26 - This is my body; this is my blood.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1328 (in &#39;What is this Sacrament Called?&#39;) - The inexhaustible richness of this sacrament is expressed in the different names we give it. Each name evokes certain aspects of it. It is called: Eucharist, because it is an action of thanksgiving to God. the Greek words eucharistein and eulogein recall the Jewish blessings that proclaim - especially during a meal - God&#39;s works: creation, redemption, and sanctification.</p><br/><p>- 1339 (in &#39;The Institution of the Eucharist&#39;) - Jesus chose the time of Passover to fulfill what he had announced at Capernaum: giving his disciples his Body and his Blood: Then came the day of Unleavened Bread, on which the passover lamb had to be sacrificed. So Jesus sent Peter and John, saying, &#34;Go and prepare the passover meal for us, that we may eat it....&#34; They went ... and prepared the passover. and when the hour came, he sat at table, and the apostles with him. and he said to them, &#34;I have earnestly desired to eat this passover with you before I suffer; for I tell you I shall not eat it again until it is fulfilled in the kingdom of God.&#34;.... and he took bread, and when he had given thanks he broke it and gave it to them, saying, &#34;This is my body which is given for you. Do this in remembrance of me.&#34; and likewise the cup after supper, saying, &#34;This cup which is poured out for you is the New Covenant in my blood.&#34;</p><br/><p>- 1335 (in &#39;The Signs of Bread and Wine&#39;) - The miracles of the multiplication of the loaves, when the Lord says the blessing, breaks and distributes the loaves through his disciples to feed the multitude, prefigure the superabundance of this unique bread of his Eucharist. The sign of water turned into wine at Cana already announces the Hour of Jesus&#39; glorification. It makes manifest the fulfillment of the wedding feast in the Father&#39;s kingdom, where the faithful will drink the new wine that has become the Blood of Christ.</p><br/><p>- 1403 (in &#39;Pledge of the Glory to Come&#39;) - At the Last Supper the Lord himself directed his disciples&#39; attention toward the fulfillment of the Passover in the kingdom of God: &#34;I tell you I shall not drink again of this fruit of the vine until that day when I drink it new with you in my Father&#39;s kingdom.&#34; Whenever the Church celebrates the Eucharist she remembers this promise and turns her gaze &#34;to him who is to come.&#34; In her prayer she calls for his coming: &#34;Marana tha!&#34; &#34;Come, Lord Jesus!&#34; &#34;May your grace come and this world pass away!&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3ArNseliuddHn0Xyd50VPQ",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of Corpus Christi (Year B) - Mark 14: 12-16, 22-26",
    "release_date": "2021-06-02",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3ArNseliuddHn0Xyd50VPQ"
}