{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0yvXvoOWSobcnLF9IPSZvV/clip_1121600_1184500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 6: 12-19 - 'Jesus chooses his twelve apostles.'  Catechism of the Catholic Church Paragraphs: - 1577 (in 'Who Can Receive the Sacrament of Holy Orders') - \"Only a baptized man (vir) validly receives sacred ordination.\" The Lord Jesus chose men (viri) to form the college of the twelve apostles, and the apostles did the same when they chose collaborators to succeed them in their ministry. The college of bishops, with whom the priests are united in the priesthood, makes the college of the twelve an ever-present and ever-active reality until Christ's return. the Church recognizes herself to be bound by this choice made by the Lord himself. For this reason the ordination of women is not possible. - 2600 (in 'Jesus Prays') - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ's ministry. Jesus prays before the decisive moments of his mission: before his Father's witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father's plan of love by his Passion. He also prays before the decisive moments involving the mission of his apostles: at his election and call of the Twelve, before Peter's confession of him as \"the Christ of God,\" and again that the faith of the chief of the Apostles may not fail when tempted. Jesus' prayer before the events of salvation that the Father has asked him to fulfill is a humble and trusting commitment of his human will to the loving will of the Father. - 695 (in 'Symbols of the Holy Spirit') - The Spirit filled Christ and the power of the Spirit went out from him in his acts of healing and of saving (abbreviated). - 1116 (in 'The Sacraments of Christ') - Sacraments are \"powers that comes forth\" from the Body of Christ, which is ever-living and life-giving. They are actions of the Holy Spirit at work in his Body, the Church. They are \"the masterworks of God\" in the new and everlasting covenant. - 1504 (in 'Christ the Physician') - Often Jesus asks the sick to believe. He makes use of signs to heal: spittle and the laying on of hands, mud and washing. The sick try to touch him, \"for power came forth from him and healed them all.\" and so in the sacraments Christ continues to \"touch\" us in order to heal us.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1113118,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3BKcGRYCyXzrTcG1YqIV7b"
    },
    "href": "https://api.spotify.com/v1/episodes/3BKcGRYCyXzrTcG1YqIV7b",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 6: 12-19 - &#39;Jesus chooses his twelve apostles.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1577 (in &#39;Who Can Receive the Sacrament of Holy Orders&#39;) - &#34;Only a baptized man (vir) validly receives sacred ordination.&#34; The Lord Jesus chose men (viri) to form the college of the twelve apostles, and the apostles did the same when they chose collaborators to succeed them in their ministry. The college of bishops, with whom the priests are united in the priesthood, makes the college of the twelve an ever-present and ever-active reality until Christ&#39;s return. the Church recognizes herself to be bound by this choice made by the Lord himself. For this reason the ordination of women is not possible.</p><br/><p>- 2600 (in &#39;Jesus Prays&#39;) - The Gospel according to St. Luke emphasizes the action of the Holy Spirit and the meaning of prayer in Christ&#39;s ministry. Jesus prays before the decisive moments of his mission: before his Father&#39;s witness to him during his baptism and Transfiguration, and before his own fulfillment of the Father&#39;s plan of love by his Passion. He also prays before the decisive moments involving the mission of his apostles: at his election and call of the Twelve, before Peter&#39;s confession of him as &#34;the Christ of God,&#34; and again that the faith of the chief of the Apostles may not fail when tempted. Jesus&#39; prayer before the events of salvation that the Father has asked him to fulfill is a humble and trusting commitment of his human will to the loving will of the Father.</p><br/><p>- 695 (in &#39;Symbols of the Holy Spirit&#39;) - The Spirit filled Christ and the power of the Spirit went out from him in his acts of healing and of saving (abbreviated).</p><br/><p>- 1116 (in &#39;The Sacraments of Christ&#39;) - Sacraments are &#34;powers that comes forth&#34; from the Body of Christ, which is ever-living and life-giving. They are actions of the Holy Spirit at work in his Body, the Church. They are &#34;the masterworks of God&#34; in the new and everlasting covenant.</p><br/><p>- 1504 (in &#39;Christ the Physician&#39;) - Often Jesus asks the sick to believe. He makes use of signs to heal: spittle and the laying on of hands, mud and washing. The sick try to touch him, &#34;for power came forth from him and healed them all.&#34; and so in the sacraments Christ continues to &#34;touch&#34; us in order to heal us.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3BKcGRYCyXzrTcG1YqIV7b",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 23 in Ordinary Time - Luke 6: 12-19",
    "release_date": "2023-09-11",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3BKcGRYCyXzrTcG1YqIV7b"
}