{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0Iyp8QWpvOPHWyGhV7UuLR/clip_521000_580500.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 9: 1-41 - 'The blind man went off and washed himself, and came away with his sight restored.'  Catechism of the Catholic Church Paragraphs: - 1151 (in 'Signs and Symbols') - In his preaching the Lord Jesus often makes use of the signs of creation to make known the mysteries of the Kingdom of God. He performs healings and illustrates his preaching with physical signs or symbolic gestures (abbreviated). - 1504 (in 'Christ the Physician') - Often Jesus asks the sick to believe. He makes use of signs to heal: spittle and the laying on of hands, mud and washing. - 2173 (in 'The Sabbath Day') - The Gospel reports many incidents when Jesus was accused of violating the sabbath law. But Jesus never fails to respect the holiness of this day. He gives this law its authentic and authoritative interpretation: \"The sabbath was made for man, not man for the sabbath.\" With compassion, Christ declares the sabbath for doing good rather than harm, for saving life rather than killing. The sabbath is the day of the Lord of mercies and a day to honor God.\" The Son of Man is lord even of the sabbath.\" - 2827 (in 'Thy Will be done on earth as it is in Heaven') - \"If any one is a worshiper of God and does his will, God listens to him.\" Such is the power of the Church's prayer in the name of her Lord, above all in the Eucharist (abbreviated). - 588 (in 'Jesus and Israel's faith in the one God and Saviour') - Jesus scandalized the Pharisees by eating with tax collectors and sinners as familiarly as with themselves. Against those among them \"who trusted in themselves that they were righteous and despised others\", Jesus affirmed: \"I have not come to call the righteous, but sinners to repentance.\" He went further by proclaiming before the Pharisees that, since sin is      universal, those who pretend not to need salvation are blind to themselves.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 692767,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3g0rgeSJ5I7dECQD8tJc9U"
    },
    "href": "https://api.spotify.com/v1/episodes/3g0rgeSJ5I7dECQD8tJc9U",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 9: 1-41 - &#39;The blind man went off and washed himself, and came away with his sight restored.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1151 (in &#39;Signs and Symbols&#39;) - In his preaching the Lord Jesus often makes use of the signs of creation to make known the mysteries of the Kingdom of God. He performs healings and illustrates his preaching with physical signs or symbolic gestures (abbreviated).</p><br/><p>- 1504 (in &#39;Christ the Physician&#39;) - Often Jesus asks the sick to believe. He makes use of signs to heal: spittle and the laying on of hands, mud and washing.</p><br/><p>- 2173 (in &#39;The Sabbath Day&#39;) - The Gospel reports many incidents when Jesus was accused of violating the sabbath law. But Jesus never fails to respect the holiness of this day. He gives this law its authentic and authoritative interpretation: &#34;The sabbath was made for man, not man for the sabbath.&#34; With compassion, Christ declares the sabbath for doing good rather than harm, for saving life rather than killing. The sabbath is the day of the Lord of mercies and a day to honor God.&#34; The Son of Man is lord even of the sabbath.&#34;</p><br/><p>- 2827 (in &#39;Thy Will be done on earth as it is in Heaven&#39;) - &#34;If any one is a worshiper of God and does his will, God listens to him.&#34; Such is the power of the Church&#39;s prayer in the name of her Lord, above all in the Eucharist (abbreviated).</p><br/><p>- 588 (in &#39;Jesus and Israel&#39;s faith in the one God and Saviour&#39;) - Jesus scandalized the Pharisees by eating with tax collectors and sinners as familiarly as with themselves. Against those among them &#34;who trusted in themselves that they were righteous and despised others&#34;, Jesus affirmed: &#34;I have not come to call the righteous, but sinners to repentance.&#34; He went further by proclaiming before the Pharisees that, since sin is      universal, those who pretend not to need salvation are blind to themselves.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3g0rgeSJ5I7dECQD8tJc9U",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "4th Sunday of Lent (Year A) - John 9: 1-41",
    "release_date": "2023-03-18",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3g0rgeSJ5I7dECQD8tJc9U"
}