{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5hOEbdgdejN9ClfZpwc5O1/clip_703400_755100.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Mark 16: 15-20 - 'Go out to the whole world; proclaim the Good News.'  Catechism of the Catholic Church Paragraphs: - 659 (in 'He Ascended into Heaven and is seated at the right hand of the Father') - \"So then the Lord Jesus, after he had spoken to them, was taken up into heaven, and sat down at the right hand of God.\" Christ's body was glorified at the moment of his Resurrection, as proved by the new and supernatural properties it subsequently and permanently enjoys. But during the forty days when he eats and drinks familiarly with his disciples and teaches them about the kingdom, his glory remains veiled under the appearance of ordinary humanity. Jesus' final apparition ends with the irreversible entry of his humanity into divine glory, symbolized by the cloud and by heaven, where he is seated from that time forward at God's right hand (abbreviated). - 2 (in 'The Life of Man - to know and love God') - So that this call should resound throughout the world, Christ sent forth the apostles he had chosen, commissioning them to proclaim the gospel: \"Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you; and lo, I am with you always, to the close of the age.\" Strengthened by this mission, the apostles \"went forth and preached everywhere, while the Lord worked with them and confirmed the message by the signs that attended it.\" - 156 (in 'Faith and Understanding') - What moves us to believe is not the fact that revealed truths appear as true and intelligible in the light of our natural reason: we believe \"because of the authority of God himself who reveals them, who can neither deceive nor be deceived\". So \"that the submission of our faith might nevertheless be in accordance with reason, God willed that external proofs of his Revelation should be joined to the internal helps of the Holy Spirit.\" Thus the miracles of Christ and the saints, prophecies, the Church's growth and holiness, and her fruitfulness and stability \"are the most certain signs of divine Revelation, adapted to the intelligence of all\"; they are \"motives of credibility\" (motiva credibilitatis), which show that the assent of faith is \"by no means a blind impulse of the mind.\" - 670 (in 'Christ already reigns through the Church') - Since the Ascension God's plan has entered into its fulfilment. We are already at \"the last hour\". \"Already the final age of the world is with us, and the renewal of the world is irrevocably under way; it is even now anticipated in a certain real way, for the Church on earth is endowed already with a sanctity that is real but imperfect.\" Christ's kingdom already manifests its presence through the miraculous signs that attend its proclamation by the Church. - 977 (in 'One Baptism for the Forgiveness of Sins') - Our Lord tied the forgiveness of sins to faith and Baptism: “Go into all the world and preach the gospel to the whole creation. He who believes and is baptized will be saved\" (abbreviated) - 1223 (in 'Christ's Baptism') - After his resurrection Christ gives this mission to his apostles: “Go therefore and make disciples of all nations, baptizing them in the name of the Father andof the Son and of the Holy Spirit, teaching them to observe all that I have commanded you\" (abbreviated) - 888 (in 'The Teaching Office') - 161 (in 'The Necessity of Faith') - 183 (in 'Faith') - 1253 (in 'Faith and Baptism') - 1257 (in 'The Necessity of Baptism') - 1507 (in 'Heal the sick') - 434 (in 'Jesus') - 1673 (in 'Various forms of sacramentals')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1089828,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3jNpFAPK2FCLlZOYteVNdM"
    },
    "href": "https://api.spotify.com/v1/episodes/3jNpFAPK2FCLlZOYteVNdM",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Mark 16: 15-20 - &#39;Go out to the whole world; proclaim the Good News.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 659 (in &#39;He Ascended into Heaven and is seated at the right hand of the Father&#39;) - &#34;So then the Lord Jesus, after he had spoken to them, was taken up into heaven, and sat down at the right hand of God.&#34; Christ&#39;s body was glorified at the moment of his Resurrection, as proved by the new and supernatural properties it subsequently and permanently enjoys. But during the forty days when he eats and drinks familiarly with his disciples and teaches them about the kingdom, his glory remains veiled under the appearance of ordinary humanity. Jesus&#39; final apparition ends with the irreversible entry of his humanity into divine glory, symbolized by the cloud and by heaven, where he is seated from that time forward at God&#39;s right hand (abbreviated).</p><br/><p>- 2 (in &#39;The Life of Man - to know and love God&#39;) - So that this call should resound throughout the world, Christ sent forth the apostles he had chosen, commissioning them to proclaim the gospel: &#34;Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you; and lo, I am with you always, to the close of the age.&#34; Strengthened by this mission, the apostles &#34;went forth and preached everywhere, while the Lord worked with them and confirmed the message by the signs that attended it.&#34;</p><br/><p>- 156 (in &#39;Faith and Understanding&#39;) - What moves us to believe is not the fact that revealed truths appear as true and intelligible in the light of our natural reason: we believe &#34;because of the authority of God himself who reveals them, who can neither deceive nor be deceived&#34;. So &#34;that the submission of our faith might nevertheless be in accordance with reason, God willed that external proofs of his Revelation should be joined to the internal helps of the Holy Spirit.&#34; Thus the miracles of Christ and the saints, prophecies, the Church&#39;s growth and holiness, and her fruitfulness and stability &#34;are the most certain signs of divine Revelation, adapted to the intelligence of all&#34;; they are &#34;motives of credibility&#34; (motiva credibilitatis), which show that the assent of faith is &#34;by no means a blind impulse of the mind.&#34;</p><br/><p>- 670 (in &#39;Christ already reigns through the Church&#39;) - Since the Ascension God&#39;s plan has entered into its fulfilment. We are already at &#34;the last hour&#34;. &#34;Already the final age of the world is with us, and the renewal of the world is irrevocably under way; it is even now anticipated in a certain real way, for the Church on earth is endowed already with a sanctity that is real but imperfect.&#34; Christ&#39;s kingdom already manifests its presence through the miraculous signs that attend its proclamation by the Church.</p><br/><p>- 977 (in &#39;One Baptism for the Forgiveness of Sins&#39;) - Our Lord tied the forgiveness of sins to faith and Baptism: “Go into all the world and preach the gospel to the whole creation. He who believes and is baptized will be saved&#34; (abbreviated)</p><br/><p>- 1223 (in &#39;Christ&#39;s Baptism&#39;) - After his resurrection Christ gives this mission to his apostles: “Go therefore and make disciples of all nations, baptizing them in the name of the Father andof the Son and of the Holy Spirit, teaching them to observe all that I have commanded you&#34; (abbreviated)</p><br/><p>- 888 (in &#39;The Teaching Office&#39;)</p><br/><p>- 161 (in &#39;The Necessity of Faith&#39;)</p><br/><p>- 183 (in &#39;Faith&#39;)</p><br/><p>- 1253 (in &#39;Faith and Baptism&#39;)</p><br/><p>- 1257 (in &#39;The Necessity of Baptism&#39;)</p><br/><p>- 1507 (in &#39;Heal the sick&#39;)</p><br/><p>- 434 (in &#39;Jesus&#39;)</p><br/><p>- 1673 (in &#39;Various forms of sacramentals&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3jNpFAPK2FCLlZOYteVNdM",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of Saint Mark, Evangelist - Mark 16: 15-20",
    "release_date": "2023-04-24",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3jNpFAPK2FCLlZOYteVNdM"
}