{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4RjA8IFVcXrrNsQbEEbiIt/clip_411100_458100.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠  John 3: 7-15 - 'No one has gone up to Heaven except the Son of Man who has come down from heaven.'  Catechism of the Catholic Church Paragraphs: - 526 (in 'Little Child, God eternal') - To become a child in relation to God is the condition for entering the kingdom. For this, we must humble ourselves and become little. Even more: to become \"children of God\" we must be \"born from above\" or \"born of God\" (abbreviated). - 591 (in 'Jesus and Israel's faith in the One God and Saviour') - Jesus asked the religious authorities of Jerusalem to believe in him because of the Father's works which he accomplished. But such an act of faith must go through a mysterious death to self, for a new \"birth from above\" under the influence of divine grace (abbreviated). - 423 (in 'The Good News: God has sent his son') - We believe and confess that Jesus of Nazareth, born a Jew of a daughter of Israel at Bethlehem at the time of King Herod the Great and the emperor Caesar Augustus, a carpenter by trade, who died crucified in Jerusalem under the procurator Pontius Pilate during the reign of the emperor Tiberius, is the eternal Son of God made man. He 'came from God', 'descended from heaven', and 'came in the flesh'. For 'the Word became flesh and dwelt among us, full of grace and truth; we have beheld his glory, glory as of the only Son from the Father. . . and from his fullness have we all received, grace upon grace.' - 440 (in 'Christ') - Jesus unveiled the authentic content of his messianic kingship both in the transcendent identity of the Son of Man \"who came down from heaven\", and in his redemptive mission as the suffering Servant: \"The Son of Man came not to be served but to serve, and to give his life as a ransom for many.\" Hence the true meaning of his kingship is revealed only when he is raised high on the cross (abbreviated). - 661 (in 'He Ascended into Heaven and is seated at the right hand of the Father') - This final stage stays closely linked to the first, that is, to his descent from heaven in the Incarnation. Only the one who \"came from the Father\" can return to the Father: Christ Jesus. \"No one has ascended into heaven but he who descended from heaven, the Son of man.\" Left to its own natural powers humanity does not have access to the \"Father's house\", to God's life and happiness. Only Christ can open to man such access that we, his members, might have confidence that we too shall go where he, our Head and our Source, has preceded us. - 2130 (in 'You shall not make for yourself a graven image') - Nevertheless, already in the Old Testament, God ordained or permitted the making of images that pointed symbolically toward salvation by the incarnate Word: so it was with the bronze serpent, the ark of the covenant, and the cherubim.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1342949,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3mAifsvuAZkgckqyIS7laa"
    },
    "href": "https://api.spotify.com/v1/episodes/3mAifsvuAZkgckqyIS7laa",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠</a></p><br/><p><br /></p><br/><p>John 3: 7-15 - &#39;No one has gone up to Heaven except the Son of Man who has come down from heaven.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 526 (in &#39;Little Child, God eternal&#39;) - To become a child in relation to God is the condition for entering the kingdom. For this, we must humble ourselves and become little. Even more: to become &#34;children of God&#34; we must be &#34;born from above&#34; or &#34;born of God&#34; (abbreviated).</p><br/><p>- 591 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;) - Jesus asked the religious authorities of Jerusalem to believe in him because of the Father&#39;s works which he accomplished. But such an act of faith must go through a mysterious death to self, for a new &#34;birth from above&#34; under the influence of divine grace (abbreviated).</p><br/><p>- 423 (in &#39;The Good News: God has sent his son&#39;) - We believe and confess that Jesus of Nazareth, born a Jew of a daughter of Israel at Bethlehem at the time of King Herod the Great and the emperor Caesar Augustus, a carpenter by trade, who died crucified in Jerusalem under the procurator Pontius Pilate during the reign of the emperor Tiberius, is the eternal Son of God made man. He &#39;came from God&#39;, &#39;descended from heaven&#39;, and &#39;came in the flesh&#39;. For &#39;the Word became flesh and dwelt among us, full of grace and truth; we have beheld his glory, glory as of the only Son from the Father. . . and from his fullness have we all received, grace upon grace.&#39;</p><br/><p>- 440 (in &#39;Christ&#39;) - Jesus unveiled the authentic content of his messianic kingship both in the transcendent identity of the Son of Man &#34;who came down from heaven&#34;, and in his redemptive mission as the suffering Servant: &#34;The Son of Man came not to be served but to serve, and to give his life as a ransom for many.&#34; Hence the true meaning of his kingship is revealed only when he is raised high on the cross (abbreviated).</p><br/><p>- 661 (in &#39;He Ascended into Heaven and is seated at the right hand of the Father&#39;) - This final stage stays closely linked to the first, that is, to his descent from heaven in the Incarnation. Only the one who &#34;came from the Father&#34; can return to the Father: Christ Jesus. &#34;No one has ascended into heaven but he who descended from heaven, the Son of man.&#34; Left to its own natural powers humanity does not have access to the &#34;Father&#39;s house&#34;, to God&#39;s life and happiness. Only Christ can open to man such access that we, his members, might have confidence that we too shall go where he, our Head and our Source, has preceded us.</p><br/><p>- 2130 (in &#39;You shall not make for yourself a graven image&#39;) - Nevertheless, already in the Old Testament, God ordained or permitted the making of images that pointed symbolically toward salvation by the incarnate Word: so it was with the bronze serpent, the ark of the covenant, and the cherubim.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3mAifsvuAZkgckqyIS7laa",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 2 of Eastertide - John 3: 7-15",
    "release_date": "2023-04-17",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3mAifsvuAZkgckqyIS7laa"
}