{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0u0OkiAVTCuOndO9n6B697/clip_288024_348024.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 2: 41-52 - 'Mary stored up all of these things in her heart.'  Catechism of the Catholic Church Paragraphs: - 534 (in 'The Mysteries of Jesus' Hidden Life') - The finding of Jesus in the temple is the only event that breaks the silence of the Gospels about the hidden years of Jesus. Here Jesus lets us catch a glimpse of the mystery of his total consecration to a mission that flows from his divine sonship: \"Did you not know that I must be about my Father's work?\" Mary and Joseph did not understand these words, but they accepted them in faith. Mary \"kept all these things in her heart\" during the years Jesus remained hidden in the silence of an ordinary life. - 583 (in 'Jesus and the temple') - Like the prophets before him Jesus expressed the deepest respect for the Temple in Jerusalem. It was in the Temple that Joseph and Mary presented him forty days after his birth At the age of twelve he decided to remain in the Temple to remind his parents that he must be about his Father's business (abbreviated). - 2599 (in 'Jesus Prays') - He learns to pray in the words and rhythms of the prayer of his people, in the synagogue at Nazareth and the Temple at Jerusalem. But his prayer springs from an otherwise secret source, as he intimates at the age of twelve: \"I must be in my Father's house.\" Here the newness of prayer in the fullness of time begins to be revealed: his filial prayer, which the Father awaits from his children, is finally going to be lived out by the only Son in his humanity, with and for men (abbreviated). - 531 (in 'The Mysteries of Jesus' Hidden Life') - During the greater part of his life Jesus shared the condition of the vast majority of human beings: a daily life spent without evident greatness, a life of manual labour. His religious life was that of a Jew obedient to the law of God, a life in the community. From this whole period it is revealed to us that Jesus was \"obedient\" to his parents and that he \"increased in wisdom and in stature, and in favour with God and man.\" - 517 (in Characteristics common to Jesus' mysteries') - When Christ became incarnate and was made man, he recapitulated in himself the long history of mankind and procured for us a \"short cut\" to salvation, so that what we had lost in Adam, that is, being in the image and likeness of God, we might recover in Christ Jesus. For this reason Christ experienced all the stages of life, thereby giving communion with God to all men (abbreviated). - 2196 (in 'The Fourth Commandment') - He was obedient to them (abbreviated). - 472 (in 'Christ's soul and his human knowledge') - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, \"increase in wisdom and in stature, and in favour with God and man\", and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking \"the form of a slave\" (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1749461,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3rBYMHaSLHKxBov0xWDLvI"
    },
    "href": "https://api.spotify.com/v1/episodes/3rBYMHaSLHKxBov0xWDLvI",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 2: 41-52 - &#39;Mary stored up all of these things in her heart.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 534 (in &#39;The Mysteries of Jesus&#39; Hidden Life&#39;) - The finding of Jesus in the temple is the only event that breaks the silence of the Gospels about the hidden years of Jesus. Here Jesus lets us catch a glimpse of the mystery of his total consecration to a mission that flows from his divine sonship: &#34;Did you not know that I must be about my Father&#39;s work?&#34; Mary and Joseph did not understand these words, but they accepted them in faith. Mary &#34;kept all these things in her heart&#34; during the years Jesus remained hidden in the silence of an ordinary life.</p><br/><p>- 583 (in &#39;Jesus and the temple&#39;) - Like the prophets before him Jesus expressed the deepest respect for the Temple in Jerusalem. It was in the Temple that Joseph and Mary presented him forty days after his birth At the age of twelve he decided to remain in the Temple to remind his parents that he must be about his Father&#39;s business (abbreviated).</p><br/><p>- 2599 (in &#39;Jesus Prays&#39;) - He learns to pray in the words and rhythms of the prayer of his people, in the synagogue at Nazareth and the Temple at Jerusalem. But his prayer springs from an otherwise secret source, as he intimates at the age of twelve: &#34;I must be in my Father&#39;s house.&#34; Here the newness of prayer in the fullness of time begins to be revealed: his filial prayer, which the Father awaits from his children, is finally going to be lived out by the only Son in his humanity, with and for men (abbreviated).</p><br/><p>- 531 (in &#39;The Mysteries of Jesus&#39; Hidden Life&#39;) - During the greater part of his life Jesus shared the condition of the vast majority of human beings: a daily life spent without evident greatness, a life of manual labour. His religious life was that of a Jew obedient to the law of God, a life in the community. From this whole period it is revealed to us that Jesus was &#34;obedient&#34; to his parents and that he &#34;increased in wisdom and in stature, and in favour with God and man.&#34;</p><br/><p>- 517 (in Characteristics common to Jesus&#39; mysteries&#39;) - When Christ became incarnate and was made man, he recapitulated in himself the long history of mankind and procured for us a &#34;short cut&#34; to salvation, so that what we had lost in Adam, that is, being in the image and likeness of God, we might recover in Christ Jesus. For this reason Christ experienced all the stages of life, thereby giving communion with God to all men (abbreviated).</p><br/><p>- 2196 (in &#39;The Fourth Commandment&#39;) - He was obedient to them (abbreviated).</p><br/><p>- 472 (in &#39;Christ&#39;s soul and his human knowledge&#39;) - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, &#34;increase in wisdom and in stature, and in favour with God and man&#34;, and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking &#34;the form of a slave&#34; (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3rBYMHaSLHKxBov0xWDLvI",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of The Holy Family (Year C) - Luke 2: 41-52",
    "release_date": "2021-12-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3rBYMHaSLHKxBov0xWDLvI"
}