{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1SCAv5n9GvpcLVaAA5cpZY/clip_989100_1033700.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠  John 18:1 - 19:42 - 'The Passion of our Lord Jesus Christ.'  Catechism of the Catholic Church Paragraphs: - 607-609 (in 'Christ Offered Himself to his Father for our Sins') - The desire to embrace his Father's plan of redeeming love inspired Jesus' whole life for his redemptive passion was the very reason for his Incarnation. and so he asked, \"and what shall I say? 'Father, save me from this hour'? No, for this purpose I have come to this hour. and again, \"Shall I not drink the cup which the Father has given me?\" From the cross, just before \"It is finished\", he said, \"I thirst.\" After agreeing to baptize him along with the sinners, John the Baptist looked at Jesus and pointed him out as the \"Lamb of God, who takes away the sin of the world\". By doing so, he reveals that Jesus is at the same time the suffering Servant who silently allows himself to be led to the slaughter and who bears the sin of the multitudes, and also the Paschal Lamb, the symbol of Israel's redemption at the first Passover. Christ's whole life expresses his mission: \"to serve, and to give his life as a ransom for many.\" By embracing in his human heart the Father's love for men, Jesus \"loved them to the end\", for \"greater love has no man than this, that a man lay down his life for his friends.\" In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men .Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: \"No one takes [my life] from me, but I lay it down of my own accord.\" Hence the sovereign freedom of God's Son as he went out to his death. - 2605 (in 'Jesus Prays') - When the hour had come for him to fulfill the Father's plan of love, Jesus allows a glimpse of the boundless depth of his filial prayer, not only before he freely delivered himself up (“Abba . . . not my will, but yours.\"), but even in his last words on the Cross, where prayer and the gift of self are but one: \"Father, forgive them, for they know not what they do\",\"Truly, I say to you, today you will be with me in Paradise\", \"Woman, behold your son\" - \"Behold your mother\", \"I thirst.\"; \"My God, My God, why have you forsaken me?\" \"It is finished\"; \"Father, into your hands I commit my spirit!\" until the \"loud cry\" as he expires, giving up his spirit.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1128559,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/3xCGGN4wpJZmSdI6V9UzFW"
    },
    "href": "https://api.spotify.com/v1/episodes/3xCGGN4wpJZmSdI6V9UzFW",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠</a></p><br/><p><br /></p><br/><p>John 18:1 - 19:42 - &#39;The Passion of our Lord Jesus Christ.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 607-609 (in &#39;Christ Offered Himself to his Father for our Sins&#39;) - The desire to embrace his Father&#39;s plan of redeeming love inspired Jesus&#39; whole life for his redemptive passion was the very reason for his Incarnation. and so he asked, &#34;and what shall I say? &#39;Father, save me from this hour&#39;? No, for this purpose I have come to this hour. and again, &#34;Shall I not drink the cup which the Father has given me?&#34; From the cross, just before &#34;It is finished&#34;, he said, &#34;I thirst.&#34; After agreeing to baptize him along with the sinners, John the Baptist looked at Jesus and pointed him out as the &#34;Lamb of God, who takes away the sin of the world&#34;. By doing so, he reveals that Jesus is at the same time the suffering Servant who silently allows himself to be led to the slaughter and who bears the sin of the multitudes, and also the Paschal Lamb, the symbol of Israel&#39;s redemption at the first Passover. Christ&#39;s whole life expresses his mission: &#34;to serve, and to give his life as a ransom for many.&#34; By embracing in his human heart the Father&#39;s love for men, Jesus &#34;loved them to the end&#34;, for &#34;greater love has no man than this, that a man lay down his life for his friends.&#34; In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men .Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: &#34;No one takes [my life] from me, but I lay it down of my own accord.&#34; Hence the sovereign freedom of God&#39;s Son as he went out to his death.</p><br/><p>- 2605 (in &#39;Jesus Prays&#39;) - When the hour had come for him to fulfill the Father&#39;s plan of love, Jesus allows a glimpse of the boundless depth of his filial prayer, not only before he freely delivered himself up (“Abba . . . not my will, but yours.&#34;), but even in his last words on the Cross, where prayer and the gift of self are but one: &#34;Father, forgive them, for they know not what they do&#34;,&#34;Truly, I say to you, today you will be with me in Paradise&#34;, &#34;Woman, behold your son&#34; - &#34;Behold your mother&#34;, &#34;I thirst.&#34;; &#34;My God, My God, why have you forsaken me?&#34; &#34;It is finished&#34;; &#34;Father, into your hands I commit my spirit!&#34; until the &#34;loud cry&#34; as he expires, giving up his spirit.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "3xCGGN4wpJZmSdI6V9UzFW",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Good Friday - John 18:1 - 19:42",
    "release_date": "2023-04-06",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:3xCGGN4wpJZmSdI6V9UzFW"
}