{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4gNJvhdtNdE8YatREo59pf/clip_302328_362328.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 5: 31-47 - 'You place your hopes on Moses, but Moses will be your accuser.'  Catechism of the Catholic Church Paragraphs: - 719 (in 'John, precursor, prophet and baptist') - John the Baptist is \"more than a prophet.\" In him, the Holy Spirit concludes his speaking through the prophets. John completes the cycle of prophets begun by Elijah. He proclaims the imminence of the consolation of Israel; he is the \"voice\" of the Consoler who is coming. As the Spirit of truth will also do, John \"came to bear witness to the light.\" In John's sight, the Spirit thus brings to completion the careful search of the prophets and fulfills the longing of the angels. \"He on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit. and I have seen and have borne witness that this is the Son of God.... Behold, the Lamb of God.\" - 548 (in 'The Signs of the Kingdom of God') - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father's works; they bear witness that he is the Son of God (abbreviated). - 582 (in 'Jesus and the Law') - In presenting with divine authority the definitive interpretation of the Law, Jesus found himself confronted by certain teachers of the Law who did not accept his interpretation of the Law, guaranteed though it was by the divine signs that accompanied it (abbreviated). - 702 (in 'God's Spirit and the Word in the Time of the Promises') - From the beginning until \"the fullness of time,\" The joint mission of the Father's Word and Spirit remains hidden, but it is at work. God's Spirit prepares for the time of the Messiah. Neither is fully revealed but both are already promised, to be watched for and welcomed at their manifestation. So, for this reason, when the Church reads the Old Testament, she searches there for what the Spirit, \"who has spoken through the prophets,\" wants to tell us about Christ.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1404435,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/40LZz5YUnx34qURlDq9Awd"
    },
    "href": "https://api.spotify.com/v1/episodes/40LZz5YUnx34qURlDq9Awd",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 5: 31-47 - &#39;You place your hopes on Moses, but Moses will be your accuser.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 719 (in &#39;John, precursor, prophet and baptist&#39;) - John the Baptist is &#34;more than a prophet.&#34; In him, the Holy Spirit concludes his speaking through the prophets. John completes the cycle of prophets begun by Elijah. He proclaims the imminence of the consolation of Israel; he is the &#34;voice&#34; of the Consoler who is coming. As the Spirit of truth will also do, John &#34;came to bear witness to the light.&#34; In John&#39;s sight, the Spirit thus brings to completion the careful search of the prophets and fulfills the longing of the angels. &#34;He on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit. and I have seen and have borne witness that this is the Son of God.... Behold, the Lamb of God.&#34;</p><br/><p>- 548 (in &#39;The Signs of the Kingdom of God&#39;) - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father&#39;s works; they bear witness that he is the Son of God (abbreviated).</p><br/><p>- 582 (in &#39;Jesus and the Law&#39;) - In presenting with divine authority the definitive interpretation of the Law, Jesus found himself confronted by certain teachers of the Law who did not accept his interpretation of the Law, guaranteed though it was by the divine signs that accompanied it (abbreviated).</p><br/><p>- 702 (in &#39;God&#39;s Spirit and the Word in the Time of the Promises&#39;) - From the beginning until &#34;the fullness of time,&#34; The joint mission of the Father&#39;s Word and Spirit remains hidden, but it is at work. God&#39;s Spirit prepares for the time of the Messiah. Neither is fully revealed but both are already promised, to be watched for and welcomed at their manifestation. So, for this reason, when the Church reads the Old Testament, she searches there for what the Spirit, &#34;who has spoken through the prophets,&#34; wants to tell us about Christ.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "40LZz5YUnx34qURlDq9Awd",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 4 of Lent - John 5: 31-47",
    "release_date": "2023-03-22",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:40LZz5YUnx34qURlDq9Awd"
}