{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0W5f7tFNqgKzgtu2jWxKgZ/clip_455900_517600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠http://patreon.com/logicalbiblestudy⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠https://mysoundwise.com/publishers/1677296682850p  Matt 1: 1-16, 18-23 - 'The ancestry and conception of Jesus Christ.'  Catechism of the Catholic Church Paragraphs: - 437 (in 'Christ') - God called Joseph to “take Mary as your wife, for that which is conceived in her is of the Holy Spirit,” so that Jesus, “who is called Christ,” should be born of Joseph’s spouse into the messianic lineage of David (abbreviated) - 333 (in 'Christ with all his angels') - From the Incarnation to the Ascension, the life of the Word incarnate is surrounded by the adoration and service of angels. When God \"brings the firstborn into the world, he says: 'Let all God's angels worship him.'\" Their song of praise at the birth of Christ has not ceased resounding in the Church's praise: \"Glory to God in the highest!\" They protect Jesus in his infancy, serve him in the desert, strengthen him in his agony in the garden, when he could have been saved by them from the hands of his enemies as Israel had been (abbreviated). - 497 (in 'Mary's Virginity') - The Gospel accounts understand the virginal conception of Jesus as a divine work that surpasses all human understanding and possibility: \"That which is conceived in her is of the Holy Spirit\", said the angel to Joseph about Mary his fiancee. The Church sees here the fulfilment of the divine promise given through the prophet Isaiah: \"Behold, a virgin shall conceive and bear a son.\" - 486 (in 'Who was Conceived by the Holy Spirit') - The Father’s only Son, conceived as man in the womb of the Virgin Mary, is “Christ,” that is to say, anointed by the Holy Spirit, from the beginning of his human existence, though the manifestation of this fact takes place only progressively: to the shepherds, to the magi, to John the Baptist, to the disciples (abbreviated) - 430 (in 'Jesus') - Jesus means in Hebrew: “God saves\" (abbreviated) - 452 (in 'The Only Son of God') - The name Jesus means “God saves.” The child born of the Virgin Mary is called Jesus, “for he will save his people from their sins” (Mt 1:21): “there is no other name under heaven given among men by which we must be saved” (Acts 4:12). - 1507 (in 'Heal the Sick') - The risen Lord renews this mission (“In my name . . . they will lay their hands on the sick, and they will recover.” and confirms it through the signs that the Church performs by invoking his name. These signs demonstrate in a special way that Jesus is truly “God who saves.” - 1846 (in 'Mercy and Sin') - The Gospel is the revelation in Jesus Christ of God’s mercy to sinners. The angel announced to Joseph: “You shall call his name Jesus, for he will save his people from their sins\" (abbreviated). - 2666 (in 'Prayer to Jesus') - But the one name that contains everything is the one that the Son of God received in his incarnation: Jesus. The divine name may not be spoken by human lips, but by assuming our humanity The Word of God hands it over to us and we can invoke it: “Jesus,” “YHWH saves\" (abbreviated) - 2812 (in 'Hallowed be Thy Name') - Finally, in Jesus the name of the Holy God is revealed and given to us, in the flesh, as Savior, revealed by what he is, by his word, and by his sacrifice (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1741055,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/43VRdFjH18Vxtk5Uc3o1A6"
    },
    "href": "https://api.spotify.com/v1/episodes/43VRdFjH18Vxtk5Uc3o1A6",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠http://patreon.com/logicalbiblestudy⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matt 1: 1-16, 18-23 - &#39;The ancestry and conception of Jesus Christ.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 437 (in &#39;Christ&#39;) - God called Joseph to “take Mary as your wife, for that which is conceived in her is of the Holy Spirit,” so that Jesus, “who is called Christ,” should be born of Joseph’s spouse into the messianic lineage of David (abbreviated)</p><br/><p>- 333 (in &#39;Christ with all his angels&#39;) - From the Incarnation to the Ascension, the life of the Word incarnate is surrounded by the adoration and service of angels. When God &#34;brings the firstborn into the world, he says: &#39;Let all God&#39;s angels worship him.&#39;&#34; Their song of praise at the birth of Christ has not ceased resounding in the Church&#39;s praise: &#34;Glory to God in the highest!&#34; They protect Jesus in his infancy, serve him in the desert, strengthen him in his agony in the garden, when he could have been saved by them from the hands of his enemies as Israel had been (abbreviated).</p><br/><p>- 497 (in &#39;Mary&#39;s Virginity&#39;) - The Gospel accounts understand the virginal conception of Jesus as a divine work that surpasses all human understanding and possibility: &#34;That which is conceived in her is of the Holy Spirit&#34;, said the angel to Joseph about Mary his fiancee. The Church sees here the fulfilment of the divine promise given through the prophet Isaiah: &#34;Behold, a virgin shall conceive and bear a son.&#34;</p><br/><p>- 486 (in &#39;Who was Conceived by the Holy Spirit&#39;) - The Father’s only Son, conceived as man in the womb of the Virgin Mary, is “Christ,” that is to say, anointed by the Holy Spirit, from the beginning of his human existence, though the manifestation of this fact takes place only progressively: to the shepherds, to the magi, to John the Baptist, to the disciples (abbreviated)</p><br/><p>- 430 (in &#39;Jesus&#39;) - Jesus means in Hebrew: “God saves&#34; (abbreviated)</p><br/><p>- 452 (in &#39;The Only Son of God&#39;) - The name Jesus means “God saves.” The child born of the Virgin Mary is called Jesus, “for he will save his people from their sins” (Mt 1:21): “there is no other name under heaven given among men by which we must be saved” (Acts 4:12).</p><br/><p>- 1507 (in &#39;Heal the Sick&#39;) - The risen Lord renews this mission (“In my name . . . they will lay their hands on the sick, and they will recover.” and confirms it through the signs that the Church performs by invoking his name. These signs demonstrate in a special way that Jesus is truly “God who saves.”</p><br/><p>- 1846 (in &#39;Mercy and Sin&#39;) - The Gospel is the revelation in Jesus Christ of God’s mercy to sinners. The angel announced to Joseph: “You shall call his name Jesus, for he will save his people from their sins&#34; (abbreviated).</p><br/><p>- 2666 (in &#39;Prayer to Jesus&#39;) - But the one name that contains everything is the one that the Son of God received in his incarnation: Jesus. The divine name may not be spoken by human lips, but by assuming our humanity The Word of God hands it over to us and we can invoke it: “Jesus,” “YHWH saves&#34; (abbreviated)</p><br/><p>- 2812 (in &#39;Hallowed be Thy Name&#39;) - Finally, in Jesus the name of the Holy God is revealed and given to us, in the flesh, as Savior, revealed by what he is, by his word, and by his sacrifice (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "43VRdFjH18Vxtk5Uc3o1A6",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of the Birthday of the Blessed Virgin Mary - Matt 1: 1-16, 18-23",
    "release_date": "2023-09-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:43VRdFjH18Vxtk5Uc3o1A6"
}