{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/41IkRp7bteMmmbAUaoyrQS/clip_672700_747300.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 13: 44-52 - 'He sells everything he owns and buys the field.'  Catechism of the Catholic Church Paragraphs: - 546 (in 'The Proclamation of the Kingdom of God') - Jesus' invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word? What use has he made of the talents he has received? Jesus and the presence of the kingdom in this world are secretly at the heart of the parables. One must enter the kingdom, that is, become a disciple of Christ, in order to \"know the secrets of the kingdom of heaven\". For those who stay \"outside\", everything remains enigmatic. - 1034 (in 'Hell') - Jesus often speaks of \"Gehenna\" of \"the unquenchable fire\" reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he \"will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,\" and that he will pronounce the condemnation: \"Depart from me, you cursed, into the eternal fire!\" - 1117 (in 'The Sacraments of the Church') - As she has done for the canon of Sacred Scripture and for the doctrine of the faith, the Church, by the power of the Spirit who guides her \"into all truth,\" has gradually recognized this treasure received from Christ and, as the faithful steward of God's mysteries, has determined its \"dispensation.\" Thus the Church has discerned over the centuries that among liturgical celebrations there are seven that are, in the strict sense of the term, sacraments instituted by the Lord.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1626697,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/48VjkNxyAOBRD8wfg0MMRX"
    },
    "href": "https://api.spotify.com/v1/episodes/48VjkNxyAOBRD8wfg0MMRX",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 13: 44-52 - &#39;He sells everything he owns and buys the field.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 546 (in &#39;The Proclamation of the Kingdom of God&#39;) - Jesus&#39; invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word? What use has he made of the talents he has received? Jesus and the presence of the kingdom in this world are secretly at the heart of the parables. One must enter the kingdom, that is, become a disciple of Christ, in order to &#34;know the secrets of the kingdom of heaven&#34;. For those who stay &#34;outside&#34;, everything remains enigmatic.</p><br/><p>- 1034 (in &#39;Hell&#39;) - Jesus often speaks of &#34;Gehenna&#34; of &#34;the unquenchable fire&#34; reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he &#34;will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,&#34; and that he will pronounce the condemnation: &#34;Depart from me, you cursed, into the eternal fire!&#34;</p><br/><p>- 1117 (in &#39;The Sacraments of the Church&#39;) - As she has done for the canon of Sacred Scripture and for the doctrine of the faith, the Church, by the power of the Spirit who guides her &#34;into all truth,&#34; has gradually recognized this treasure received from Christ and, as the faithful steward of God&#39;s mysteries, has determined its &#34;dispensation.&#34; Thus the Church has discerned over the centuries that among liturgical celebrations there are seven that are, in the strict sense of the term, sacraments instituted by the Lord.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "48VjkNxyAOBRD8wfg0MMRX",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "17th Sunday in Ordinary Time (Year A) - Matt 13: 44-52",
    "release_date": "2023-07-29",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:48VjkNxyAOBRD8wfg0MMRX"
}