{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7uGjfsIMYMQlyj4zHxYZk8/clip_422820_482820.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 13: 31-33a, 34-35 - 'In the Son of Man, God has been glorified.'  Catechism of the Catholic Church Paragraphs: - 782 (in 'The Characteristics of the People of God') - The People of God is marked by characteristics that clearly distinguish it from all other religious, ethnic, political, or cultural groups found in history...Its law is the new commandment to love as Christ loved us. This is the new law of the Holy Spirit (abbreviated). - 1823 (in 'Charity') - Jesus makes charity the new commandment. By loving his own \"to the end,\" he makes manifest the Father's love which he receives. By loving one another, the disciples imitate the love of Jesus which they themselves receive. Whence Jesus says: \"As the Father has loved me, so have I loved you; abide in my love.\" and again: \"This is my commandment, that you love one another as I have loved you.\" - 2822 (in 'Thy will be done on earth as it is in Heaven') - Our Father \"desires all men to be saved and to come to the knowledge of the truth.\" He \"is forbearing toward you, not wishing that any should perish.\" His commandment is \"that you love one another; even as I have loved you, that you also love one another.\" This commandment summarizes all the others and expresses his entire will. - 2842 (in 'as we forgive those who trespass against us') - This \"as\" is not unique in Jesus' teaching: \"You, therefore, must be perfect, as your heavenly Father is perfect\"; \"Be merciful, even as your Father is merciful\"; \"A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another. It is impossible to keep the Lord's commandment by imitating the divine model from outside; there has to be a vital participation, coming from the depths of the heart, in the holiness and the mercy and the love of our God. Only the Spirit by whom we live can make \"ours\" the same mind that was in Christ Jesus. Then the unity of forgiveness becomes possible and we find ourselves \"forgiving one another, as God in Christ forgave\" us.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 752744,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4aEa7dgyxjVUlRBrArj0ek"
    },
    "href": "https://api.spotify.com/v1/episodes/4aEa7dgyxjVUlRBrArj0ek",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 13: 31-33a, 34-35 - &#39;In the Son of Man, God has been glorified.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 782 (in &#39;The Characteristics of the People of God&#39;) - The People of God is marked by characteristics that clearly distinguish it from all other religious, ethnic, political, or cultural groups found in history...Its law is the new commandment to love as Christ loved us. This is the new law of the Holy Spirit (abbreviated).</p><br/><p>- 1823 (in &#39;Charity&#39;) - Jesus makes charity the new commandment. By loving his own &#34;to the end,&#34; he makes manifest the Father&#39;s love which he receives. By loving one another, the disciples imitate the love of Jesus which they themselves receive. Whence Jesus says: &#34;As the Father has loved me, so have I loved you; abide in my love.&#34; and again: &#34;This is my commandment, that you love one another as I have loved you.&#34;</p><br/><p>- 2822 (in &#39;Thy will be done on earth as it is in Heaven&#39;) - Our Father &#34;desires all men to be saved and to come to the knowledge of the truth.&#34; He &#34;is forbearing toward you, not wishing that any should perish.&#34; His commandment is &#34;that you love one another; even as I have loved you, that you also love one another.&#34; This commandment summarizes all the others and expresses his entire will.</p><br/><p>- 2842 (in &#39;as we forgive those who trespass against us&#39;) - This &#34;as&#34; is not unique in Jesus&#39; teaching: &#34;You, therefore, must be perfect, as your heavenly Father is perfect&#34;; &#34;Be merciful, even as your Father is merciful&#34;; &#34;A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another. It is impossible to keep the Lord&#39;s commandment by imitating the divine model from outside; there has to be a vital participation, coming from the depths of the heart, in the holiness and the mercy and the love of our God. Only the Spirit by whom we live can make &#34;ours&#34; the same mind that was in Christ Jesus. Then the unity of forgiveness becomes possible and we find ourselves &#34;forgiving one another, as God in Christ forgave&#34; us.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4aEa7dgyxjVUlRBrArj0ek",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "5th Sunday of Easter (Year C) - John 13: 31-35",
    "release_date": "2022-05-14",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4aEa7dgyxjVUlRBrArj0ek"
}