{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/462b7PWdyhKTpnosaMMGIg/clip_607800_678300.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 7: 17-37 - 'You have learnt how it was said to our ancestors, but I say this to you.'  Catechism of the Catholic Church Paragraphs: - 577 (in 'Jesus and the Law') - At the beginning of the Sermon on the Mount Jesus issued a solemn warning in which he presented God’s law, given on Sinai during the first covenant, in light of the grace of the New Covenant: \"Do not think that I have come to abolish the law or the prophets: I have come not to abolish but to fulfill. For truly I tell you, until heaven and earth pass away, not one letter, not one stroke of a letter, will pass from the law, until all is accomplished. Therefore, whoever breaks one of the least of these commandments, and teaches others to do the same, will be called least in the kingdom of heaven; but whoever does them and teaches them will be called great in the kingdom of heaven.\" - 592 (in 'Jesus and Israel's Faith') - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf. Mt5:17-19) with such perfection (cf. Jn8:46) that he revealed its ultimate meaning (cf.Mt5:33) and redeemed the transgressions against it (cf. Heb 9:15). - 1967 (in 'The Law of the Gospel') - The Law of the Gospel “fulfills,” refines, surpasses, and leads the Old Law to its perfection. In the Beatitudes, the New Law fulfills the divine promises by elevating and orienting them toward the “kingdom of heaven.” It is addressed to those open to accepting this new hope with faith—the poor, the humble, the afflicted, the pure of heart, those persecuted on account of Christ— and so marks out the surprising ways of the Kingdom. - 2054 (in 'Teacher, what must I do...') - Jesus acknowledged the Ten Commandments, but he also showed the power of the Spirit at work in their letter. He preached a “righteousness [which] exceeds that of the scribes and Pharisees” as well as that of the Gentiles. He unfolded all the demands of the Commandments. “You have heard that it was said to the men of old, ‘You shall not kill.’ . . . But I say to you that every one who is angry with his brother shall be liable to judgment.” - 2262 (in 'Respect for Human Life') - In the Sermon on the Mount, the Lord recalls the commandment, “You shall not kill,” and adds to it the proscription of anger, hatred, and vengeance. Going further, Christ asks his disciples to turn the other cheek, to love their enemies (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 735283,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4bhK2GzwGDzfWF5C1ogmzY"
    },
    "href": "https://api.spotify.com/v1/episodes/4bhK2GzwGDzfWF5C1ogmzY",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 7: 17-37 - &#39;You have learnt how it was said to our ancestors, but I say this to you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 577 (in &#39;Jesus and the Law&#39;) - At the beginning of the Sermon on the Mount Jesus issued a solemn warning in which he presented God’s law, given on Sinai during the first covenant, in light of the grace of the New Covenant: &#34;Do not think that I have come to abolish the law or the prophets: I have come not to abolish but to fulfill. For truly I tell you, until heaven and earth pass away, not one letter, not one stroke of a letter, will pass from the law, until all is accomplished. Therefore, whoever breaks one of the least of these commandments, and teaches others to do the same, will be called least in the kingdom of heaven; but whoever does them and teaches them will be called great in the kingdom of heaven.&#34;</p><br/><p>- 592 (in &#39;Jesus and Israel&#39;s Faith&#39;) - Jesus did not abolish the Law of Sinai, but rather fulfilled it (cf. Mt5:17-19) with such perfection (cf. Jn8:46) that he revealed its ultimate meaning (cf.Mt5:33) and redeemed the transgressions against it (cf. Heb 9:15).</p><br/><p>- 1967 (in &#39;The Law of the Gospel&#39;) - The Law of the Gospel “fulfills,” refines, surpasses, and leads the Old Law to its perfection. In the Beatitudes, the New Law fulfills the divine promises by elevating and orienting them toward the “kingdom of heaven.” It is addressed to those open to accepting this new hope with faith—the poor, the humble, the afflicted, the pure of heart, those persecuted on account of Christ— and so marks out the surprising ways of the Kingdom.</p><br/><p>- 2054 (in &#39;Teacher, what must I do...&#39;) - Jesus acknowledged the Ten Commandments, but he also showed the power of the Spirit at work in their letter. He preached a “righteousness [which] exceeds that of the scribes and Pharisees” as well as that of the Gentiles. He unfolded all the demands of the Commandments. “You have heard that it was said to the men of old, ‘You shall not kill.’ . . . But I say to you that every one who is angry with his brother shall be liable to judgment.”</p><br/><p>- 2262 (in &#39;Respect for Human Life&#39;) - In the Sermon on the Mount, the Lord recalls the commandment, “You shall not kill,” and adds to it the proscription of anger, hatred, and vengeance. Going further, Christ asks his disciples to turn the other cheek, to love their enemies (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4bhK2GzwGDzfWF5C1ogmzY",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "6th Sunday in Ordinary Time (Year A) - Matt 5: 17-37",
    "release_date": "2023-02-11",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4bhK2GzwGDzfWF5C1ogmzY"
}