{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1TFBhofAubYAki6NPfhuFy/clip_334587_394587.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Mark 10: 32-45 - 'The Son of Man came to give his life as a ransom for many.'  Catechism of the Catholic Church Paragraphs: - 557 (in 'Jesus' ascent to Jerusalem') - \"When the days drew near for him to be taken up [Jesus] set his face to go to Jerusalem.\" By this decision he indicated that he was going up to Jerusalem prepared to die there. Three times he had announced his Passion and Resurrection; now, heading toward Jerusalem, Jesus says: \"It cannot be that a prophet should perish away from Jerusalem.\" - 474 (in 'Christ's Soul and his human knowledge') - By its union to the divine wisdom in the person of the Word incarnate, Christ enjoyed in his human knowledge the fullness of understanding of the eternal plans he had come to reveal (abbreviated). - 649 (in 'The Resurrection - A Work of the Holy Trinity') - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise (abbreviated). - 536 (in 'The Baptism of Jesus') - The baptism of Jesus is on his part the acceptance and inauguration of his mission as God's suffering Servant. He allows himself to be numbered among sinners; he is already \"the Lamb of God, who takes away the sin of the world\". Already he is anticipating the \"baptism\" of his bloody death. Already he is coming to \"fulfil all righteousness\", that is, he is submitting himself entirely to his Father's will: out of love he consents to this baptism of death for the remission of our sins (abbreviated). - 1225 (in 'Christ's Baptism') - In his Passover Christ opened to all men the fountain of Baptism. He had already spoken of his Passion, which he was about to suffer in Jerusalem, as a \"Baptism\" with which he had to be baptized. The blood and water that flowed from the pierced side of the      crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible \"to be born of water and the      Spirit\" in order to enter the Kingdom of God. 'See where you are baptized, see where Baptism comes from, if not from the cross of Christ, from his death. There is the whole mystery: he died for you. In him you are redeemed, in him you are saved.' - 618 (in 'Our Participation in Christ's sacrifice') - He calls his disciples to \"take up [their] cross and follow (him)\",for \"Christ also suffered for (us), leaving (us) an example so that (we) should follow in his steps\" (abbreviated). - 1551 (in 'In the person of Christ the Head') - This priesthood is ministerial. \"That office . . . which the Lord committed to the pastors of his people, is in the strict sense of the term a service.\" It is entirely related to Christ and to men. It depends entirely on Christ and on his unique priesthood; it has been instituted for the good of men and the communion of the Church. the sacrament of Holy Orders communicates a \"sacred power\" which is none other than that of Christ. the exercise of this authority must therefore be measured against the model of Christ, who by love made himself the least and the servant of all (abbreviated). - 1570 (in 'The Ordination of deacons - 'in order to serve') - Deacons share in Christ's mission and grace in a special way. The sacrament of Holy Orders marks them with an imprint (“character\") which cannot be removed and which configures them to Christ, who made himself the \"deacon\" or servant of all (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1692339,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4cdBgdK4rWbSe4oF2SixJA"
    },
    "href": "https://api.spotify.com/v1/episodes/4cdBgdK4rWbSe4oF2SixJA",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Mark 10: 32-45 - &#39;The Son of Man came to give his life as a ransom for many.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 557 (in &#39;Jesus&#39; ascent to Jerusalem&#39;) - &#34;When the days drew near for him to be taken up [Jesus] set his face to go to Jerusalem.&#34; By this decision he indicated that he was going up to Jerusalem prepared to die there. Three times he had announced his Passion and Resurrection; now, heading toward Jerusalem, Jesus says: &#34;It cannot be that a prophet should perish away from Jerusalem.&#34;</p><br/><p>- 474 (in &#39;Christ&#39;s Soul and his human knowledge&#39;) - By its union to the divine wisdom in the person of the Word incarnate, Christ enjoyed in his human knowledge the fullness of understanding of the eternal plans he had come to reveal (abbreviated).</p><br/><p>- 649 (in &#39;The Resurrection - A Work of the Holy Trinity&#39;) - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise (abbreviated).</p><br/><p>- 536 (in &#39;The Baptism of Jesus&#39;) - The baptism of Jesus is on his part the acceptance and inauguration of his mission as God&#39;s suffering Servant. He allows himself to be numbered among sinners; he is already &#34;the Lamb of God, who takes away the sin of the world&#34;. Already he is anticipating the &#34;baptism&#34; of his bloody death. Already he is coming to &#34;fulfil all righteousness&#34;, that is, he is submitting himself entirely to his Father&#39;s will: out of love he consents to this baptism of death for the remission of our sins (abbreviated).</p><br/><p>- 1225 (in &#39;Christ&#39;s Baptism&#39;) - In his Passover Christ opened to all men the fountain of Baptism. He had already spoken of his Passion, which he was about to suffer in Jerusalem, as a &#34;Baptism&#34; with which he had to be baptized. The blood and water that flowed from the pierced side of the      crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible &#34;to be born of water and the      Spirit&#34; in order to enter the Kingdom of God.</p><br/><p>&#39;See where you are baptized, see where Baptism comes from, if not from the cross of Christ, from his death. There is the whole mystery: he died for you. In him you are redeemed, in him you are saved.&#39;</p><br/><p>- 618 (in &#39;Our Participation in Christ&#39;s sacrifice&#39;) - He calls his disciples to &#34;take up [their] cross and follow (him)&#34;,for &#34;Christ also suffered for (us), leaving (us) an example so that (we) should follow in his steps&#34; (abbreviated).</p><br/><p>- 1551 (in &#39;In the person of Christ the Head&#39;) - This priesthood is ministerial. &#34;That office . . . which the Lord committed to the pastors of his people, is in the strict sense of the term a service.&#34; It is entirely related to Christ and to men. It depends entirely on Christ and on his unique priesthood; it has been instituted for the good of men and the communion of the Church. the sacrament of Holy Orders communicates a &#34;sacred power&#34; which is none other than that of Christ. the exercise of this authority must therefore be measured against the model of Christ, who by love made himself the least and the servant of all (abbreviated).</p><br/><p>- 1570 (in &#39;The Ordination of deacons - &#39;in order to serve&#39;) - Deacons share in Christ&#39;s mission and grace in a special way. The sacrament of Holy Orders marks them with an imprint (“character&#34;) which cannot be removed and which configures them to Christ, who made himself the &#34;deacon&#34; or servant of all (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4cdBgdK4rWbSe4oF2SixJA",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 8 in Ordinary Time - Mark 10: 32-45",
    "release_date": "2023-05-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4cdBgdK4rWbSe4oF2SixJA"
}