{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0jbZlc7aL02asCj1omLZmq/clip_397666_457666.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 12: 28-34 - 'You are not far from the kingdom of God.'  Catechism of the Catholic Church Paragraphs: - 575 (in 'Jesus and Israel') - To be sure, Christ's relations with the Pharisees were not exclusively polemical. Some Pharisees warn him of the danger he was courting; Jesus praises some of them, like the scribe of Mark 12:34, and dines several times at their homes (abbreviated). - 202 (in 'I Believe in One God') - Jesus himself affirms that God is \"the one Lord\" whom you must love \"with all your heart, and with all your soul, and with all your mind, and with all your strength\". - 2196 (in 'You shall love your neighbour as yourself') - In response to the question about the first of the commandments, Jesus says: \"The first is, 'Hear, O Israel: the Lord our God, the Lord is one; and you shall love the Lord your God with all your heart, and with all your soul, and with all your mind, and with all your strength.' the second is this, 'You shall love your neighbor as yourself.' There is no other commandment greater than these.\" The apostle St. Paul reminds us of this: \"He who loves his neighbor has fulfilled the law. the commandments, 'You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,' and any other commandment, are summed up in this sentence, 'You shall love your neighbor as yourself.' Love does no wrong to a neighbor; therefore love is the fulfilling of the law.\" - 129 (in 'The Unity of the Old and New Testaments') - Christians therefore read the Old Testament in the light of Christ crucified and risen. Such typological reading discloses the inexhaustible content of the Old Testament; but it must not make us forget that the Old Testament retains its own intrinsic value as Revelation reaffirmed by our Lord himself. Besides, the New Testament has to be read in the light of the Old. Early Christian catechesis made constant use of the Old Testament. As an old saying put it, the New Testament lies hidden in the Old and the Old Testament is unveiled in the New.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 953968,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4eN6DEfkWL6lNMf7olLHXF"
    },
    "href": "https://api.spotify.com/v1/episodes/4eN6DEfkWL6lNMf7olLHXF",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 12: 28-34 - &#39;You are not far from the kingdom of God.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 575 (in &#39;Jesus and Israel&#39;) - To be sure, Christ&#39;s relations with the Pharisees were not exclusively polemical. Some Pharisees warn him of the danger he was courting; Jesus praises some of them, like the scribe of Mark 12:34, and dines several times at their homes (abbreviated).</p><br/><p>- 202 (in &#39;I Believe in One God&#39;) - Jesus himself affirms that God is &#34;the one Lord&#34; whom you must love &#34;with all your heart, and with all your soul, and with all your mind, and with all your strength&#34;.</p><br/><p>- 2196 (in &#39;You shall love your neighbour as yourself&#39;) - In response to the question about the first of the commandments, Jesus says: &#34;The first is, &#39;Hear, O Israel: the Lord our God, the Lord is one; and you shall love the Lord your God with all your heart, and with all your soul, and with all your mind, and with all your strength.&#39; the second is this, &#39;You shall love your neighbor as yourself.&#39; There is no other commandment greater than these.&#34; The apostle St. Paul reminds us of this: &#34;He who loves his neighbor has fulfilled the law. the commandments, &#39;You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,&#39; and any other commandment, are summed up in this sentence, &#39;You shall love your neighbor as yourself.&#39; Love does no wrong to a neighbor; therefore love is the fulfilling of the law.&#34;</p><br/><p>- 129 (in &#39;The Unity of the Old and New Testaments&#39;) - Christians therefore read the Old Testament in the light of Christ crucified and risen. Such typological reading discloses the inexhaustible content of the Old Testament; but it must not make us forget that the Old Testament retains its own intrinsic value as Revelation reaffirmed by our Lord himself. Besides, the New Testament has to be read in the light of the Old. Early Christian catechesis made constant use of the Old Testament. As an old saying put it, the New Testament lies hidden in the Old and the Old Testament is unveiled in the New.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4eN6DEfkWL6lNMf7olLHXF",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "31st Sunday in Ordinary Time (Year B) - Mark 12: 28-34",
    "release_date": "2021-10-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4eN6DEfkWL6lNMf7olLHXF"
}