{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6SzQDBTQMUijZjWJDnIseT/clip_611477_671477.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 18: 33b-37 - 'Yes, I am a king.'  Catechism of the Catholic Church Paragraphs: - 549 (in 'The Signs of the Kingdom of God') - By freeing some individuals from the earthly evils of hunger, injustice, illness and death, Jesus performed messianic signs. Nevertheless he did not come to abolish all evils here below, but to free men from the gravest slavery, sin, which thwarts them in their vocation as God's sons and causes all forms of human bondage. - 600 (in 'Jesus handed over the according to the definitive plan of God') - To God, all moments of time are present in their immediacy. When therefore he establishes his eternal plan of \"predestination\", he includes in it each person's free response to his grace: \"In this city, in fact, both Herod and Pontius Pilate, with the Gentiles and the peoples of Israel, gathered together against your holy servant Jesus, whom you anointed, to do whatever your hand and your plan had predestined to take place.\" For the sake of accomplishing his plan of salvation, God permitted the acts that flowed from their blindness. - 217 (in 'God is Truth') - God is also truthful when he reveals himself - the teaching that comes from God is \"true instruction\". When he sends his Son into the world it will be \"to bear witness to the truth\" (abbreviated). - 559 (in 'Jesus' messianic entrance into Jerusalem') - Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth (abbreviated). - 2471 (in 'To Bear Witness to the Truth') - Before Pilate, Christ proclaims that he \"has come into the world, to bear witness to the truth.\" The Christian is not to \"be ashamed then of testifying to our Lord.\" In situations that require witness to the faith, the Christian must profess it without equivocation, after the example of St. Paul before his judges. We must keep \"a clear conscience toward God and toward men.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1646016,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4I9IDD52pDzOCvvpN3Hw4s"
    },
    "href": "https://api.spotify.com/v1/episodes/4I9IDD52pDzOCvvpN3Hw4s",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 18: 33b-37 - &#39;Yes, I am a king.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 549 (in &#39;The Signs of the Kingdom of God&#39;) - By freeing some individuals from the earthly evils of hunger, injustice, illness and death, Jesus performed messianic signs. Nevertheless he did not come to abolish all evils here below, but to free men from the gravest slavery, sin, which thwarts them in their vocation as God&#39;s sons and causes all forms of human bondage.</p><br/><p>- 600 (in &#39;Jesus handed over the according to the definitive plan of God&#39;) - To God, all moments of time are present in their immediacy. When therefore he establishes his eternal plan of &#34;predestination&#34;, he includes in it each person&#39;s free response to his grace: &#34;In this city, in fact, both Herod and Pontius Pilate, with the Gentiles and the peoples of Israel, gathered together against your holy servant Jesus, whom you anointed, to do whatever your hand and your plan had predestined to take place.&#34; For the sake of accomplishing his plan of salvation, God permitted the acts that flowed from their blindness.</p><br/><p>- 217 (in &#39;God is Truth&#39;) - God is also truthful when he reveals himself - the teaching that comes from God is &#34;true instruction&#34;. When he sends his Son into the world it will be &#34;to bear witness to the truth&#34; (abbreviated).</p><br/><p>- 559 (in &#39;Jesus&#39; messianic entrance into Jerusalem&#39;) - Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth (abbreviated).</p><br/><p>- 2471 (in &#39;To Bear Witness to the Truth&#39;) - Before Pilate, Christ proclaims that he &#34;has come into the world, to bear witness to the truth.&#34; The Christian is not to &#34;be ashamed then of testifying to our Lord.&#34; In situations that require witness to the faith, the Christian must profess it without equivocation, after the example of St. Paul before his judges. We must keep &#34;a clear conscience toward God and toward men.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4I9IDD52pDzOCvvpN3Hw4s",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of Christ the King (Year B) - John 18: 33-38",
    "release_date": "2021-11-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4I9IDD52pDzOCvvpN3Hw4s"
}