{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1FVWtnDIv8q9xAUfRV9O6E/clip_1092900_1141500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 6: 60-69 - 'Who shall we go to? You are the Holy One of God.'  Catechism of the Catholic Church Paragraphs: - 1336 (in 'The Signs of Bread and Wine') - The first announcement of the Eucharist divided the disciples, just as the announcement of the Passion scandalized them: \"This is a hard saying; who can listen to it?\" The Eucharist and the Cross are stumbling blocks. It is the same mystery and it never ceases to be an occasion of division. \"Will you also go away?\": The Lord's question echoes through the ages, as a loving invitation to discover that only he has \"the words of eternal life\" and that to receive in faith the gift of his Eucharist is to receive the Lord himself. - 473 (in 'Christ's Soul and his human knowledge') - But at the same time, this truly human knowledge of God's Son expressed the divine life of his person. \"The human nature of God's Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.\" Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father. The Son in his human knowledge also showed the divine penetration he had into the secret thoughts of human hearts. - 728 (in 'Christ Jesus') - Jesus does not reveal the Holy Spirit fully, until he himself has been glorified through his Death and Resurrection. Nevertheless, little by little he alludes to him even in his teaching of the multitudes, as when he reveals that his own flesh will be food for the life of the world (abbreviated). - 2766 (in 'the Lord's Prayer') - But Jesus does not give us a formula to repeat mechanically. As in every vocal prayer, it is through the Word of God that the Holy Spirit teaches the children of God to pray to their Father. Jesus not only gives us the words of our filial prayer; at the same time he gives us the Spirit by whom these words become in us \"spirit and life\" (abbreviated). - 438 (in 'Christ') - Jesus' messianic consecration reveals his divine mission, \"for the name 'Christ' implies 'he who anointed', 'he who was anointed' and 'the very anointing with which he was anointed'. The one who anointed is the Father, the one who was anointed is the Son, and he was anointed with the Spirit who is the anointing.'\" His eternal messianic consecration was revealed during the time of his earthly life at the moment of his baptism by John, when \"God anointed Jesus of Nazareth with the Holy Spirit and with power\", \"that he might be revealed to Israel\" as its Messiah. His works and words will manifest him as \"the Holy One of God\".  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1217770,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4IiyCieoiNZ55qiD9mwo9q"
    },
    "href": "https://api.spotify.com/v1/episodes/4IiyCieoiNZ55qiD9mwo9q",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 6: 60-69 - &#39;Who shall we go to? You are the Holy One of God.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1336 (in &#39;The Signs of Bread and Wine&#39;) - The first announcement of the Eucharist divided the disciples, just as the announcement of the Passion scandalized them: &#34;This is a hard saying; who can listen to it?&#34; The Eucharist and the Cross are stumbling blocks. It is the same mystery and it never ceases to be an occasion of division. &#34;Will you also go away?&#34;: The Lord&#39;s question echoes through the ages, as a loving invitation to discover that only he has &#34;the words of eternal life&#34; and that to receive in faith the gift of his Eucharist is to receive the Lord himself.</p><br/><p>- 473 (in &#39;Christ&#39;s Soul and his human knowledge&#39;) - But at the same time, this truly human knowledge of God&#39;s Son expressed the divine life of his person. &#34;The human nature of God&#39;s Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.&#34; Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father. The Son in his human knowledge also showed the divine penetration he had into the secret thoughts of human hearts.</p><br/><p>- 728 (in &#39;Christ Jesus&#39;) - Jesus does not reveal the Holy Spirit fully, until he himself has been glorified through his Death and Resurrection. Nevertheless, little by little he alludes to him even in his teaching of the multitudes, as when he reveals that his own flesh will be food for the life of the world (abbreviated).</p><br/><p>- 2766 (in &#39;the Lord&#39;s Prayer&#39;) - But Jesus does not give us a formula to repeat mechanically. As in every vocal prayer, it is through the Word of God that the Holy Spirit teaches the children of God to pray to their Father. Jesus not only gives us the words of our filial prayer; at the same time he gives us the Spirit by whom these words become in us &#34;spirit and life&#34; (abbreviated).</p><br/><p>- 438 (in &#39;Christ&#39;) - Jesus&#39; messianic consecration reveals his divine mission, &#34;for the name &#39;Christ&#39; implies &#39;he who anointed&#39;, &#39;he who was anointed&#39; and &#39;the very anointing with which he was anointed&#39;. The one who anointed is the Father, the one who was anointed is the Son, and he was anointed with the Spirit who is the anointing.&#39;&#34; His eternal messianic consecration was revealed during the time of his earthly life at the moment of his baptism by John, when &#34;God anointed Jesus of Nazareth with the Holy Spirit and with power&#34;, &#34;that he might be revealed to Israel&#34; as its Messiah. His works and words will manifest him as &#34;the Holy One of God&#34;.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4IiyCieoiNZ55qiD9mwo9q",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 3 of Eastertide - John 6: 60-69",
    "release_date": "2023-04-28",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4IiyCieoiNZ55qiD9mwo9q"
}