{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/2cVWhBELOL2pWOS6BJwUDe/clip_648900_705900.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 3: 16-18 - 'God sent his Son into the world so that through him the world might be saved.'  Catechism of the Catholic Church Paragraphs: - 219 (in 'God is love') - God's love for Israel is compared to a father's love for his son. His love for his people is stronger than a mother's for her children. God loves his people more than a bridegroom his beloved; his love will be victorious over even the worst infidelities and will extend to his most precious gift: \"God so loved the world that he gave his only Son.\" - 444 (in 'The Only Son of God') - Jesus calls himself the \"only Son of God\", and by this title affirms his eternal pre-existence. He asks for faith in \"the name of the only Son of God\" (abbreviated). - 458 (in 'Why did the Word become Flesh'?) - The Word became flesh so that thus we might know God's love: \"In this the love of God was made manifest among us, that God sent his only Son into the world, so that we might live through him.\" \"For God so loved the world that he gave his only Son, that whoever believes in him should not perish but have eternal life.\" - 678-679 (in 'To Judge the Living and the Dead') - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching. Then will the conduct of each one and the secrets of hearts be brought to light. Then will the culpable unbelief that counted the offer of God's grace as nothing be condemned...Christ is Lord of eternal life. Full right to pass definitive judgement on the works and hearts of men belongs to him as redeemer of the world. He \"acquired\" this right by his cross. the Father has given \"all judgement to the Son\". Yet the Son did not come to judge, but to save and to give the life he has in himself. By rejecting grace in this life, one already judges oneself, receives according to one's works, and can even condemn oneself for all eternity by rejecting the Spirit of love (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 947722,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4mmxa5sDtAvTj0pT3hIcQo"
    },
    "href": "https://api.spotify.com/v1/episodes/4mmxa5sDtAvTj0pT3hIcQo",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 3: 16-18 - &#39;God sent his Son into the world so that through him the world might be saved.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 219 (in &#39;God is love&#39;) - God&#39;s love for Israel is compared to a father&#39;s love for his son. His love for his people is stronger than a mother&#39;s for her children. God loves his people more than a bridegroom his beloved; his love will be victorious over even the worst infidelities and will extend to his most precious gift: &#34;God so loved the world that he gave his only Son.&#34;</p><br/><p>- 444 (in &#39;The Only Son of God&#39;) - Jesus calls himself the &#34;only Son of God&#34;, and by this title affirms his eternal pre-existence. He asks for faith in &#34;the name of the only Son of God&#34; (abbreviated).</p><br/><p>- 458 (in &#39;Why did the Word become Flesh&#39;?) - The Word became flesh so that thus we might know God&#39;s love: &#34;In this the love of God was made manifest among us, that God sent his only Son into the world, so that we might live through him.&#34; &#34;For God so loved the world that he gave his only Son, that whoever believes in him should not perish but have eternal life.&#34;</p><br/><p>- 678-679 (in &#39;To Judge the Living and the Dead&#39;) - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching. Then will the conduct of each one and the secrets of hearts be brought to light. Then will the culpable unbelief that counted the offer of God&#39;s grace as nothing be condemned...Christ is Lord of eternal life. Full right to pass definitive judgement on the works and hearts of men belongs to him as redeemer of the world. He &#34;acquired&#34; this right by his cross. the Father has given &#34;all judgement to the Son&#34;. Yet the Son did not come to judge, but to save and to give the life he has in himself. By rejecting grace in this life, one already judges oneself, receives according to one&#39;s works, and can even condemn oneself for all eternity by rejecting the Spirit of love (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4mmxa5sDtAvTj0pT3hIcQo",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of the Most Holy Trinity (Year A) - John 3: 16-18",
    "release_date": "2023-06-03",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4mmxa5sDtAvTj0pT3hIcQo"
}