{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/352EgjkfAiXrWY8vcTU3Dd/clip_687800_737000.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 14: 23-29 - 'A peace the world cannot give is my gift to you.'  Catechism of the Catholic Church Paragraphs: - 647 (in 'The Resurrection as a transcendent event') - Although the Resurrection was an historical event that could be verified by the sign of the empty tomb and by the reality of the apostles' encounters with the risen Christ, still it remains at the very heart of the mystery of faith as something that transcends and surpasses history. This is why the risen Christ does not reveal himself to the world, but to his disciples, \"to those who came up with him from Galilee to Jerusalem, who are now his witnesses to the people\" (abbreviated). - 2615 (in 'Jesus teaches us how to pray') - Even more, what the Father gives us when our prayer is united with that of Jesus is \"another Counselor, to be with you for ever, even the Spirit of truth.\" This new dimension of prayer and of its circumstances is displayed throughout the farewell discourse. In the Holy Spirit, Christian prayer is a communion of love with the Father, not only through Christ but also in him: \"Hitherto you have asked nothing in my name; ask, and you will receive, that your joy may be full\" (abbreviated) - 260 (in 'The Divine works and the Trinitarian Missions') - The ultimate end of the whole divine economy is the entry of God's creatures into the perfect unity of the Blessed Trinity. But even now we are called to be a dwelling for the Most Holy Trinity: \"If a man loves me\", says the Lord, \"he will keep my word, and my Father will love him, and we will come to him, and make our home with him.\" - 243 (in 'The Father and the Son revealed by the spirit') - Before his Passover, Jesus announced the sending of \"another Paraclete\" (Advocate), the Holy Spirit. At work since creation, having previously \"spoken through the prophets\", the Spirit will now be with and in the disciples, to teach them and guide them \"into all the truth\". The Holy Spirit is thus revealed as another divine person with Jesus and the Father. - 263 (in 'The Holy Trinity in the teaching of the faith') - The mission of the Holy Spirit, sent by the Father in the name of the Son (Jn 14:26) and by the Son \"from the Father\" (Jn 15:26), reveals that, with them, the Spirit is one and the same God. \"With the Father and the Son he is worshipped and glorified\" (Nicene Creed). - 692 (in 'Titles of the Holy Spirit') - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the \"Paraclete,\" literally, \"he who is called to one's side,\" advocatus. \"Paraclete\" is commonly translated by \"consoler,\" and Jesus is the first consoler (abbreviated). - 729 (in 'Christ Jesus') - The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus' prayer; he will be sent by the Father in Jesus' name; and Jesus will send him from the Father's side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment (abbreviated). - 1099 (in 'The Holy Spirit recalls the mystery of Christ') - Primarily in the Eucharist, and by analogy in the other sacraments, the liturgy is the memorial of the mystery of salvation. the Holy Spirit is the Church's living memory (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1602780,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4O2irmKpkhpKYj0hoA6hak"
    },
    "href": "https://api.spotify.com/v1/episodes/4O2irmKpkhpKYj0hoA6hak",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 14: 23-29 - &#39;A peace the world cannot give is my gift to you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 647 (in &#39;The Resurrection as a transcendent event&#39;) - Although the Resurrection was an historical event that could be verified by the sign of the empty tomb and by the reality of the apostles&#39; encounters with the risen Christ, still it remains at the very heart of the mystery of faith as something that transcends and surpasses history. This is why the risen Christ does not reveal himself to the world, but to his disciples, &#34;to those who came up with him from Galilee to Jerusalem, who are now his witnesses to the people&#34; (abbreviated).</p><br/><p>- 2615 (in &#39;Jesus teaches us how to pray&#39;) - Even more, what the Father gives us when our prayer is united with that of Jesus is &#34;another Counselor, to be with you for ever, even the Spirit of truth.&#34; This new dimension of prayer and of its circumstances is displayed throughout the farewell discourse. In the Holy Spirit, Christian prayer is a communion of love with the Father, not only through Christ but also in him: &#34;Hitherto you have asked nothing in my name; ask, and you will receive, that your joy may be full&#34; (abbreviated)</p><br/><p>- 260 (in &#39;The Divine works and the Trinitarian Missions&#39;) - The ultimate end of the whole divine economy is the entry of God&#39;s creatures into the perfect unity of the Blessed Trinity. But even now we are called to be a dwelling for the Most Holy Trinity: &#34;If a man loves me&#34;, says the Lord, &#34;he will keep my word, and my Father will love him, and we will come to him, and make our home with him.&#34;</p><br/><p>- 243 (in &#39;The Father and the Son revealed by the spirit&#39;) - Before his Passover, Jesus announced the sending of &#34;another Paraclete&#34; (Advocate), the Holy Spirit. At work since creation, having previously &#34;spoken through the prophets&#34;, the Spirit will now be with and in the disciples, to teach them and guide them &#34;into all the truth&#34;. The Holy Spirit is thus revealed as another divine person with Jesus and the Father.</p><br/><p>- 263 (in &#39;The Holy Trinity in the teaching of the faith&#39;) - The mission of the Holy Spirit, sent by the Father in the name of the Son (Jn 14:26) and by the Son &#34;from the Father&#34; (Jn 15:26), reveals that, with them, the Spirit is one and the same God. &#34;With the Father and the Son he is worshipped and glorified&#34; (Nicene Creed).</p><br/><p>- 692 (in &#39;Titles of the Holy Spirit&#39;) - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the &#34;Paraclete,&#34; literally, &#34;he who is called to one&#39;s side,&#34; advocatus. &#34;Paraclete&#34; is commonly translated by &#34;consoler,&#34; and Jesus is the first consoler (abbreviated).</p><br/><p>- 729 (in &#39;Christ Jesus&#39;) - The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus&#39; prayer; he will be sent by the Father in Jesus&#39; name; and Jesus will send him from the Father&#39;s side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment (abbreviated).</p><br/><p>- 1099 (in &#39;The Holy Spirit recalls the mystery of Christ&#39;) - Primarily in the Eucharist, and by analogy in the other sacraments, the liturgy is the memorial of the mystery of salvation. the Holy Spirit is the Church&#39;s living memory (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4O2irmKpkhpKYj0hoA6hak",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "6th Sunday of Easter (Year C) - John 14: 23-29",
    "release_date": "2022-05-21",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4O2irmKpkhpKYj0hoA6hak"
}