{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/440rXMcct2AUpbeErTUgt1/clip_294552_354552.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Mark 13: 33-37 - 'If he comes unexpectedly, he must not find you asleep.'  Catechism of the Catholic Church Paragraphs: - 672 (in 'until all things are subjected to him') - According to the Lord, the present time is the time of the Spirit and of witness, but also a time still marked by \"distress\" and the trial of evil which does not spare the Church and ushers in the struggles of the last days. It is a time of waiting and watching (abbreviated). - 2849 (in 'And lead us not into Temptation') - Such a battle and such a victory become possible only through prayer. It is by his prayer that Jesus vanquishes the tempter, both at the outset of his public mission and in the ultimate struggle of his agony. In this petition to our heavenly Father, Christ unites us to his battle and his agony. He urges us to vigilance of the heart in communion with his own. Vigilance is \"custody of the heart,\" and Jesus prayed for us to the Father: \"Keep them in your name.\" The Holy Spirit constantly seeks to awaken us to keep watch. Finally, this petition takes on all its dramatic meaning in relation to the last temptation of our earthly battle; it asks for final perseverance. \"Lo, I am coming like a thief! Blessed is he who is awake.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1146880,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4oCUgCuxZMJoSN4oUWLRnS"
    },
    "href": "https://api.spotify.com/v1/episodes/4oCUgCuxZMJoSN4oUWLRnS",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Mark 13: 33-37 - &#39;If he comes unexpectedly, he must not find you asleep.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 672 (in &#39;until all things are subjected to him&#39;) - According to the Lord, the present time is the time of the Spirit and of witness, but also a time still marked by &#34;distress&#34; and the trial of evil which does not spare the Church and ushers in the struggles of the last days. It is a time of waiting and watching (abbreviated).</p><br/><p>- 2849 (in &#39;And lead us not into Temptation&#39;) - Such a battle and such a victory become possible only through prayer. It is by his prayer that Jesus vanquishes the tempter, both at the outset of his public mission and in the ultimate struggle of his agony. In this petition to our heavenly Father, Christ unites us to his battle and his agony. He urges us to vigilance of the heart in communion with his own. Vigilance is &#34;custody of the heart,&#34; and Jesus prayed for us to the Father: &#34;Keep them in your name.&#34; The Holy Spirit constantly seeks to awaken us to keep watch. Finally, this petition takes on all its dramatic meaning in relation to the last temptation of our earthly battle; it asks for final perseverance. &#34;Lo, I am coming like a thief! Blessed is he who is awake.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4oCUgCuxZMJoSN4oUWLRnS",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "1st Sunday of Advent (Year B) - Mark 13: 33-37",
    "release_date": "2023-12-02",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4oCUgCuxZMJoSN4oUWLRnS"
}