{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6b9e1GIha4iaEXcnvNyAWM/clip_305018_365018.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 5: 17-30 - 'The dead will hear the voice of the Son of God, and all who hear it will live.'  Catechism of the Catholic Church Paragraphs: - 594 (in 'Jesus and Israel's faith in the One God and Saviour') - Jesus performed acts, such as pardoning sins, that manifested him to be the Saviour God himself (cf Jn 5:16-18). Certain Jews, who did not recognize God made man (cf Jn 1:14), saw in him only a man who made himself God (Jn 10:33), and judged him as a blasphemer. - 859 (in 'The Church is Apostolic') - Jesus unites them to the mission he received from the Father. As \"the Son can do nothing of his own accord,\" but receives everything from the Father who sent him, so those whom Jesus sends can do nothing apart from him, from whom they received both the mandate for their mission and the power to carry it out (abbreviated). - 679 (in 'To Judge the Living and the Dead') - Christ is Lord of eternal life. Full right to pass definitive judgement on the works and hearts of men belongs to him as redeemer of the world. He \"acquired\" this right by his cross. the Father has given \"all judgement to the Son\". Yet the Son did not come to judge, but to save and to give the life he has in himself. By rejecting grace in this life, one already judges oneself, receives according to one's works, and can even condemn oneself for all eternity by rejecting the Spirit of love. - 1470 (in 'The Effects of this Sacrament') - In this sacrament, the sinner, placing himself before the merciful judgment of God, anticipates in a certain way the judgment to which he will be subjected at the end of his earthly life. For it is now, in this life, that we are offered the choice between life and death, and it is only by the road of conversion that we can enter the Kingdom, from which one is excluded by grave sin. In converting to Christ through penance and faith, the sinner passes from death to life and \"does not come into judgment.\" - 635 (in 'Christ descended into Hell') - Christ went down into the depths of death so that \"the dead will hear the voice of the Son of God, and those who hear will live.\" Jesus, \"the Author of life\", by dying destroyed \"him who has the power of death, that is, the devil, and [delivered] all those who through fear of death were subject to lifelong bondage.\" Henceforth the risen Christ holds \"the keys of Death and Hades\", so that \"at the name of Jesus every knee should bow, in heaven and on earth and under the earth.\" - 1038 (in 'The Last Judgement') - The resurrection of all the dead, \"of both the just and the unjust,\" will precede the Last Judgment. This will be \"the hour when all who are in the tombs will hear [the Son of man's] voice and come forth, those who have done good, to the resurrection of life, and those who have done evil, to the resurrection of judgment\" (abbreviated). - 612 (in 'The Agony at Gethsemani') - Like ours, his human nature is destined for eternal life; but unlike ours, it is perfectly exempt from sin, the cause of death (abbreviated). - 998 (in 'How do the dead rise?') - Who will rise? All the dead will rise, \"those who have done good, to the resurrection of life, and those who have done evil, to the resurrection of judgment.\" - 574 (in 'Jesus and Israel') - 589 (in 'Jesus and Israel's faith in the One God and Saviour') - 1063 (in 'Amen') - 2824 (in 'Thy Will be done on earth as it is heaven')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1933502,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4pQvAdBd3OasCSe5VKWex3"
    },
    "href": "https://api.spotify.com/v1/episodes/4pQvAdBd3OasCSe5VKWex3",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 5: 17-30 - &#39;The dead will hear the voice of the Son of God, and all who hear it will live.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 594 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;) - Jesus performed acts, such as pardoning sins, that manifested him to be the Saviour God himself (cf Jn 5:16-18). Certain Jews, who did not recognize God made man (cf Jn 1:14), saw in him only a man who made himself God (Jn 10:33), and judged him as a blasphemer.</p><br/><p>- 859 (in &#39;The Church is Apostolic&#39;) - Jesus unites them to the mission he received from the Father. As &#34;the Son can do nothing of his own accord,&#34; but receives everything from the Father who sent him, so those whom Jesus sends can do nothing apart from him, from whom they received both the mandate for their mission and the power to carry it out (abbreviated).</p><br/><p>- 679 (in &#39;To Judge the Living and the Dead&#39;) - Christ is Lord of eternal life. Full right to pass definitive judgement on the works and hearts of men belongs to him as redeemer of the world. He &#34;acquired&#34; this right by his cross. the Father has given &#34;all judgement to the Son&#34;. Yet the Son did not come to judge, but to save and to give the life he has in himself. By rejecting grace in this life, one already judges oneself, receives according to one&#39;s works, and can even condemn oneself for all eternity by rejecting the Spirit of love.</p><br/><p>- 1470 (in &#39;The Effects of this Sacrament&#39;) - In this sacrament, the sinner, placing himself before the merciful judgment of God, anticipates in a certain way the judgment to which he will be subjected at the end of his earthly life. For it is now, in this life, that we are offered the choice between life and death, and it is only by the road of conversion that we can enter the Kingdom, from which one is excluded by grave sin. In converting to Christ through penance and faith, the sinner passes from death to life and &#34;does not come into judgment.&#34;</p><br/><p>- 635 (in &#39;Christ descended into Hell&#39;) - Christ went down into the depths of death so that &#34;the dead will hear the voice of the Son of God, and those who hear will live.&#34; Jesus, &#34;the Author of life&#34;, by dying destroyed &#34;him who has the power of death, that is, the devil, and [delivered] all those who through fear of death were subject to lifelong bondage.&#34; Henceforth the risen Christ holds &#34;the keys of Death and Hades&#34;, so that &#34;at the name of Jesus every knee should bow, in heaven and on earth and under the earth.&#34;</p><br/><p>- 1038 (in &#39;The Last Judgement&#39;) - The resurrection of all the dead, &#34;of both the just and the unjust,&#34; will precede the Last Judgment. This will be &#34;the hour when all who are in the tombs will hear [the Son of man&#39;s] voice and come forth, those who have done good, to the resurrection of life, and those who have done evil, to the resurrection of judgment&#34; (abbreviated).</p><br/><p>- 612 (in &#39;The Agony at Gethsemani&#39;) - Like ours, his human nature is destined for eternal life; but unlike ours, it is perfectly exempt from sin, the cause of death (abbreviated).</p><br/><p>- 998 (in &#39;How do the dead rise?&#39;) - Who will rise? All the dead will rise, &#34;those who have done good, to the resurrection of life, and those who have done evil, to the resurrection of judgment.&#34;</p><br/><p>- 574 (in &#39;Jesus and Israel&#39;)</p><br/><p>- 589 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;)</p><br/><p>- 1063 (in &#39;Amen&#39;)</p><br/><p>- 2824 (in &#39;Thy Will be done on earth as it is heaven&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4pQvAdBd3OasCSe5VKWex3",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 4 of Lent - John 5: 17-30",
    "release_date": "2023-03-21",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4pQvAdBd3OasCSe5VKWex3"
}