{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6RPqOD3rIXWSSA7BqF8xeI/clip_601781_661781.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 6: 34-44 - 'The feeding of the five thousand.'  Note: Some countries may have a different gospel reading at Mass today, if they celebrated the Feast of the Epiphany on Sunday rather than Monday. This podcast follows the lectionary for the General Roman Calendar.   Catechism of the Catholic Church Paragraphs: - 472 (in 'Christ's Soul and his human knowledge') - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, “increase in wisdom and in stature, and in favor with God and man,” and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking “the form of a slave.”  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 894154,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4uNFVjpOtSRtuYpvMcGuaO"
    },
    "href": "https://api.spotify.com/v1/episodes/4uNFVjpOtSRtuYpvMcGuaO",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 6: 34-44 - &#39;The feeding of the five thousand.&#39;<br /><br/><br /><br/>Note: Some countries may have a different gospel reading at Mass today, if they celebrated the Feast of the Epiphany on Sunday rather than Monday. This podcast follows the lectionary for the General Roman Calendar.<br /><br/><br /><br/><br /><br/>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 472 (in &#39;Christ&#39;s Soul and his human knowledge&#39;) - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, “increase in wisdom and in stature, and in favor with God and man,” and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking “the form of a slave.”</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4uNFVjpOtSRtuYpvMcGuaO",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "January 8 - Mark 6: 34-44",
    "release_date": "2023-01-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4uNFVjpOtSRtuYpvMcGuaO"
}