{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0uVckznLf2fa9kOtiJ1Rpw/clip_18700_62700.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Note: There are two Masses on Holy Thursday, each which have different gospel readings. In this episode, we are looking at the reading from the Mass which is held later in the day, called 'The Mass of the Lord's Supper.'  John 13:1-15 - 'Now he showed how perfect his love was.'  Catechism of the Catholic Church Paragraphs: - 609 (in 'Jesus freely embraced the Father's redeeming love') - By embracing in his human heart the Father's love for men, Jesus \"loved them to the end\", for \"greater love has no man than this, that a man lay down his life for his friends.\" In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: \"No one takes [my life] from me, but I lay it down of my own accord.\" Hence the sovereign freedom of God's Son as he went out to his death. - 616 (in 'Jesus substitutes his obedience for our disobedience') - It is love \"to the end\" that confers on Christ's sacrifice its value as redemption and reparation, as atonement and satisfaction. He knew and loved us all when he offered his life. Now \"the love of Christ controls us, because we are convinced that one has died for all; therefore all have died.\" No man, not even the holiest, was ever able to take on himself the sins of all men and offer himself as a sacrifice for all. the existence in Christ of the divine person of the Son, who at once surpasses and embraces all human persons, and constitutes himself as the Head of all mankind, makes possible his redemptive sacrifice for all. - 1380 (in 'The Presence of Christ by the power of his word and Holy Spirit') - It is highly fitting that Christ should have wanted to remain present to his Church in this unique way. Since Christ was about to take his departure from his own in his visible form, he wanted to give us his sacramental presence; since he was about to offer himself on the cross to save us, he wanted us to have the memorial of the love with which he loved us \"to the end,\" even to the giving of his life. In his Eucharistic presence he remains mysteriously in our midst as the one who loved us and gave himself up for us, and he remains under signs that express and communicate this love (abbreviated). - 1524 (in 'Viaticum, the Last Sacrament of the Christian') - In addition to the Anointing of the Sick, the Church offers those who are about to leave this life the Eucharist as viaticum. Communion in the body and blood of Christ, received at this moment of \"passing over\" to the Father, has a particular significance and importance. It is the seed of eternal life and the power of resurrection, according to the words of the Lord: \"He who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day.\" The sacrament of Christ once dead and now risen, the Eucharist is here the sacrament of passing over from death to life, from this world to the Father. - 1823 (in 'Charity') - 1694 (in 'Life in Christ') - 1269 (in 'Incorporated in to the Church, the body of Christ') - 520 (in 'Our Communion in the Mysteries of Jesus')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1608214,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/4ygCcPFGYmjmg08Sfesb7k"
    },
    "href": "https://api.spotify.com/v1/episodes/4ygCcPFGYmjmg08Sfesb7k",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Note: There are two Masses on Holy Thursday, each which have different gospel readings. In this episode, we are looking at the reading from the Mass which is held later in the day, called &#39;The Mass of the Lord&#39;s Supper.&#39;</p><br/><p><br /></p><br/><p>John 13:1-15 - &#39;Now he showed how perfect his love was.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 609 (in &#39;Jesus freely embraced the Father&#39;s redeeming love&#39;) - By embracing in his human heart the Father&#39;s love for men, Jesus &#34;loved them to the end&#34;, for &#34;greater love has no man than this, that a man lay down his life for his friends.&#34; In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: &#34;No one takes [my life] from me, but I lay it down of my own accord.&#34; Hence the sovereign freedom of God&#39;s Son as he went out to his death.</p><br/><p>- 616 (in &#39;Jesus substitutes his obedience for our disobedience&#39;) - It is love &#34;to the end&#34; that confers on Christ&#39;s sacrifice its value as redemption and reparation, as atonement and satisfaction. He knew and loved us all when he offered his life. Now &#34;the love of Christ controls us, because we are convinced that one has died for all; therefore all have died.&#34; No man, not even the holiest, was ever able to take on himself the sins of all men and offer himself as a sacrifice for all. the existence in Christ of the divine person of the Son, who at once surpasses and embraces all human persons, and constitutes himself as the Head of all mankind, makes possible his redemptive sacrifice for all.</p><br/><p>- 1380 (in &#39;The Presence of Christ by the power of his word and Holy Spirit&#39;) - It is highly fitting that Christ should have wanted to remain present to his Church in this unique way. Since Christ was about to take his departure from his own in his visible form, he wanted to give us his sacramental presence; since he was about to offer himself on the cross to save us, he wanted us to have the memorial of the love with which he loved us &#34;to the end,&#34; even to the giving of his life. In his Eucharistic presence he remains mysteriously in our midst as the one who loved us and gave himself up for us, and he remains under signs that express and communicate this love (abbreviated).</p><br/><p>- 1524 (in &#39;Viaticum, the Last Sacrament of the Christian&#39;) - In addition to the Anointing of the Sick, the Church offers those who are about to leave this life the Eucharist as viaticum. Communion in the body and blood of Christ, received at this moment of &#34;passing over&#34; to the Father, has a particular significance and importance. It is the seed of eternal life and the power of resurrection, according to the words of the Lord: &#34;He who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day.&#34; The sacrament of Christ once dead and now risen, the Eucharist is here the sacrament of passing over from death to life, from this world to the Father.</p><br/><p>- 1823 (in &#39;Charity&#39;)</p><br/><p>- 1694 (in &#39;Life in Christ&#39;)</p><br/><p>- 1269 (in &#39;Incorporated in to the Church, the body of Christ&#39;)</p><br/><p>- 520 (in &#39;Our Communion in the Mysteries of Jesus&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "4ygCcPFGYmjmg08Sfesb7k",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Maundy Thursday - John 13: 1-15",
    "release_date": "2023-04-05",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:4ygCcPFGYmjmg08Sfesb7k"
}