{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/32AowUcog4fX5ylaQvo4dj/clip_500298_560298.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 10: 24-30 - 'Let them both grow till the harvest.'  Catechism of the Catholic Church Paragraphs: - 827 (in 'The Church is Holy') - \"Christ, 'holy, innocent, and undefiled,' knew nothing of sin, but came only to expiate the sins of the people. the Church, however, clasping sinners to her bosom, at once holy and always in need of purification, follows constantly the path of penance and renewal.\" All members of the Church, including her ministers, must acknowledge that they are sinners. In everyone, the weeds of sin will still be mixed with the good wheat of the Gospel until the end of time. Hence the Church gathers sinners already caught up in Christ's salvation but still on the way to holiness: The Church is therefore holy, though having sinners in her midst, because she herself has no other life but the life of grace. If they live her life, her members are sanctified; if they move away from her life, they fall into sins and disorders that prevent the radiation of her sanctity. This is why she suffers and does penance for those offenses, of the means of salvation\" has been deposited. It is in her that \"by the grace of God we acquire holiness.\" - 1034 (in 'Hell') - Jesus often speaks of \"Gehenna\" of \"the unquenchable fire\" reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he \"will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,\" and that he will pronounce the condemnation: \"Depart from me, you cursed, into the eternal fire!\" - 333 (in 'Christ with all his angels') - They will be present at Christ's return, which they will announce, to serve at his Judgement (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1957651,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/538koi34JvABZA8LVbIrR6"
    },
    "href": "https://api.spotify.com/v1/episodes/538koi34JvABZA8LVbIrR6",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 10: 24-30 - &#39;Let them both grow till the harvest.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 827 (in &#39;The Church is Holy&#39;) - &#34;Christ, &#39;holy, innocent, and undefiled,&#39; knew nothing of sin, but came only to expiate the sins of the people. the Church, however, clasping sinners to her bosom, at once holy and always in need of purification, follows constantly the path of penance and renewal.&#34; All members of the Church, including her ministers, must acknowledge that they are sinners. In everyone, the weeds of sin will still be mixed with the good wheat of the Gospel until the end of time. Hence the Church gathers sinners already caught up in Christ&#39;s salvation but still on the way to holiness:</p><br/><p>The Church is therefore holy, though having sinners in her midst, because she herself has no other life but the life of grace. If they live her life, her members are sanctified; if they move away from her life, they fall into sins and disorders that prevent the radiation of her sanctity. This is why she suffers and does penance for those offenses, of the means of salvation&#34; has been deposited. It is in her that &#34;by the grace of God we acquire holiness.&#34;</p><br/><p>- 1034 (in &#39;Hell&#39;) - Jesus often speaks of &#34;Gehenna&#34; of &#34;the unquenchable fire&#34; reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he &#34;will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,&#34; and that he will pronounce the condemnation: &#34;Depart from me, you cursed, into the eternal fire!&#34;</p><br/><p>- 333 (in &#39;Christ with all his angels&#39;) - They will be present at Christ&#39;s return, which they will announce, to serve at his Judgement (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "538koi34JvABZA8LVbIrR6",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 16 in Ordinary Time - Matt 13: 24-30, 36-43",
    "release_date": "2023-07-28",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:538koi34JvABZA8LVbIrR6"
}