{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7e8h3MgI5DnDl7bn35gruY/clip_782600_826900.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 17: 1-9 - 'His face shone like the sun.'  Catechism of the Catholic Church Paragraphs: - 554 (in 'A Foretaste of the Kingdom - The Transfiguration') - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master \"began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised.\" Peter scorns this prediction, nor do the others understand it any better than he. In this context the mysterious episode of Jesus' Transfiguration takes place on a high mountain, before three witnesses chosen by himself: Peter, James and John. Jesus' face and clothes become dazzling with light, and Moses and Elijah appear, speaking \"of his departure, which he was to accomplish at Jerusalem\". A cloud covers him and a voice from heaven says: \"This is my Son, my Chosen; listen to him!\" - 444 (in 'The Only Son of God') - The Gospels report that at two solemn moments, the Baptism and the Transfiguration of Christ, the voice of the Father designates Jesus his \"beloved Son\". Jesus calls himself the \"only Son of God\", and by this title affirms his eternal pre-existence.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1137313,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/56KU94hScVCfKhc2bl1jT4"
    },
    "href": "https://api.spotify.com/v1/episodes/56KU94hScVCfKhc2bl1jT4",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 17: 1-9 - &#39;His face shone like the sun.&#39;<br /><br/></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 554 (in &#39;A Foretaste of the Kingdom - The Transfiguration&#39;) - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master &#34;began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised.&#34; Peter scorns this prediction, nor do the others understand it any better than he. In this context the mysterious episode of Jesus&#39; Transfiguration takes place on a high mountain, before three witnesses chosen by himself: Peter, James and John. Jesus&#39; face and clothes become dazzling with light, and Moses and Elijah appear, speaking &#34;of his departure, which he was to accomplish at Jerusalem&#34;. A cloud covers him and a voice from heaven says: &#34;This is my Son, my Chosen; listen to him!&#34;</p><br/><p>- 444 (in &#39;The Only Son of God&#39;) - The Gospels report that at two solemn moments, the Baptism and the Transfiguration of Christ, the voice of the Father designates Jesus his &#34;beloved Son&#34;. Jesus calls himself the &#34;only Son of God&#34;, and by this title affirms his eternal pre-existence.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "56KU94hScVCfKhc2bl1jT4",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "2nd Sunday of Lent (Year A) - Matt 17: 1-9",
    "release_date": "2023-03-04",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:56KU94hScVCfKhc2bl1jT4"
}