{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0IgR0JiuiChsNtHHMPtA2S/clip_1191850_1258450.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 16: 13-23 - 'You are Peter and on this rock I will build my church.'  Catechism of the Catholic Church Paragraphs: - 552-553 (in 'The Keys to the Kingdom') - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him. Through a revelation from the Father, Peter had confessed: \"You are the Christ, the Son of the living God.\" Our Lord then declared to him: \"You      are Peter, and on this rock I will build my Church, and the gates of Hades will not prevail against it.\" Christ, the \"living Stone\",thus assures his Church, built on Peter, of victory over the powers of death. Because of the faith he confessed Peter will remain the      unshakable rock of the Church. His mission will be to keep this faith from every lapse and to strengthen his brothers in it. Jesus entrusted a specific authority to Peter: \"I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.\" The \"power of the keys\" designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: \"Feed my sheep.\" The power to \"bind and loose\" connotes the authority to absolve sins, to pronounce doctrinal judgments, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom. - 869 (in 'The Church is Apostolic') - The Church is apostolic. She is built on a lasting foundation: \"the twelve apostles of the Lamb\" (Rev 21:14). She is indestructible (cf. Mt 16:18). She is upheld infallibly in the truth: Christ governs her through Peter and the other apostles, who are present in their successors, the Pope and the college of bishops. - 442 (in 'The Only Son of God') - Such is not the case for Simon Peter when he confesses Jesus as \"the Christ, the Son of the living God\", for Jesus responds solemnly: \"Flesh and blood has not revealed this to you, but my Father who is in heaven.\" Similarly Paul will write, regarding his conversion on the road to Damascus, \"When he who had set me apart before I was born, and had called me through his grace, was pleased to reveal his Son to me, in order that I might preach him among the Gentiles. . . \"And in the synagogues immediately [Paul] proclaimed Jesus, saying, 'He is the Son of God.'\" From the beginning this acknowledgment of Christ's divine sonship will be the center of the apostolic faith, first professed by Peter as the Church's foundation. - 607 (in 'Christ's whole life is an offering to the Father') - The desire to embrace his Father's plan of redeeming love inspired Jesus' whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, \"and what shall I say? 'Father, save me from this hour'? No,      for this purpose I have come to this hour\" (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2719730,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5AEhk7IaoX1JXlSZzrPNnH"
    },
    "href": "https://api.spotify.com/v1/episodes/5AEhk7IaoX1JXlSZzrPNnH",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 16: 13-23 - &#39;You are Peter and on this rock I will build my church.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 552-553 (in &#39;The Keys to the Kingdom&#39;) - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him. Through a revelation from the Father, Peter had confessed: &#34;You are the Christ, the Son of the living God.&#34; Our Lord then declared to him: &#34;You      are Peter, and on this rock I will build my Church, and the gates of Hades will not prevail against it.&#34; Christ, the &#34;living Stone&#34;,thus assures his Church, built on Peter, of victory over the powers of death. Because of the faith he confessed Peter will remain the      unshakable rock of the Church. His mission will be to keep this faith from every lapse and to strengthen his brothers in it. Jesus entrusted a specific authority to Peter: &#34;I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.&#34; The &#34;power of the keys&#34; designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: &#34;Feed my sheep.&#34; The power to &#34;bind and loose&#34; connotes the authority to absolve sins, to pronounce doctrinal judgments, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom.</p><br/><p>- 869 (in &#39;The Church is Apostolic&#39;) - The Church is apostolic. She is built on a lasting foundation: &#34;the twelve apostles of the Lamb&#34; (Rev 21:14). She is indestructible (cf. Mt 16:18). She is upheld infallibly in the truth: Christ governs her through Peter and the other apostles, who are present in their successors, the Pope and the college of bishops.</p><br/><p>- 442 (in &#39;The Only Son of God&#39;) - Such is not the case for Simon Peter when he confesses Jesus as &#34;the Christ, the Son of the living God&#34;, for Jesus responds solemnly: &#34;Flesh and blood has not revealed this to you, but my Father who is in heaven.&#34; Similarly Paul will write, regarding his conversion on the road to Damascus, &#34;When he who had set me apart before I was born, and had called me through his grace, was pleased to reveal his Son to me, in order that I might preach him among the Gentiles. . . &#34;And in the synagogues immediately [Paul] proclaimed Jesus, saying, &#39;He is the Son of God.&#39;&#34; From the beginning this acknowledgment of Christ&#39;s divine sonship will be the center of the apostolic faith, first professed by Peter as the Church&#39;s foundation.</p><br/><p>- 607 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The desire to embrace his Father&#39;s plan of redeeming love inspired Jesus&#39; whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, &#34;and what shall I say? &#39;Father, save me from this hour&#39;? No,      for this purpose I have come to this hour&#34; (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5AEhk7IaoX1JXlSZzrPNnH",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 18 in Ordinary Time - Matt 16: 13-23",
    "release_date": "2023-08-09",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5AEhk7IaoX1JXlSZzrPNnH"
}