{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/21qQMVKrpl8Ug8KaaWk0Rv/clip_365700_413600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 7: 6, 12-14 - 'Treat others as you would like them to treat you.'  Catechism of the Catholic Church Paragraphs: - 1789 (in 'To Choose in accord with conscience') - Some rules apply in every case: - One may never do evil so that good may result from it; - the Golden Rule: \"whatever you wish that men would do to you, do so to them\" (abbreviated). - 1970 (in 'The New Law') - The Law of the Gospel requires us to make the decisive choice between \"the two ways\" and to put into practice the words of the Lord. It is summed up in the Golden Rule, \"Whatever you wish that men would do to you, do so to them; this is the law and the prophets.\" - 1036 (in 'Hell') - The affirmations of Sacred Scripture and the teachings of the Church on the subject of hell are a call to the responsibility incumbent upon man to make use of his freedom in view of his eternal destiny. They are at the same time an urgent call to conversion: \"Enter by the narrow gate;      for the gate is wide and the way is easy, that leads to destruction, and those who enter by it are many. For the gate is narrow and the way is hard, that leads to life, and those who find it are few.\" - 1696 (in 'Life in Christ') - The way of Christ \"leads to life\"; a contrary way \"leads to destruction.\" The Gospel parable of the two ways remains ever present in the catechesis of the Church; it shows the importance of moral decisions for our salvation: \"There are two ways, the one of life, the other of death; but between the two, there is a great difference.\" - 2609 (in 'Jesus teaches us how to pray') - Once committed to conversion, the heart learns to pray in faith. Faith is a filial adherence to God beyond what we feel and understand. It is possible because the beloved Son gives us access to the Father. He can ask us to \"seek\" and to \"knock,\" since he himself is the door and the way.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1341625,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5Ckp9wRouFjyeQR4kaBUWR"
    },
    "href": "https://api.spotify.com/v1/episodes/5Ckp9wRouFjyeQR4kaBUWR",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 7: 6, 12-14 - &#39;Treat others as you would like them to treat you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1789 (in &#39;To Choose in accord with conscience&#39;) - Some rules apply in every case: - One may never do evil so that good may result from it; - the Golden Rule: &#34;whatever you wish that men would do to you, do so to them&#34; (abbreviated).</p><br/><p>- 1970 (in &#39;The New Law&#39;) - The Law of the Gospel requires us to make the decisive choice between &#34;the two ways&#34; and to put into practice the words of the Lord. It is summed up in the Golden Rule, &#34;Whatever you wish that men would do to you, do so to them; this is the law and the prophets.&#34;</p><br/><p>- 1036 (in &#39;Hell&#39;) - The affirmations of Sacred Scripture and the teachings of the Church on the subject of hell are a call to the responsibility incumbent upon man to make use of his freedom in view of his eternal destiny. They are at the same time an urgent call to conversion: &#34;Enter by the narrow gate;      for the gate is wide and the way is easy, that leads to destruction, and those who enter by it are many. For the gate is narrow and the way is hard, that leads to life, and those who find it are few.&#34;</p><br/><p>- 1696 (in &#39;Life in Christ&#39;) - The way of Christ &#34;leads to life&#34;; a contrary way &#34;leads to destruction.&#34; The Gospel parable of the two ways remains ever present in the catechesis of the Church; it shows the importance of moral decisions for our salvation: &#34;There are two ways, the one of life, the other of death; but between the two, there is a great difference.&#34;</p><br/><p>- 2609 (in &#39;Jesus teaches us how to pray&#39;) - Once committed to conversion, the heart learns to pray in faith. Faith is a filial adherence to God beyond what we feel and understand. It is possible because the beloved Son gives us access to the Father. He can ask us to &#34;seek&#34; and to &#34;knock,&#34; since he himself is the door and the way.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5Ckp9wRouFjyeQR4kaBUWR",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 12 in Ordinary Time - Matt 7: 6, 12-14",
    "release_date": "2023-06-26",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5Ckp9wRouFjyeQR4kaBUWR"
}