{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3EMwi0s93pBJUBmR8u0CEx/clip_1003000_1054000.mp3",
    "description": "Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy  John 10: 31-42 - 'They wanted to stone Jesus, but he eluded them.'  Catechism of the Catholic Church Paragraphs: - 548 (in 'The Signs of the Kingdom of God') - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father's works; they bear witness that he is the Son of God. But his miracles can also be occasions for \"offence\", they are not intended to satisfy people's curiosity or desire for magic. Despite his evident miracles some people reject Jesus; he is even accused of acting by the power of demons. - 574 (in 'Jesus and Israel') - He is accused of blasphemy and false prophecy, religious crimes which the Law punished with death by stoning (abbreviated). - 589 (in 'Jesus and Israel's faith in the One God and Saviour') - By forgiving sins Jesus either is blaspheming as a man who made himself God's equal, or is speaking the truth and his person really does make present and reveal God's name (abbreviated). - 591 (in 'Jesus and Israel's faith in the One God and Saviour') - Jesus asked the religious authorities of Jerusalem to believe in him because of the Father's works which he accomplished. But such an act of faith must go through a mysterious death to self, for a new \"birth from above\" under the influence of divine grace. Such a demand for conversion in the face of so surprising a fulfilment of the promises allows one to understand the Sanhedrin's tragic misunderstanding of Jesus: they judged that he deserved the death sentence as a blasphemer. The members of the Sanhedrin were thus acting at the same time out of \"ignorance\" and the \"hardness\" of their \"unbelief\". - 594 (in 'Jesus and Israel's faith in the One God and Saviour') - Jesus performed acts, such as pardoning sins, that manifested him to be the Saviour God himself (cf Jn 5:16-18). Certain Jews, who did not recognize God made man (cf Jn 1:14), saw in him only a man who made himself God (Jn 10:33), and judged him as a blasphemer. - 444 (in 'The Only Son of God') - Jesus calls himself the \"only Son of God\", and by this title affirms his eternal pre-existence. He asks for faith in \"the name of the only Son of God\". In the centurion's exclamation before the crucified Christ, \"Truly this man was the Son of God\", that Christian confession is already heard. Only in the Paschal mystery can the believer give the title \"Son of God\" its full meaning (abbreviated). - 1562 (in 'The ordination of priests - co-workers of the bishops') - \"Christ, whom the Father hallowed and sent into the world, has, through his apostles, made their successors, the bishops namely, sharers in his consecration and mission; and these, in their turn, duly entrusted in varying degrees various members of the Church with the office of their ministry.\" \"The function of the bishops' ministry was handed over in a subordinate degree to priests so that they might be appointed in the order of the priesthood and be co-workers of the episcopal order for the proper fulfillment of the apostolic mission that had been entrusted to it by Christ.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1219790,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5Flla2GxmfzGON7E7y3L2v"
    },
    "href": "https://api.spotify.com/v1/episodes/5Flla2GxmfzGON7E7y3L2v",
    "html_description": "<p>Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 10: 31-42 - &#39;They wanted to stone Jesus, but he eluded them.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 548 (in &#39;The Signs of the Kingdom of God&#39;) - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father&#39;s works; they bear witness that he is the Son of God. But his miracles can also be occasions for &#34;offence&#34;, they are not intended to satisfy people&#39;s curiosity or desire for magic. Despite his evident miracles some people reject Jesus; he is even accused of acting by the power of demons.</p><br/><p>- 574 (in &#39;Jesus and Israel&#39;) - He is accused of blasphemy and false prophecy, religious crimes which the Law punished with death by stoning (abbreviated).</p><br/><p>- 589 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;) - By forgiving sins Jesus either is blaspheming as a man who made himself God&#39;s equal, or is speaking the truth and his person really does make present and reveal God&#39;s name (abbreviated).</p><br/><p>- 591 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;) - Jesus asked the religious authorities of Jerusalem to believe in him because of the Father&#39;s works which he accomplished. But such an act of faith must go through a mysterious death to self, for a new &#34;birth from above&#34; under the influence of divine grace. Such a demand for conversion in the face of so surprising a fulfilment of the promises allows one to understand the Sanhedrin&#39;s tragic misunderstanding of Jesus: they judged that he deserved the death sentence as a blasphemer. The members of the Sanhedrin were thus acting at the same time out of &#34;ignorance&#34; and the &#34;hardness&#34; of their &#34;unbelief&#34;.</p><br/><p>- 594 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;) - Jesus performed acts, such as pardoning sins, that manifested him to be the Saviour God himself (cf Jn 5:16-18). Certain Jews, who did not recognize God made man (cf Jn 1:14), saw in him only a man who made himself God (Jn 10:33), and judged him as a blasphemer.</p><br/><p>- 444 (in &#39;The Only Son of God&#39;) - Jesus calls himself the &#34;only Son of God&#34;, and by this title affirms his eternal pre-existence. He asks for faith in &#34;the name of the only Son of God&#34;. In the centurion&#39;s exclamation before the crucified Christ, &#34;Truly this man was the Son of God&#34;, that Christian confession is already heard. Only in the Paschal mystery can the believer give the title &#34;Son of God&#34; its full meaning (abbreviated).</p><br/><p>- 1562 (in &#39;The ordination of priests - co-workers of the bishops&#39;) - &#34;Christ, whom the Father hallowed and sent into the world, has, through his apostles, made their successors, the bishops namely, sharers in his consecration and mission; and these, in their turn, duly entrusted in varying degrees various members of the Church with the office of their ministry.&#34; &#34;The function of the bishops&#39; ministry was handed over in a subordinate degree to priests so that they might be appointed in the order of the priesthood and be co-workers of the episcopal order for the proper fulfillment of the apostolic mission that had been entrusted to it by Christ.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5Flla2GxmfzGON7E7y3L2v",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 5 of Lent - John 10: 31-42",
    "release_date": "2023-03-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5Flla2GxmfzGON7E7y3L2v"
}