{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5iTBInTZ4J1MRdSNnLNnBf/clip_29100_83400.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 17: 20-26 - 'Father, may they be completely one.'  Catechism of the Catholic Church Paragraphs: - 260 (in 'The Divine Works and the Trinitarian Missions') - The ultimate end of the whole divine economy is the entry of God's creatures into the perfect unity of the Blessed Trinity. But even now we are called to be a dwelling for the Most Holy Trinity: \"If a man loves me\", says the Lord, \"he will keep my word, and my Father will love him, and we will come to him, and make our home with him\" - 877 (in 'Why the Ecclesial Ministry?') - Likewise, it belongs to the sacramental nature of ecclesial ministry that it have a collegial character. In fact, from the beginning of his ministry, the Lord Jesus instituted the Twelve as \"the seeds of the new Israel and the beginning of the sacred hierarchy.\" Chosen together, they were also sent out together, and their fraternal unity would be at the service of the fraternal communion of all the faithful: they would reflect and witness to the communion of the divine persons. For this reason every bishop exercises his ministry from within the episcopal college, in communion with the bishop of Rome, the successor of St. Peter and head of the college. So also priests exercise their ministry from within the presbyterium of the diocese, under the direction of their bishop. - 820 (in 'Toward Unity') - \"Christ bestowed unity on his Church from the beginning. This unity, we believe, subsists in the Catholic Church as something she can never lose, and we hope that it will continue to increase until the end of time.\" Christ always gives his Church the gift of unity, but the Church must always pray and work to maintain, reinforce, and perfect the unity that Christ wills for her. This is why Jesus himself prayed at the hour of his Passion, and does not cease praying to his Father, for the unity of his disciples: \"That they may all be one. As you, Father, are in me and I am in you, may they also be one in us, . . . so that the world may know that you have sent me.\" The desire to recover the unity of all Christians is a gift of Christ and a call of the Holy Spirit. - 690 (in 'The Joint Mission of the Son and the Spirit') - When Christ is finally glorified, he can in turn send the Spirit from his place with the Father to those who believe in him: he communicates to them his glory, that is, the Holy Spirit who glorifies him. From that time on, this joint mission will be manifested in the children adopted by the Father in the Body of his Son: the mission of the Spirit of adoption is to unite them to Christ and make them live in him (abbreviated). - 2751 (in 'The Prayer of the Hour of Jesus') - Finally, in this prayer Jesus reveals and gives to us the \"knowledge,\" inseparably one, of the Father and of the Son, which is the very mystery of the life of prayer.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1430279,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5g9b86UOQT21lekc1Ho7Mf"
    },
    "href": "https://api.spotify.com/v1/episodes/5g9b86UOQT21lekc1Ho7Mf",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 17: 20-26 - &#39;Father, may they be completely one.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 260 (in &#39;The Divine Works and the Trinitarian Missions&#39;) - The ultimate end of the whole divine economy is the entry of God&#39;s creatures into the perfect unity of the Blessed Trinity. But even now we are called to be a dwelling for the Most Holy Trinity: &#34;If a man loves me&#34;, says the Lord, &#34;he will keep my word, and my Father will love him, and we will come to him, and make our home with him&#34;</p><br/><p>- 877 (in &#39;Why the Ecclesial Ministry?&#39;) - Likewise, it belongs to the sacramental nature of ecclesial ministry that it have a collegial character. In fact, from the beginning of his ministry, the Lord Jesus instituted the Twelve as &#34;the seeds of the new Israel and the beginning of the sacred hierarchy.&#34; Chosen together, they were also sent out together, and their fraternal unity would be at the service of the fraternal communion of all the faithful: they would reflect and witness to the communion of the divine persons. For this reason every bishop exercises his ministry from within the episcopal college, in communion with the bishop of Rome, the successor of St. Peter and head of the college. So also priests exercise their ministry from within the presbyterium of the diocese, under the direction of their bishop.</p><br/><p>- 820 (in &#39;Toward Unity&#39;) - &#34;Christ bestowed unity on his Church from the beginning. This unity, we believe, subsists in the Catholic Church as something she can never lose, and we hope that it will continue to increase until the end of time.&#34; Christ always gives his Church the gift of unity, but the Church must always pray and work to maintain, reinforce, and perfect the unity that Christ wills for her. This is why Jesus himself prayed at the hour of his Passion, and does not cease praying to his Father, for the unity of his disciples: &#34;That they may all be one. As you, Father, are in me and I am in you, may they also be one in us, . . . so that the world may know that you have sent me.&#34; The desire to recover the unity of all Christians is a gift of Christ and a call of the Holy Spirit.</p><br/><p>- 690 (in &#39;The Joint Mission of the Son and the Spirit&#39;) - When Christ is finally glorified, he can in turn send the Spirit from his place with the Father to those who believe in him: he communicates to them his glory, that is, the Holy Spirit who glorifies him. From that time on, this joint mission will be manifested in the children adopted by the Father in the Body of his Son: the mission of the Spirit of adoption is to unite them to Christ and make them live in him (abbreviated).</p><br/><p>- 2751 (in &#39;The Prayer of the Hour of Jesus&#39;) - Finally, in this prayer Jesus reveals and gives to us the &#34;knowledge,&#34; inseparably one, of the Father and of the Son, which is the very mystery of the life of prayer.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5g9b86UOQT21lekc1Ho7Mf",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "7th Sunday of Easter (Year C) - John 17: 20-26",
    "release_date": "2022-05-28",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5g9b86UOQT21lekc1Ho7Mf"
}