{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3S1Y6EAbUe0B4hpYUdB3fm/clip_621079_681079.mp3",
    "description": "To support the ministry and access exclusive content, go to: http://patreon.com/logicalbiblestudy For complete verse-by-verse audio commentaries from Logical Bible Study, go to: https://mysoundwise.com/publishers/1677296682850p  Matthew 18: 15-20 - 'If your brother listens to you, you have won back your brother.'  Catechism of the Catholic Church Paragraphs: - 2472 (in 'To Bear Witness to the Truth') - The duty of Christians to take part in the life of the Church impels them to act as witnesses of the Gospel and of the obligations that flow from it. This witness is a transmission of the faith in words and deeds. Witness is an act of justice that establishes the truth or makes it known. - 553 (in 'The Keys of the Kingdom') - The power to \"bind and loose\" connotes the authority to absolve sins, to pronounce doctrinal judgements, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom (abbreviated). - 1444 (in 'Reconciliation with the Church') - In imparting to his apostles his own power to forgive sins the Lord also gives them the authority to reconcile sinners with the Church. This ecclesial dimension of their task is expressed most notably in Christ's solemn words to Simon Peter: \"I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.\" \"The office of binding and loosing which was given to Peter was also assigned to the college of the apostles united to its head.\" - 1088 (is 'Present in the earthly liturgy') - He is present in his word since it is he himself who speaks when the holy Scriptures are read in the Church. Lastly, he is present when the Church prays and sings, for he has promised 'where two or three are gathered together in my name there am I in the midst of them\" (abbreviated). - 1373 (in 'The Presence of Christ by the power of his word and the Holy Spirit') - \"Christ Jesus, who died, yes, who was raised from the dead, who is at the right hand of God, who indeed intercedes for us,\" is present in many ways to his Church: in his word, in his Church's prayer, \"where two or three are gathered in my name,\" in the poor, the sick, and the imprisoned (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2075980,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5GrzvuQlsiaGTvsgdCsb5h"
    },
    "href": "https://api.spotify.com/v1/episodes/5GrzvuQlsiaGTvsgdCsb5h",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">http://patreon.com/logicalbiblestudy</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 18: 15-20 - &#39;If your brother listens to you, you have won back your brother.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2472 (in &#39;To Bear Witness to the Truth&#39;) - The duty of Christians to take part in the life of the Church impels them to act as witnesses of the Gospel and of the obligations that flow from it. This witness is a transmission of the faith in words and deeds. Witness is an act of justice that establishes the truth or makes it known.</p><br/><p>- 553 (in &#39;The Keys of the Kingdom&#39;) - The power to &#34;bind and loose&#34; connotes the authority to absolve sins, to pronounce doctrinal judgements, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom (abbreviated).</p><br/><p>- 1444 (in &#39;Reconciliation with the Church&#39;) - In imparting to his apostles his own power to forgive sins the Lord also gives them the authority to reconcile sinners with the Church. This ecclesial dimension of their task is expressed most notably in Christ&#39;s solemn words to Simon Peter: &#34;I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.&#34; &#34;The office of binding and loosing which was given to Peter was also assigned to the college of the apostles united to its head.&#34;</p><br/><p>- 1088 (is &#39;Present in the earthly liturgy&#39;) - He is present in his word since it is he himself who speaks when the holy Scriptures are read in the Church. Lastly, he is present when the Church prays and sings, for he has promised &#39;where two or three are gathered together in my name there am I in the midst of them&#34; (abbreviated).</p><br/><p>- 1373 (in &#39;The Presence of Christ by the power of his word and the Holy Spirit&#39;) - &#34;Christ Jesus, who died, yes, who was raised from the dead, who is at the right hand of God, who indeed intercedes for us,&#34; is present in many ways to his Church: in his word, in his Church&#39;s prayer, &#34;where two or three are gathered in my name,&#34; in the poor, the sick, and the imprisoned (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5GrzvuQlsiaGTvsgdCsb5h",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "23rd Sunday in Ordinary Time (Year A) - Matt 18: 15-20",
    "release_date": "2023-09-09",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5GrzvuQlsiaGTvsgdCsb5h"
}