{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0Cpikd7iPBt5xaUsiVMCyd/clip_1093100_1137200.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 16: 21-27 - 'Get behind me, Satan!'  Catechism of the Catholic Church Paragraphs: - 540 (in 'Jesus' Temptations') - Jesus' temptation reveals the way in which the Son of God is Messiah, contrary to the way Satan proposes to him and the way men wish to attribute to him (abbreviated). - 554 (in 'A Foretaste of the kingdom: the Transfiguration') - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master \"began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised. Peter scorns this prediction, nor do the others understand it any better than he (abbreviated). - 607 (in 'Christ's whole life is an offering to the Father') - The desire to embrace his Father's plan of redeeming love inspired Jesus' whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, \"and what shall I say? 'Father, save me from this hour'? No, for this purpose I have come to this hour\" (abbreviated). - 736 (in 'The Holy Spirit - God's gift') - We live by the Spirit\"; the more we renounce ourselves, the more we \"walk by the Spirit\" (abbreviated). - 226 (in 'The Implications of Faith in One God') - It means making good use of created things: faith in God, the only One, leads us to use everything that is not God only insofar as it brings us closer to him, and to detach ourselves from it insofar as it turns us away from him: My Lord and my God, take from me everything that distances me from you. My Lord and my God, give me everything that brings me closer to you. My Lord and my God, detach me from myself to give my all to you. - 618 (in 'Our participation in Christ's Sacrifice') - He calls his disciples to \"take up [their] cross and follow (him)\", for \"Christ also suffered for (us), leaving (us) an example so that (we) should follow in his steps.\" In fact Jesus desires to associate with his redeeming sacrifice those who were to be its first beneficiaries (abbreviated). - 2029 (in 'Grace and Justification') - \"If any man would come after me, let him deny himself and take up his cross and follow me.\" - 363 (in 'Body and Soul but Truly One') - In Sacred Scripture the term \"soul\" often refers to human life or the entire human person. But \"soul\" also refers to the innermost aspect of man, that which is of greatest value in him, that by which he is most especially in God's image: \"soul\" signifies the spiritual principle in man. - 1021 (in 'The Particular Judgement') - Death puts an end to human life as the time open to either accepting or rejecting the divine grace manifested in Christ. The New Testament speaks of judgment primarily in its aspect of the final encounter with Christ in his second coming, but also repeatedly affirms that each will be rewarded immediately after death in accordance with his works and faith. the parable of the poor man Lazarus and the words of Christ on the cross to the good thief, as well as other New Testament texts speak of a final destiny of the soul -a destiny which can be different for some and for others.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1696961,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5LVPuzbPDtbpNY3XO0XI3A"
    },
    "href": "https://api.spotify.com/v1/episodes/5LVPuzbPDtbpNY3XO0XI3A",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 16: 21-27 - &#39;Get behind me, Satan!&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 540 (in &#39;Jesus&#39; Temptations&#39;) - Jesus&#39; temptation reveals the way in which the Son of God is Messiah, contrary to the way Satan proposes to him and the way men wish to attribute to him (abbreviated).</p><br/><p>- 554 (in &#39;A Foretaste of the kingdom: the Transfiguration&#39;) - From the day Peter confessed that Jesus is the Christ, the Son of the living God, the Master &#34;began to show his disciples that he must go to Jerusalem and suffer many things. . . and be killed, and on the third day be raised. Peter scorns this prediction, nor do the others understand it any better than he (abbreviated).</p><br/><p>- 607 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The desire to embrace his Father&#39;s plan of redeeming love inspired Jesus&#39; whole life, for his redemptive passion was the very reason for his Incarnation. and so he asked, &#34;and what shall I say? &#39;Father, save me from this hour&#39;? No, for this purpose I have come to this hour&#34; (abbreviated).</p><br/><p>- 736 (in &#39;The Holy Spirit - God&#39;s gift&#39;) - We live by the Spirit&#34;; the more we renounce ourselves, the more we &#34;walk by the Spirit&#34; (abbreviated).</p><br/><p>- 226 (in &#39;The Implications of Faith in One God&#39;) - It means making good use of created things: faith in God, the only One, leads us to use everything that is not God only insofar as it brings us closer to him, and to detach ourselves from it insofar as it turns us away from him:</p><br/><p>My Lord and my God, take from me everything that distances me from you. My Lord and my God, give me everything that brings me closer to you. My Lord and my God, detach me from myself to give my all to you.</p><br/><p>- 618 (in &#39;Our participation in Christ&#39;s Sacrifice&#39;) - He calls his disciples to &#34;take up [their] cross and follow (him)&#34;, for &#34;Christ also suffered for (us), leaving (us) an example so that (we) should follow in his steps.&#34; In fact Jesus desires to associate with his redeeming sacrifice those who were to be its first beneficiaries (abbreviated).</p><br/><p>- 2029 (in &#39;Grace and Justification&#39;) - &#34;If any man would come after me, let him deny himself and take up his cross and follow me.&#34;</p><br/><p>- 363 (in &#39;Body and Soul but Truly One&#39;) - In Sacred Scripture the term &#34;soul&#34; often refers to human life or the entire human person. But &#34;soul&#34; also refers to the innermost aspect of man, that which is of greatest value in him, that by which he is most especially in God&#39;s image: &#34;soul&#34; signifies the spiritual principle in man.</p><br/><p>- 1021 (in &#39;The Particular Judgement&#39;) - Death puts an end to human life as the time open to either accepting or rejecting the divine grace manifested in Christ. The New Testament speaks of judgment primarily in its aspect of the final encounter with Christ in his second coming, but also repeatedly affirms that each will be rewarded immediately after death in accordance with his works and faith. the parable of the poor man Lazarus and the words of Christ on the cross to the good thief, as well as other New Testament texts speak of a final destiny of the soul -a destiny which can be different for some and for others.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5LVPuzbPDtbpNY3XO0XI3A",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "22nd Sunday in Ordinary Time (Year A) - Matt 16: 21-27",
    "release_date": "2023-09-02",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5LVPuzbPDtbpNY3XO0XI3A"
}