{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4QG7ShETo2yABA1APtuFKj/clip_390944_450944.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 15:33-39, 16:1-6 - 'Jesus gave a loud cry and breathed his last.'  Catechism of the Catholic Church Paragraphs: - 603 (in 'For our sake God made him to be sin') - Jesus did not experience reprobation as if he himself had sinned. But in the redeeming love that always united him to the Father, he assumed us in the state of our waywardness of sin, to the point that he could say in our name from the cross: \"My God, my God, why have you forsaken me?\" Having thus established him in solidarity with us sinners, God \"did not spare his own Son but gave him up for us all\", so that we might be \"reconciled to God by the death of his Son\" (abbreviated). - 2605 (in 'Jesus prays') - When the hour had come for him to fulfill the Father's plan of love, Jesus allows a glimpse of the boundless depth of his filial prayer, not only before he freely delivered himself up (“Abba . . . not my will, but yours.\"), but even in his last words on the Cross, where prayer and the gift of self are but one: \"Father, forgive them, for they know not what they do\", \"Truly, I say to you, today you will be with me in Paradise\", \"Woman, behold your son\" - \"Behold your mother\", \"I thirst.\"; \"My God, My God, why have you forsaken me?\" \"It is finished\"; \"Father, into your hands I commit my spirit!\" until the \"loud cry\" as he expires, giving up his spirit. - 444 (in 'The Only Son of God') - In the centurion's exclamation before the crucified Christ, \"Truly this man was the Son of God\", that Christian confession is already heard. Only in the Paschal mystery can the believer give the title \"Son of God\" its full meaning (abbreviated). - 641 (in 'The Appearances of the Risen One') - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ's Resurrection for the apostles themselves (abbreviated). - 2174 (in 'The Day of the Resurrection: the new creation') - Jesus rose from the dead \"on the first day of the week.\" Because it is the \"first day,\" the day of Christ's Resurrection recalls the first creation. Because it is the \"eighth day\" following the sabbath, it symbolizes the new creation ushered in by Christ's Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord's Day (he kuriake hemera, dies dominica) Sunday: \"We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead.\" - 333 (in 'Christ with all his angels') - Again, it is the angels who \"evangelize\" by proclaiming the Good News of Christ's Incarnation and Resurrection (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2705751,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5mxOhSFj1Il6CNe6gUzoCd"
    },
    "href": "https://api.spotify.com/v1/episodes/5mxOhSFj1Il6CNe6gUzoCd",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 15:33-39, 16:1-6 - &#39;Jesus gave a loud cry and breathed his last.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 603 (in &#39;For our sake God made him to be sin&#39;) - Jesus did not experience reprobation as if he himself had sinned. But in the redeeming love that always united him to the Father, he assumed us in the state of our waywardness of sin, to the point that he could say in our name from the cross: &#34;My God, my God, why have you forsaken me?&#34; Having thus established him in solidarity with us sinners, God &#34;did not spare his own Son but gave him up for us all&#34;, so that we might be &#34;reconciled to God by the death of his Son&#34; (abbreviated).</p><br/><p>- 2605 (in &#39;Jesus prays&#39;) - When the hour had come for him to fulfill the Father&#39;s plan of love, Jesus allows a glimpse of the boundless depth of his filial prayer, not only before he freely delivered himself up (“Abba . . . not my will, but yours.&#34;), but even in his last words on the Cross, where prayer and the gift of self are but one: &#34;Father, forgive them, for they know not what they do&#34;, &#34;Truly, I say to you, today you will be with me in Paradise&#34;, &#34;Woman, behold your son&#34; - &#34;Behold your mother&#34;, &#34;I thirst.&#34;; &#34;My God, My God, why have you forsaken me?&#34; &#34;It is finished&#34;; &#34;Father, into your hands I commit my spirit!&#34; until the &#34;loud cry&#34; as he expires, giving up his spirit.</p><br/><p>- 444 (in &#39;The Only Son of God&#39;) - In the centurion&#39;s exclamation before the crucified Christ, &#34;Truly this man was the Son of God&#34;, that Christian confession is already heard. Only in the Paschal mystery can the believer give the title &#34;Son of God&#34; its full meaning (abbreviated).</p><br/><p>- 641 (in &#39;The Appearances of the Risen One&#39;) - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ&#39;s Resurrection for the apostles themselves (abbreviated).</p><br/><p>- 2174 (in &#39;The Day of the Resurrection: the new creation&#39;) - Jesus rose from the dead &#34;on the first day of the week.&#34; Because it is the &#34;first day,&#34; the day of Christ&#39;s Resurrection recalls the first creation. Because it is the &#34;eighth day&#34; following the sabbath, it symbolizes the new creation ushered in by Christ&#39;s Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord&#39;s Day (he kuriake hemera, dies dominica) Sunday: &#34;We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead.&#34;</p><br/><p>- 333 (in &#39;Christ with all his angels&#39;) - Again, it is the angels who &#34;evangelize&#34; by proclaiming the Good News of Christ&#39;s Incarnation and Resurrection (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5mxOhSFj1Il6CNe6gUzoCd",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "The Commemoration of All Souls (Year B) - Mark 15:33-39, 16:1-6",
    "release_date": "2021-11-01",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5mxOhSFj1Il6CNe6gUzoCd"
}