{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/19xgXDbZH3fSMObYSBM90p/clip_916500_974200.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 9: 2-13 - 'Jesus was transfigured in their presence.'  Catechism of the Catholic Church Paragraphs: - 552 (in 'The Keys of the Kingdom') - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him (abbreviated). - 151 (in 'To Believe in Jesus Christ, the Son of God') - For a Christian, believing in God cannot be separated from believing in the One he sent, his \"beloved Son\", in whom the Father is \"well pleased\"; God tells us to listen to him. The Lord himself said to his disciples: \"Believe in God, believe also in me.\" We can believe in Jesus Christ because he is himself God, the Word made flesh: \"No one has ever seen God; the only Son, who is in the bosom of the Father, he has made him known.\" Because he \"has seen the Father\", Jesus Christ is the only one who knows him and can reveal him. - 459 (in 'Why did the Word become Flesh?') - The Word became flesh to be our model of holiness: \"Take my yoke upon you, and learn from me.\" \"I am the way, and the truth, and the life; no one comes to the Father, but by me.\" On the mountain of the Transfiguration, the Father commands: \"Listen to him!\" - 649 (in 'The Resurrection - A Work of the Holy Trinity') - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise. Elsewhere he affirms explicitly: \"I lay down my life, that I may take it again. . . I have power to lay it down, and I have power to take it again.\" \"We believe that Jesus died and rose again.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2053154,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5nBnAPjAiZggSP1YIHJhxl"
    },
    "href": "https://api.spotify.com/v1/episodes/5nBnAPjAiZggSP1YIHJhxl",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 9: 2-13 - &#39;Jesus was transfigured in their presence.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 552 (in &#39;The Keys of the Kingdom&#39;) - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him (abbreviated).</p><br/><p>- 151 (in &#39;To Believe in Jesus Christ, the Son of God&#39;) - For a Christian, believing in God cannot be separated from believing in the One he sent, his &#34;beloved Son&#34;, in whom the Father is &#34;well pleased&#34;; God tells us to listen to him. The Lord himself said to his disciples: &#34;Believe in God, believe also in me.&#34; We can believe in Jesus Christ because he is himself God, the Word made flesh: &#34;No one has ever seen God; the only Son, who is in the bosom of the Father, he has made him known.&#34; Because he &#34;has seen the Father&#34;, Jesus Christ is the only one who knows him and can reveal him.</p><br/><p>- 459 (in &#39;Why did the Word become Flesh?&#39;) - The Word became flesh to be our model of holiness: &#34;Take my yoke upon you, and learn from me.&#34; &#34;I am the way, and the truth, and the life; no one comes to the Father, but by me.&#34; On the mountain of the Transfiguration, the Father commands: &#34;Listen to him!&#34;</p><br/><p>- 649 (in &#39;The Resurrection - A Work of the Holy Trinity&#39;) - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise. Elsewhere he affirms explicitly: &#34;I lay down my life, that I may take it again. . . I have power to lay it down, and I have power to take it again.&#34; &#34;We believe that Jesus died and rose again.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5nBnAPjAiZggSP1YIHJhxl",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 6 in Ordinary Time - Mark 9: 2-13",
    "release_date": "2023-02-17",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5nBnAPjAiZggSP1YIHJhxl"
}