{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/00Uv80uHoJJH15h9wpaHKw/clip_594196_654196.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 18: 1-5, 10, 12-14 - 'Anyone who welcomes in a little child in my name welcomes me.'  Catechism of the Catholic Church Paragraphs: - 526 (in 'The Christmas Mystery') - To become a child in relation to God is the condition for entering the kingdom. For this, we must humble ourselves and become little. Even more: to become \"children of God\" we must be \"born from above\" or \"born of God\" (abbreviated). - 2785 (in 'Our Father who art in Heaven') - Second, a humble and trusting heart that enables us \"to turn and become like children\": for it is to \"little children\" that the Father is revealed (abbreviated). - 329 (in 'Who are the Angels') - With their whole beings the angels are servants and messengers of God. Because they \"always behold the face of my Father who is in heaven\" they are the \"mighty ones who do his word, hearkening to the voice of his word\" (abbreviated). - 336 (in 'The Angels in the Life of the Church') - From the beginning until death, human life is surrounded by their watchful care and intercession. \"Beside each believer stands an angel as protector and shepherd leading him to life.\" Already here on earth the Christian life shares by faith in the blessed company of angels and men united in God. - 605 (in 'God takes the initiative of universal redeeming love') - At the end of the parable of the lost sheep Jesus recalled that God’s love excludes no one: “So it is not the will of your Father who is in heaven that one of these little ones should perish.” He affirms that he came “to give his life as a ransom for many”; this last term is not restrictive, but contrasts the whole of humanity with the unique person of the redeemer who hands himself over to save us. The Church, following the apostles, teaches that Christ died for all men without exception: “There is not, never has been, and never will be a single human being for whom Christ did not suffer.” - 2822 (in 'Thy Will be Done on Earth as it is in Heaven') - Our Father “desires all men to be saved and to come to the knowledge of the truth.” He “is forbearing toward you, not wishing that any should perish\" (abbreviated)  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1508577,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5plNSGIlsZyYEeiPIFOfBT"
    },
    "href": "https://api.spotify.com/v1/episodes/5plNSGIlsZyYEeiPIFOfBT",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 18: 1-5, 10, 12-14 - &#39;Anyone who welcomes in a little child in my name welcomes me.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 526 (in &#39;The Christmas Mystery&#39;) - To become a child in relation to God is the condition for entering the kingdom. For this, we must humble ourselves and become little. Even more: to become &#34;children of God&#34; we must be &#34;born from above&#34; or &#34;born of God&#34; (abbreviated).</p><br/><p>- 2785 (in &#39;Our Father who art in Heaven&#39;) - Second, a humble and trusting heart that enables us &#34;to turn and become like children&#34;: for it is to &#34;little children&#34; that the Father is revealed (abbreviated).</p><br/><p>- 329 (in &#39;Who are the Angels&#39;) - With their whole beings the angels are servants and messengers of God. Because they &#34;always behold the face of my Father who is in heaven&#34; they are the &#34;mighty ones who do his word, hearkening to the voice of his word&#34; (abbreviated).</p><br/><p>- 336 (in &#39;The Angels in the Life of the Church&#39;) - From the beginning until death, human life is surrounded by their watchful care and intercession. &#34;Beside each believer stands an angel as protector and shepherd leading him to life.&#34; Already here on earth the Christian life shares by faith in the blessed company of angels and men united in God.</p><br/><p>- 605 (in &#39;God takes the initiative of universal redeeming love&#39;) - At the end of the parable of the lost sheep Jesus recalled that God’s love excludes no one: “So it is not the will of your Father who is in heaven that one of these little ones should perish.” He affirms that he came “to give his life as a ransom for many”; this last term is not restrictive, but contrasts the whole of humanity with the unique person of the redeemer who hands himself over to save us. The Church, following the apostles, teaches that Christ died for all men without exception: “There is not, never has been, and never will be a single human being for whom Christ did not suffer.”</p><br/><p>- 2822 (in &#39;Thy Will be Done on Earth as it is in Heaven&#39;) - Our Father “desires all men to be saved and to come to the knowledge of the truth.” He “is forbearing toward you, not wishing that any should perish&#34; (abbreviated)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5plNSGIlsZyYEeiPIFOfBT",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 19 in Ordinary Time - Matt 18: 1-5, 10, 12-14",
    "release_date": "2023-08-14",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5plNSGIlsZyYEeiPIFOfBT"
}