{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1NvnhIA726boS8R1OCWUrt/clip_1745000_1790600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 21: 15-19 - 'Feed my lambs, feed my sheep.'  Catechism of the Catholic Church Paragraphs: - 553 (in 'The Keys of the Kingdom') - The \"power of the keys\" designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: \"Feed my sheep. The power to \"bind and loose\" connotes the authority to absolve sins, to pronounce doctrinal judgements, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom (abbreviated). - 881 (in 'The Episcopal College and its head, the Pope') - The Lord made Simon alone, whom he named Peter, the \"rock\" of his Church. He gave him the keys of his Church and instituted him shepherd of the whole flock. \"The office of binding and loosing which was given to Peter was also assigned to the college of apostles united to its head.\" This pastoral office of Peter and the other apostles belongs to the Church's very foundation and is continued by the bishops under the primacy of the Pope. - 1429 (in 'The Conversion of the Baptised') - St. Peter's conversion after he had denied his master three times bears witness to this. Jesus' look of infinite mercy drew tears of repentance from Peter and, after the Lord's resurrection, a threefold affirmation of love for him. The second conversion also has a communitarian dimension, as is clear in the Lord's call to a whole Church: \"Repent!\" - 1551 (in 'In the person of Christ, the head') - This priesthood is ministerial. \"That office . . . which the Lord committed to the pastors of his people, is in the strict sense of the term a service.\" It is entirely related to Christ and to men. It depends entirely on Christ and on his unique priesthood; it has been instituted for the good of men and the communion of the Church. the sacrament of Holy Orders communicates a \"sacred power\" which is none other than that of Christ. the exercise of this authority must therefore be measured against the model of Christ, who by love made himself the least and the servant of all. \"The Lord said clearly that concern for his flock was proof of love for him.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1927743,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5RYOyoxnr0HqdBHfGyVl7S"
    },
    "href": "https://api.spotify.com/v1/episodes/5RYOyoxnr0HqdBHfGyVl7S",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 21: 15-19 - &#39;Feed my lambs, feed my sheep.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 553 (in &#39;The Keys of the Kingdom&#39;) - The &#34;power of the keys&#34; designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: &#34;Feed my sheep. The power to &#34;bind and loose&#34; connotes the authority to absolve sins, to pronounce doctrinal judgements, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom (abbreviated).</p><br/><p>- 881 (in &#39;The Episcopal College and its head, the Pope&#39;) - The Lord made Simon alone, whom he named Peter, the &#34;rock&#34; of his Church. He gave him the keys of his Church and instituted him shepherd of the whole flock. &#34;The office of binding and loosing which was given to Peter was also assigned to the college of apostles united to its head.&#34; This pastoral office of Peter and the other apostles belongs to the Church&#39;s very foundation and is continued by the bishops under the primacy of the Pope.</p><br/><p>- 1429 (in &#39;The Conversion of the Baptised&#39;) - St. Peter&#39;s conversion after he had denied his master three times bears witness to this. Jesus&#39; look of infinite mercy drew tears of repentance from Peter and, after the Lord&#39;s resurrection, a threefold affirmation of love for him. The second conversion also has a communitarian dimension, as is clear in the Lord&#39;s call to a whole Church: &#34;Repent!&#34;</p><br/><p>- 1551 (in &#39;In the person of Christ, the head&#39;) - This priesthood is ministerial. &#34;That office . . . which the Lord committed to the pastors of his people, is in the strict sense of the term a service.&#34; It is entirely related to Christ and to men. It depends entirely on Christ and on his unique priesthood; it has been instituted for the good of men and the communion of the Church. the sacrament of Holy Orders communicates a &#34;sacred power&#34; which is none other than that of Christ. the exercise of this authority must therefore be measured against the model of Christ, who by love made himself the least and the servant of all. &#34;The Lord said clearly that concern for his flock was proof of love for him.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5RYOyoxnr0HqdBHfGyVl7S",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 7 of Eastertide - John 21: 15-19",
    "release_date": "2023-05-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5RYOyoxnr0HqdBHfGyVl7S"
}