{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7idBTW5y0fB4TiOFG7gClD/clip_497131_557131.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 20: 17-28 - 'They will condemn the Son of Man to death.'  Catechism of the Catholic Church Paragraphs: - 572 (in 'Jesus Christ suffered under Pontius Pilate, was crucified, died and was buried') - Jesus' sufferings took their historical, concrete form from the fact that he was \"rejected by the elders and the chief priests and the scribes\", who handed \"him to the Gentiles to be mocked and scourged and crucified\" (abbreviated) - 2235 (in 'Duties of Civil Authorities') - Those who exercise authority should do so as a service. \"Whoever would be great among you must be your servant.\" The exercise of authority is measured morally in terms of its divine origin, its reasonable nature and its specific object. No one can command or establish what is contrary to the dignity of persons and the natural law. - 440 (in 'Christ') - He unveiled the authentic content of his messianic kingship both in the transcendent identity of the Son of Man \"who came down from heaven\", and in his redemptive mission as the suffering Servant: \"The Son of Man came not to be served but to serve, and to give his life as a ransom for many\" (abbreviated) - 601 (in 'He died for our sins in accordance with the Scriptures') - The Scriptures had foretold this divine plan of salvation through the putting to death of \"the righteous one, my Servant\" as a mystery of universal redemption, that is, as the ransom that would free men from the slavery of sin. (abbreviated) - 605 (in 'He died for our sins in accordance with the Scriptures') - He affirms that he came \"to give his life as a ransom for many\"; this last term is not restrictive, but contrasts the whole of humanity with the unique person of the redeemer who hands himself over to save us. - 622 (in 'Christ offered himself to his Father for our sins') - The redemption won by Christ consists in this, that he came \"to give his life as a ransom for many\" (Mt 20:28), that is, he \"loved [his own] to the end\" (Jn 13:1), so that they might be \"ransomed from the futile ways inherited from [their] fathers\" (I Pt 1:18). - 786 (in 'A Priestly, prophetic and royal people') - Finally, the People of God shares in the royal office of Christ. He exercises his kingship by drawing all men to himself through his death and Resurrection. Christ, King and Lord of the universe, made himself the servant of all, for he came \"not to be served but to serve, and to give his life as a ransom for many.\" For the Christian, \"to reign is to serve him,\" particularly when serving \"the poor and the suffering, in whom the Church recognizes the image of her poor and suffering founder.\" The People of God fulfills its royal dignity by a life in keeping with its vocation to serve with Christ.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1480991,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5sEbzhGXF58Vh4fdaAWA3o"
    },
    "href": "https://api.spotify.com/v1/episodes/5sEbzhGXF58Vh4fdaAWA3o",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 20: 17-28 - &#39;They will condemn the Son of Man to death.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 572 (in &#39;Jesus Christ suffered under Pontius Pilate, was crucified, died and was buried&#39;) - Jesus&#39; sufferings took their historical, concrete form from the fact that he was &#34;rejected by the elders and the chief priests and the scribes&#34;, who handed &#34;him to the Gentiles to be mocked and scourged and crucified&#34; (abbreviated)</p><br/><p>- 2235 (in &#39;Duties of Civil Authorities&#39;) - Those who exercise authority should do so as a service. &#34;Whoever would be great among you must be your servant.&#34; The exercise of authority is measured morally in terms of its divine origin, its reasonable nature and its specific object. No one can command or establish what is contrary to the dignity of persons and the natural law.</p><br/><p>- 440 (in &#39;Christ&#39;) - He unveiled the authentic content of his messianic kingship both in the transcendent identity of the Son of Man &#34;who came down from heaven&#34;, and in his redemptive mission as the suffering Servant: &#34;The Son of Man came not to be served but to serve, and to give his life as a ransom for many&#34; (abbreviated)</p><br/><p>- 601 (in &#39;He died for our sins in accordance with the Scriptures&#39;) - The Scriptures had foretold this divine plan of salvation through the putting to death of &#34;the righteous one, my Servant&#34; as a mystery of universal redemption, that is, as the ransom that would free men from the slavery of sin. (abbreviated)</p><br/><p>- 605 (in &#39;He died for our sins in accordance with the Scriptures&#39;) - He affirms that he came &#34;to give his life as a ransom for many&#34;; this last term is not restrictive, but contrasts the whole of humanity with the unique person of the redeemer who hands himself over to save us.</p><br/><p>- 622 (in &#39;Christ offered himself to his Father for our sins&#39;) - The redemption won by Christ consists in this, that he came &#34;to give his life as a ransom for many&#34; (Mt 20:28), that is, he &#34;loved [his own] to the end&#34; (Jn 13:1), so that they might be &#34;ransomed from the futile ways inherited from [their] fathers&#34; (I Pt 1:18).</p><br/><p>- 786 (in &#39;A Priestly, prophetic and royal people&#39;) - Finally, the People of God shares in the royal office of Christ. He exercises his kingship by drawing all men to himself through his death and Resurrection. Christ, King and Lord of the universe, made himself the servant of all, for he came &#34;not to be served but to serve, and to give his life as a ransom for many.&#34; For the Christian, &#34;to reign is to serve him,&#34; particularly when serving &#34;the poor and the suffering, in whom the Church recognizes the image of her poor and suffering founder.&#34; The People of God fulfills its royal dignity by a life in keeping with its vocation to serve with Christ.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5sEbzhGXF58Vh4fdaAWA3o",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 2 of Lent - Matt 20: 17-28",
    "release_date": "2023-03-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5sEbzhGXF58Vh4fdaAWA3o"
}