{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6eYFzOPFtd85BjKRJ0DtEi/clip_311200_360500.mp3",
    "description": "Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy  John 11: 45-56 - 'Jesus was to die to gather together the scattered children of God.'  Catechism of the Catholic Church Paragraphs: - 596 (in 'Divisions among the Jewish authorities concerning Jesus') - The religious authorities in Jerusalem were not unanimous about what stance to take towards Jesus. The Pharisees threatened to excommunicate his followers. To those who feared that \"everyone will believe in him, and the Romans will come and destroy both our holy place and our nation\", the high priest Caiaphas replied by prophesying: \"It is expedient for you that one man should die for the people, and that the whole nation should not perish.\" (abbreviated) - 58 (in 'the Covenant with Noah') - The covenant with Noah remains in force during the times of the Gentiles, until the universal proclamation of the Gospel. The Bible venerates several great figures among the Gentiles: Abel the just, the king-priest Melchisedek - a figure of Christ - and the upright \"Noah, Daniel, and Job\". Scripture thus expresses the heights of sanctity that can be reached by those who live according to the covenant of Noah, waiting for Christ to \"gather into one the children of God who are scattered abroad\". - 60 (in 'God chooses Abraham') - The people descended from Abraham would be the trustee of the promise made to the patriarchs, the chosen people, called to prepare for that day when God would gather all his children into the unity of the Church. They would be the root on to which the Gentiles would be grafted, once they came to believe. - 706 (in 'The Spirit of the Promise') - Against all human hope, God promises descendants to Abraham, as the fruit of faith and of the power of the Holy Spirit. In Abraham's progeny all the nations of the earth will be blessed. This progeny will be Christ himself, in whom the outpouring of the Holy Spirit will \"gather into one the children of God who are scattered abroad.\" (abbreviated) - 2793 (in 'Our Father') - The baptized cannot pray to \"our\" Father without bringing before him all those for whom he gave his beloved Son. God's love has no bounds, neither should our prayer. Praying \"our\" Father opens to us the dimensions of his love revealed in Christ: praying with and for all who do not yet know him, so that Christ may \"gather into one the children of God.\" (abbreviated)  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1170007,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5wMefaBKE9un8L64Oxrqlb"
    },
    "href": "https://api.spotify.com/v1/episodes/5wMefaBKE9un8L64Oxrqlb",
    "html_description": "<p>Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 11: 45-56 - &#39;Jesus was to die to gather together the scattered children of God.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 596 (in &#39;Divisions among the Jewish authorities concerning Jesus&#39;) - The religious authorities in Jerusalem were not unanimous about what stance to take towards Jesus. The Pharisees threatened to excommunicate his followers. To those who feared that &#34;everyone will believe in him, and the Romans will come and destroy both our holy place and our nation&#34;, the high priest Caiaphas replied by prophesying: &#34;It is expedient for you that one man should die for the people, and that the whole nation should not perish.&#34; (abbreviated)</p><br/><p>- 58 (in &#39;the Covenant with Noah&#39;) - The covenant with Noah remains in force during the times of the Gentiles, until the universal proclamation of the Gospel. The Bible venerates several great figures among the Gentiles: Abel the just, the king-priest Melchisedek - a figure of Christ - and the upright &#34;Noah, Daniel, and Job&#34;. Scripture thus expresses the heights of sanctity that can be reached by those who live according to the covenant of Noah, waiting for Christ to &#34;gather into one the children of God who are scattered abroad&#34;.</p><br/><p>- 60 (in &#39;God chooses Abraham&#39;) - The people descended from Abraham would be the trustee of the promise made to the patriarchs, the chosen people, called to prepare for that day when God would gather all his children into the unity of the Church. They would be the root on to which the Gentiles would be grafted, once they came to believe.</p><br/><p>- 706 (in &#39;The Spirit of the Promise&#39;) - Against all human hope, God promises descendants to Abraham, as the fruit of faith and of the power of the Holy Spirit. In Abraham&#39;s progeny all the nations of the earth will be blessed. This progeny will be Christ himself, in whom the outpouring of the Holy Spirit will &#34;gather into one the children of God who are scattered abroad.&#34; (abbreviated)</p><br/><p>- 2793 (in &#39;Our Father&#39;) - The baptized cannot pray to &#34;our&#34; Father without bringing before him all those for whom he gave his beloved Son. God&#39;s love has no bounds, neither should our prayer. Praying &#34;our&#34; Father opens to us the dimensions of his love revealed in Christ: praying with and for all who do not yet know him, so that Christ may &#34;gather into one the children of God.&#34; (abbreviated)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5wMefaBKE9un8L64Oxrqlb",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 5 of Lent - John 11: 45-56",
    "release_date": "2023-03-31",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5wMefaBKE9un8L64Oxrqlb"
}