{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/2IRQMlaB1i5PvtC0EdCyGw/clip_231377_291377.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 10: 25-37 - 'The good Samaritan.'  Catechism of the Catholic Church Paragraphs: - 2083 (in 'You Shall love to Lord your God with all your heart, and with all your soul, and with all your mind') - Jesus summed up man's duties toward God in this saying: \"You shall love the Lord your God with all your heart, and with all your soul, and with all your mind.\" This immediately echoes the solemn call: \"Hear, O Israel: the LORD our God is one LORD.\" God has loved us first. the love of the One God is recalled in the first of the \"ten words.\" the commandments then make explicit the response of love that man is called to give to his God. - 2822 (in 'Thy Will be done on Earth as it is in Heaven') - Our Father \"desires all men to be saved and to come to the knowledge of the truth.\" He \"is forbearing toward you, not wishing that any should perish.\" His commandment is \"that you love one another; even as I have loved you, that you also love one another.\" This commandment summarizes all the others and expresses his entire will. - 1825 (in 'Charity') - Christ died out of love for us, while we were still \"enemies.\" The Lord asks us to love as he does, even our enemies, to make ourselves the neighbor of those farthest away, and to love children and the poor as Christ himself (abbreviated). - 1293 (in 'The Signs and the Rite of Confirmation') - In treating the rite of Confirmation, it is fitting to consider the sign of anointing and what it signifies and imprints: a spiritual seal. Anointing, in Biblical and other ancient symbolism, is rich in meaning: oil is a sign of abundance and joy; it cleanses (anointing before and after a bath) and limbers (the anointing of athletes and wrestlers); oil is a sign of healing, since it is soothing to bruises and wounds; and it makes radiant with beauty, health, and strength.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1898184,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5yDf246kslpylc5QHzko4D"
    },
    "href": "https://api.spotify.com/v1/episodes/5yDf246kslpylc5QHzko4D",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 10: 25-37 - &#39;The good Samaritan.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2083 (in &#39;You Shall love to Lord your God with all your heart, and with all your soul, and with all your mind&#39;) - Jesus summed up man&#39;s duties toward God in this saying: &#34;You shall love the Lord your God with all your heart, and with all your soul, and with all your mind.&#34; This immediately echoes the solemn call: &#34;Hear, O Israel: the LORD our God is one LORD.&#34; God has loved us first. the love of the One God is recalled in the first of the &#34;ten words.&#34; the commandments then make explicit the response of love that man is called to give to his God.</p><br/><p>- 2822 (in &#39;Thy Will be done on Earth as it is in Heaven&#39;) - Our Father &#34;desires all men to be saved and to come to the knowledge of the truth.&#34; He &#34;is forbearing toward you, not wishing that any should perish.&#34; His commandment is &#34;that you love one another; even as I have loved you, that you also love one another.&#34; This commandment summarizes all the others and expresses his entire will.</p><br/><p>- 1825 (in &#39;Charity&#39;) - Christ died out of love for us, while we were still &#34;enemies.&#34; The Lord asks us to love as he does, even our enemies, to make ourselves the neighbor of those farthest away, and to love children and the poor as Christ himself (abbreviated).</p><br/><p>- 1293 (in &#39;The Signs and the Rite of Confirmation&#39;) - In treating the rite of Confirmation, it is fitting to consider the sign of anointing and what it signifies and imprints: a spiritual seal. Anointing, in Biblical and other ancient symbolism, is rich in meaning: oil is a sign of abundance and joy; it cleanses (anointing before and after a bath) and limbers (the anointing of athletes and wrestlers); oil is a sign of healing, since it is soothing to bruises and wounds; and it makes radiant with beauty, health, and strength.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5yDf246kslpylc5QHzko4D",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 27 in Ordinary Time - Luke 10: 25-37",
    "release_date": "2023-10-08",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5yDf246kslpylc5QHzko4D"
}