{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7pc9lRVYCUuuAl2x4ZNds7/clip_1320700_1369500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 1: 39-56 - 'The almighty has done great things for me.'  Catechism of the Catholic Church Paragraphs: - 2619 (in 'The Prayer of the Virgin Mary') - That is why the Canticle of Mary, The Magnificat (Latin) or Megalynei (byzantine) is the song both of the Mother of God and of the Church; the song of the Daughter of Zion and of the new People of God; the song of thanksgiving for the fullness of graces poured out in the economy of salvation and the song of the \"poor\" whose hope is met by the fulfillment of the promises made to our ancestors, \"to Abraham and to his posterity for ever.\" - 2097 (in 'Adoration') - To adore God is to acknowledge, in respect and absolute submission, the \"nothingness of the creature\" who would not exist but for God. To adore God is to praise and exalt him and to humble oneself, as Mary did in the Magnificat, confessing with gratitude that he has done great things and holy is his name (abbreviated). - 148 (in 'Mary - Blessed is she who believed') - The Virgin Mary most perfectly embodies the obedience of faith. By faith Mary welcomes the tidings and promise brought by the angel Gabriel, believing that \"with God nothing will be impossible\" and so giving her assent: \"Behold I am the handmaid of the Lord; let it be [done] to me according to your word.\" Elizabeth greeted her: \"Blessed is she who believed that there would be a fulfilment of what was spoken to her from the Lord.\" It is for this faith that all generations have called Mary blessed. - 971 (in 'Devotion to the Blessed Virgin Mary') - \"All generations will call me blessed\": \"The Church's devotion to the Blessed Virgin is intrinsic to Christian worship.\" The Church rightly honors \"the Blessed Virgin with special devotion (abbreviated). - 273 (in 'The Mystery of God's apparent powerlessness') - Only faith can embrace the mysterious ways of God's almighty power. This faith glories in its weaknesses in order to draw to itself Christ's power. The Virgin Mary is the supreme model of this faith, for she believed that \"nothing will be impossible with God\", and was able to magnify the Lord: \"For he who is mighty has done great things for me, and holy is his name.\" (abbreviated). - 2599 (in 'Jesus prays') - The Son of God who became Son of the Virgin learned to pray according to his human heart. He learns the formulas of prayer from his mother, who kept in her heart and meditated upon all the \"great things\" done by the Almighty (abbreviated) - 422 (in 'The Good News: God has sent his son') - But when the time had fully come, God sent forth his Son, born of a woman, born under the law, to redeem those who were under the law, so that we might receive adoption as sons.' This is 'the gospel of Jesus Christ, the Son of God': God has visited his people. He has fulfilled the promise he made to Abraham and his descendants. He acted far beyond all expectation - he has sent his own 'beloved Son'. - 523 (in 'The Preparations') - 717 (in 'John, precursor, prophet and baptist') - 2676-2677 (in 'Communion with the Holy Mother of God') - 448 (in 'LORD') - 495 (in 'Mary's Divine Motherhood') - 148 (in 'Blessed is she who believed') - 722 (in 'Rejoice, you who are full of grace') - 2675 (in 'In Communion with the Holy Mother of God') - 2807 (in 'Hallowed be thy name')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1778648,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/5ZkOlSYfK6KPMpBHHXEyzi"
    },
    "href": "https://api.spotify.com/v1/episodes/5ZkOlSYfK6KPMpBHHXEyzi",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 1: 39-56 - &#39;The almighty has done great things for me.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2619 (in &#39;The Prayer of the Virgin Mary&#39;) - That is why the Canticle of Mary, The Magnificat (Latin) or Megalynei (byzantine) is the song both of the Mother of God and of the Church; the song of the Daughter of Zion and of the new People of God; the song of thanksgiving for the fullness of graces poured out in the economy of salvation and the song of the &#34;poor&#34; whose hope is met by the fulfillment of the promises made to our ancestors, &#34;to Abraham and to his posterity for ever.&#34;</p><br/><p>- 2097 (in &#39;Adoration&#39;) - To adore God is to acknowledge, in respect and absolute submission, the &#34;nothingness of the creature&#34; who would not exist but for God. To adore God is to praise and exalt him and to humble oneself, as Mary did in the Magnificat, confessing with gratitude that he has done great things and holy is his name (abbreviated).</p><br/><p>- 148 (in &#39;Mary - Blessed is she who believed&#39;) - The Virgin Mary most perfectly embodies the obedience of faith. By faith Mary welcomes the tidings and promise brought by the angel Gabriel, believing that &#34;with God nothing will be impossible&#34; and so giving her assent: &#34;Behold I am the handmaid of the Lord; let it be [done] to me according to your word.&#34; Elizabeth greeted her: &#34;Blessed is she who believed that there would be a fulfilment of what was spoken to her from the Lord.&#34; It is for this faith that all generations have called Mary blessed.</p><br/><p>- 971 (in &#39;Devotion to the Blessed Virgin Mary&#39;) - &#34;All generations will call me blessed&#34;: &#34;The Church&#39;s devotion to the Blessed Virgin is intrinsic to Christian worship.&#34; The Church rightly honors &#34;the Blessed Virgin with special devotion (abbreviated).</p><br/><p>- 273 (in &#39;The Mystery of God&#39;s apparent powerlessness&#39;) - Only faith can embrace the mysterious ways of God&#39;s almighty power. This faith glories in its weaknesses in order to draw to itself Christ&#39;s power. The Virgin Mary is the supreme model of this faith, for she believed that &#34;nothing will be impossible with God&#34;, and was able to magnify the Lord: &#34;For he who is mighty has done great things for me, and holy is his name.&#34; (abbreviated).</p><br/><p>- 2599 (in &#39;Jesus prays&#39;) - The Son of God who became Son of the Virgin learned to pray according to his human heart. He learns the formulas of prayer from his mother, who kept in her heart and meditated upon all the &#34;great things&#34; done by the Almighty (abbreviated)</p><br/><p>- 422 (in &#39;The Good News: God has sent his son&#39;) - But when the time had fully come, God sent forth his Son, born of a woman, born under the law, to redeem those who were under the law, so that we might receive adoption as sons.&#39; This is &#39;the gospel of Jesus Christ, the Son of God&#39;: God has visited his people. He has fulfilled the promise he made to Abraham and his descendants. He acted far beyond all expectation - he has sent his own &#39;beloved Son&#39;.</p><br/><p>- 523 (in &#39;The Preparations&#39;)</p><br/><p>- 717 (in &#39;John, precursor, prophet and baptist&#39;)</p><br/><p>- 2676-2677 (in &#39;Communion with the Holy Mother of God&#39;)</p><br/><p>- 448 (in &#39;LORD&#39;)</p><br/><p>- 495 (in &#39;Mary&#39;s Divine Motherhood&#39;)</p><br/><p>- 148 (in &#39;Blessed is she who believed&#39;)</p><br/><p>- 722 (in &#39;Rejoice, you who are full of grace&#39;)</p><br/><p>- 2675 (in &#39;In Communion with the Holy Mother of God&#39;)</p><br/><p>- 2807 (in &#39;Hallowed be thy name&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "5ZkOlSYfK6KPMpBHHXEyzi",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of the Visitation of the Blessed Virgin Mary - Luke 1: 39-56",
    "release_date": "2023-05-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:5ZkOlSYfK6KPMpBHHXEyzi"
}