{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5Pzdf0EYbttKIDSfBUZByT/clip_1643200_1692200.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 25: 14-30 - 'You have been faithful in small things: come and join in your master's happiness.'  Catechism of the Catholic Church Paragraphs: - 546 (in 'The Proclamation of the Kingdom of God') - Jesus' invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word?What use has he made of the talents he has received? (abbreviated). - 1936 (in 'Equality and Differences among men') - On coming into the world, man is not equipped with everything he needs for developing his bodily and spiritual life. He needs others. Differences appear tied to age, physical abilities, intellectual or moral aptitudes, the benefits derived from social commerce, and the distribution of wealth. The \"talents\" are not distributed equally. - 1029 (in 'Heaven') - In the glory of heaven the blessed continue joyfully to fulfill God's will in relation to other men and to all creation. Already they reign with Christ; with him \"they shall reign for ever and ever.\" - 1720 (in 'Christian Beatitude') - The New Testament uses several expressions to characterize the beatitude to which God calls man: the coming of the Kingdom of God, the vision of God, entering into the joy of the Lord, entering into God's rest.\" - 2683 (in 'A Cloud of Witnesses') - The witnesses who have preceded us into the kingdom, especially those whom the Church recognizes as saints, share in the living tradition of prayer by the example of their lives, the transmission of their writings, and their prayer today. They contemplate God, praise him and constantly care for those whom they have left on earth. When they entered into the joy of their Master, they were \"put in charge of many things.\" Their intercession is their most exalted service to God's plan. We can and should ask them to intercede for us and for the whole world.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2424929,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/60aZVObZKzIkJFhIgLGLXF"
    },
    "href": "https://api.spotify.com/v1/episodes/60aZVObZKzIkJFhIgLGLXF",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 25: 14-30 - &#39;You have been faithful in small things: come and join in your master&#39;s happiness.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 546 (in &#39;The Proclamation of the Kingdom of God&#39;) - Jesus&#39; invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word?What use has he made of the talents he has received? (abbreviated).</p><br/><p>- 1936 (in &#39;Equality and Differences among men&#39;) - On coming into the world, man is not equipped with everything he needs for developing his bodily and spiritual life. He needs others. Differences appear tied to age, physical abilities, intellectual or moral aptitudes, the benefits derived from social commerce, and the distribution of wealth. The &#34;talents&#34; are not distributed equally.</p><br/><p>- 1029 (in &#39;Heaven&#39;) - In the glory of heaven the blessed continue joyfully to fulfill God&#39;s will in relation to other men and to all creation. Already they reign with Christ; with him &#34;they shall reign for ever and ever.&#34;</p><br/><p>- 1720 (in &#39;Christian Beatitude&#39;) - The New Testament uses several expressions to characterize the beatitude to which God calls man: the coming of the Kingdom of God, the vision of God, entering into the joy of the Lord, entering into God&#39;s rest.&#34;</p><br/><p>- 2683 (in &#39;A Cloud of Witnesses&#39;) - The witnesses who have preceded us into the kingdom, especially those whom the Church recognizes as saints, share in the living tradition of prayer by the example of their lives, the transmission of their writings, and their prayer today. They contemplate God, praise him and constantly care for those whom they have left on earth. When they entered into the joy of their Master, they were &#34;put in charge of many things.&#34; Their intercession is their most exalted service to God&#39;s plan. We can and should ask them to intercede for us and for the whole world.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "60aZVObZKzIkJFhIgLGLXF",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 21 in Ordinary Time - Matt 25: 14-30",
    "release_date": "2023-09-01",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:60aZVObZKzIkJFhIgLGLXF"
}