{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0hEvL83YPpupjNP0pGw2Dn/clip_612437_672437.mp3",
    "description": "Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy  Luke 19: 28-40 - 'Blessings on him who comes in the name of the Lord.'  Catechism of the Catholic Church Paragraphs: - 559-560 (in 'Jesus' messianic entrance into Jerusalem') - How will Jerusalem welcome her Messiah? Although Jesus had always refused popular attempts to make him king, he chooses the time and prepares the details for his messianic entry into the city of \"his father David\". Acclaimed as son of David, as the one who brings salvation (Hosanna means \"Save!\" or \"Give      salvation!\"), the \"King of glory\" enters his City \"riding on an ass\". Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth. and so the subjects of his kingdom on that day are children and God's poor, who acclaim him as had the angels when they announced him to the shepherds. Their acclamation, \"Blessed be he who comes in the name of the Lord\", is taken up by the Church in the Sanctus of the Eucharistic liturgy that introduces the memorial of the Lord's Passover. Jesus' entry into Jerusalem manifested the coming of the kingdom that the King-Messiah was going to accomplish by the Passover of his Death and Resurrection. It is with the celebration of that entry on Palm Sunday that the Church's liturgy solemnly opens Holy Week.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1387601,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/613Vpwqls5C0441yYsOuqo"
    },
    "href": "https://api.spotify.com/v1/episodes/613Vpwqls5C0441yYsOuqo",
    "html_description": "<p>Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 19: 28-40 - &#39;Blessings on him who comes in the name of the Lord.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 559-560 (in &#39;Jesus&#39; messianic entrance into Jerusalem&#39;) - How will Jerusalem welcome her Messiah? Although Jesus had always refused popular attempts to make him king, he chooses the time and prepares the details for his messianic entry into the city of &#34;his father David&#34;. Acclaimed as son of David, as the one who brings salvation (Hosanna means &#34;Save!&#34; or &#34;Give      salvation!&#34;), the &#34;King of glory&#34; enters his City &#34;riding on an ass&#34;. Jesus conquers the Daughter of Zion, a figure of his Church, neither by ruse nor by violence, but by the humility that bears witness to the truth. and so the subjects of his kingdom on that day are children and God&#39;s poor, who acclaim him as had the angels when they announced him to the shepherds. Their acclamation, &#34;Blessed be he who comes in the name of the Lord&#34;, is taken up by the Church in the Sanctus of the Eucharistic liturgy that introduces the memorial of the Lord&#39;s Passover.</p><br/><p>Jesus&#39; entry into Jerusalem manifested the coming of the kingdom that the King-Messiah was going to accomplish by the Passover of his Death and Resurrection. It is with the celebration of that entry on Palm Sunday that the Church&#39;s liturgy solemnly opens Holy Week.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "613Vpwqls5C0441yYsOuqo",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Palm Sunday (Year C) - Luke 19: 28-40",
    "release_date": "2022-04-09",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:613Vpwqls5C0441yYsOuqo"
}