{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3uD9G7LWGlffgx5HQlI0Lw/clip_1096700_1142100.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 14: 15-21 - 'I shall ask the Father and he will give you another Advocate.'  Catechism of the Catholic Church Paragraphs: - 729 (in 'Christ Jesus') - Only when the hour has arrived for his glorification does Jesus promise the coming of the Holy Spirit, since his Death and Resurrection will fulfill the promise made to the fathers. The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus' prayer; he will be sent by the Father in Jesus' name; and Jesus will send him from the Father's side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment. - 2615 (in 'Jesus teaches us how to pray') - Even more, what the Father gives us when our prayer is united with that of Jesus is \"another Counselor, to be with you for ever, even the Spirit of truth.\" This new dimension of prayer and of its circumstances is displayed throughout the farewell discourse (abbreviated). - 692 (in 'Titles of the Holy Spirit') - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the \"Paraclete,\" literally, \"he who is called to one's side,\" advocatus. \"Paraclete\" is commonly translated by \"consoler,\" and Jesus is the first consoler. The Lord also called the Holy Spirit \"the Spirit of truth. - 243 (in 'The Father and the Son revealed by the Spirit') - Before his Passover, Jesus announced the sending of \"another Paraclete\" (Advocate), the Holy Spirit. At work since creation, having previously \"spoken through the prophets\", the Spirit will now be with and in the disciples, to teach them and guide them \"into all the truth\". The Holy Spirit is thus revealed as another divine person with Jesus and the Father. - 687 (in 'I Believe in the Holy Spirit') - The Spirit of truth who \"unveils\" Christ to us \"will not speak on his own. Such properly divine self-effacement explains why \"the world cannot receive (him), because it neither sees him nor knows him,\" while those who believe in Christ know the Spirit because he dwells with them (abbreviated). - 2466 (in 'Living in the Truth') - To follow Jesus is to live in \"the Spirit of truth,\" whom the Father sends in his name and who leads \"into all the truth\" (abbreviated). - 2671 (in 'Come, Holy Spirit') - The traditional form of petition to the Holy Spirit is to invoke the Father through Christ our Lord to give us the Consoler Spirit. Jesus insists on this petition to be made in his name at the very moment when he promises the gift of the Spirit of Truth (abbreviated). - 788 (in 'The Church is communion with Jesus') - When his visible presence was taken from them, Jesus did not leave his disciples orphans. He promised to remain with them until the end of time; he sent them his Spirit. As a result communion with Jesus has become, in a way, more intense: \"By communicating his Spirit, Christ mystically constitutes as his body those brothers of his who are called together from every nation.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1199612,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/62AAwFETfwq34TeY9NKnx7"
    },
    "href": "https://api.spotify.com/v1/episodes/62AAwFETfwq34TeY9NKnx7",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 14: 15-21 - &#39;I shall ask the Father and he will give you another Advocate.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 729 (in &#39;Christ Jesus&#39;) - Only when the hour has arrived for his glorification does Jesus promise the coming of the Holy Spirit, since his Death and Resurrection will fulfill the promise made to the fathers. The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus&#39; prayer; he will be sent by the Father in Jesus&#39; name; and Jesus will send him from the Father&#39;s side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment.</p><br/><p>- 2615 (in &#39;Jesus teaches us how to pray&#39;) - Even more, what the Father gives us when our prayer is united with that of Jesus is &#34;another Counselor, to be with you for ever, even the Spirit of truth.&#34; This new dimension of prayer and of its circumstances is displayed throughout the farewell discourse (abbreviated).</p><br/><p>- 692 (in &#39;Titles of the Holy Spirit&#39;) - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the &#34;Paraclete,&#34; literally, &#34;he who is called to one&#39;s side,&#34; advocatus. &#34;Paraclete&#34; is commonly translated by &#34;consoler,&#34; and Jesus is the first consoler. The Lord also called the Holy Spirit &#34;the Spirit of truth.</p><br/><p>- 243 (in &#39;The Father and the Son revealed by the Spirit&#39;) - Before his Passover, Jesus announced the sending of &#34;another Paraclete&#34; (Advocate), the Holy Spirit. At work since creation, having previously &#34;spoken through the prophets&#34;, the Spirit will now be with and in the disciples, to teach them and guide them &#34;into all the truth&#34;. The Holy Spirit is thus revealed as another divine person with Jesus and the Father.</p><br/><p>- 687 (in &#39;I Believe in the Holy Spirit&#39;) - The Spirit of truth who &#34;unveils&#34; Christ to us &#34;will not speak on his own. Such properly divine self-effacement explains why &#34;the world cannot receive (him), because it neither sees him nor knows him,&#34; while those who believe in Christ know the Spirit because he dwells with them (abbreviated).</p><br/><p>- 2466 (in &#39;Living in the Truth&#39;) - To follow Jesus is to live in &#34;the Spirit of truth,&#34; whom the Father sends in his name and who leads &#34;into all the truth&#34; (abbreviated).</p><br/><p>- 2671 (in &#39;Come, Holy Spirit&#39;) - The traditional form of petition to the Holy Spirit is to invoke the Father through Christ our Lord to give us the Consoler Spirit. Jesus insists on this petition to be made in his name at the very moment when he promises the gift of the Spirit of Truth (abbreviated).</p><br/><p>- 788 (in &#39;The Church is communion with Jesus&#39;) - When his visible presence was taken from them, Jesus did not leave his disciples orphans. He promised to remain with them until the end of time; he sent them his Spirit. As a result communion with Jesus has become, in a way, more intense: &#34;By communicating his Spirit, Christ mystically constitutes as his body those brothers of his who are called together from every nation.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "62AAwFETfwq34TeY9NKnx7",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "6th Sunday of Easter (Year A) - John 14: 15-21",
    "release_date": "2023-05-13",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:62AAwFETfwq34TeY9NKnx7"
}