{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1szuVIuF2YLRyC1TAu3wLt/clip_238100_287000.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 12: 8-12 - 'If you declare yourselves for me, I will declare myself for you.'  Catechism of the Catholic Church Paragraphs: - 333 (in 'Christ with all his angels') - Again, it is the angels who \"evangelize\" by proclaiming the Good News of Christ's Incarnation and Resurrection. They will be present at Christ's return, which they will announce, to serve at his Judgement (abbreviated). - 1864 (in      'The Different Kinds of Sins') - “Therefore I tell you, every sin and blasphemy will be forgiven men, but the blasphemy against the Spirit will not be forgiven. There are no limits to the mercy of God, but anyone who deliberately refuses to accept his mercy by repenting, rejects the forgiveness of his sins and the salvation offered by the Holy Spirit. Such hardness of heart can lead to final impenitence and eternal loss. - JPII's encyclical, Dominum Et Vivificantem (On The Holy Spirit in the Life of the Church and the World, paragraph 46): \"Why is blasphemy against the Holy Spirit unforgivable? How should this blasphemy be understood ? St. Thomas Aquinas replies that it is a question of a sin that is \"unforgivable by its very nature, insofar as it excludes the elements through which the forgiveness of sin takes place.\" According to such an exegesis, \"blasphemy\" does not properly consist in offending against the Holy Spirit in words; it consists rather in the refusal to accept the salvation which God offers to man through the Holy Spirit, working through the power of the Cross. If man rejects the \"convincing concerning sin\" which comes from the Holy Spirit and which has the power to save, he also rejects the \"coming\" of the Counselor-that \"coming\" which was accomplished in the Paschal Mystery, in union with the redemptive power of Christ's Blood: the Blood which \"purifies the conscience from dead works.\" We know that the result of such a purification is the forgiveness of sins. Therefore, whoever rejects the Spirit and the Blood remains in \"dead works,\" in sin. And the blasphemy against the Holy Spirit consists precisely in the radical refusal to accept this forgiveness, of which he is the intimate giver and which presupposes the genuine conversion which he brings about in the conscience. If Jesus says that blasphemy against the Holy Spirit cannot be forgiven either in this life or in the next, it is because this \"non-forgiveness\" is linked, as to its cause, to \"non-repentance,\" in other words to the radical refusal to be converted. .... Blasphemy against the Holy Spirit, then, is the sin committed by the person who claims to have a \"right\" to persist in evil-in any sin at all-and who thus rejects Redemption. One closes oneself up in sin, thus making impossible one's conversion, and consequently the remission of sins, which one considers not essential or not important for one's life. This is a state of spiritual ruin, because blasphemy against the Holy Spirit does not allow one to escape from one's self-imposed imprisonment and open oneself to the divine sources of the purification of consciences and of the remission of sins.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1218165,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/68CSCVHPcOGrW1YfFtcusZ"
    },
    "href": "https://api.spotify.com/v1/episodes/68CSCVHPcOGrW1YfFtcusZ",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 12: 8-12 - &#39;If you declare yourselves for me, I will declare myself for you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 333 (in &#39;Christ with all his angels&#39;) - Again, it is the angels who &#34;evangelize&#34; by proclaiming the Good News of Christ&#39;s Incarnation and Resurrection. They will be present at Christ&#39;s return, which they will announce, to serve at his Judgement (abbreviated).</p><br/><p>- 1864 (in      &#39;The Different Kinds of Sins&#39;) - “Therefore I tell you, every sin and blasphemy will be forgiven men, but the blasphemy against the Spirit will not be forgiven. There are no limits to the mercy of God, but anyone who deliberately refuses to accept his mercy by repenting, rejects the forgiveness of his sins and the salvation offered by the Holy Spirit. Such hardness of heart can lead to final impenitence and eternal loss.</p><br/><p>- JPII&#39;s encyclical, Dominum Et Vivificantem (On The Holy Spirit in the Life of the Church and the World, paragraph 46):</p><br/><p>&#34;Why is blasphemy against the Holy Spirit unforgivable? How should this blasphemy be understood ? St. Thomas Aquinas replies that it is a question of a sin that is &#34;unforgivable by its very nature, insofar as it excludes the elements through which the forgiveness of sin takes place.&#34;</p><br/><p>According to such an exegesis, &#34;blasphemy&#34; does not properly consist in offending against the Holy Spirit in words; it consists rather in the refusal to accept the salvation which God offers to man through the Holy Spirit, working through the power of the Cross. If man rejects the &#34;convincing concerning sin&#34; which comes from the Holy Spirit and which has the power to save, he also rejects the &#34;coming&#34; of the Counselor-that &#34;coming&#34; which was accomplished in the Paschal Mystery, in union with the redemptive power of Christ&#39;s Blood: the Blood which &#34;purifies the conscience from dead works.&#34;</p><br/><p>We know that the result of such a purification is the forgiveness of sins. Therefore, whoever rejects the Spirit and the Blood remains in &#34;dead works,&#34; in sin. And the blasphemy against the Holy Spirit consists precisely in the radical refusal to accept this forgiveness, of which he is the intimate giver and which presupposes the genuine conversion which he brings about in the conscience. If Jesus says that blasphemy against the Holy Spirit cannot be forgiven either in this life or in the next, it is because this &#34;non-forgiveness&#34; is linked, as to its cause, to &#34;non-repentance,&#34; in other words to the radical refusal to be converted. .... Blasphemy against the Holy Spirit, then, is the sin committed by the person who claims to have a &#34;right&#34; to persist in evil-in any sin at all-and who thus rejects Redemption. One closes oneself up in sin, thus making impossible one&#39;s conversion, and consequently the remission of sins, which one considers not essential or not important for one&#39;s life. This is a state of spiritual ruin, because blasphemy against the Holy Spirit does not allow one to escape from one&#39;s self-imposed imprisonment and open oneself to the divine sources of the purification of consciences and of the remission of sins.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "68CSCVHPcOGrW1YfFtcusZ",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 28 in Ordinary Time - Luke 12: 8-12",
    "release_date": "2023-10-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:68CSCVHPcOGrW1YfFtcusZ"
}