{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5JW9VBava9fL9CSc5RdKkq/clip_222800_284600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 7: 15-20 - 'You will be able to tell them by their fruits.'  Catechism of the Catholic Church Paragraphs: - 2285 (in 'Respect for the Souls of Others: Scandal') - Scandal takes on a particular gravity by reason of the authority of those who cause it or the weakness of those who are scandalized. It prompted our Lord to utter this curse: \"Whoever causes one of these little ones who believe in me to sin, it would be better for him to have a great millstone fastened round his neck and to be drowned in the depth of the sea.\" Scandal is grave when given by those who by nature or office are obliged to teach and educate others. Jesus reproaches the scribes and Pharisees on this account: he likens them to wolves in sheep's clothing. - 2005 (in 'Grace') - Since it belongs to the supernatural order, grace escapes our experience and cannot be known except by faith. We cannot therefore rely on our feelings or our works to conclude that we are justified and saved. However, according to the Lord's words \"Thus you will know them by their fruits\" - reflection on God's blessings in our life and in the lives of the saints offers us a guarantee that grace is at work in us and spurs us on to an ever greater faith and an attitude of trustful poverty. A pleasing illustration of this attitude is found in the reply of St. Joan of Arc to a question posed as a trap by her ecclesiastical judges: \"Asked if she knew that she was in God's grace, she replied: 'If I am not, may it please God to put me in it; if I am, may it please God to keep me there.'\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 988914,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/69GEp3x1gZZiC3z6UWeMwM"
    },
    "href": "https://api.spotify.com/v1/episodes/69GEp3x1gZZiC3z6UWeMwM",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 7: 15-20 - &#39;You will be able to tell them by their fruits.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2285 (in &#39;Respect for the Souls of Others: Scandal&#39;) - Scandal takes on a particular gravity by reason of the authority of those who cause it or the weakness of those who are scandalized. It prompted our Lord to utter this curse: &#34;Whoever causes one of these little ones who believe in me to sin, it would be better for him to have a great millstone fastened round his neck and to be drowned in the depth of the sea.&#34; Scandal is grave when given by those who by nature or office are obliged to teach and educate others. Jesus reproaches the scribes and Pharisees on this account: he likens them to wolves in sheep&#39;s clothing.</p><br/><p>- 2005 (in &#39;Grace&#39;) - Since it belongs to the supernatural order, grace escapes our experience and cannot be known except by faith. We cannot therefore rely on our feelings or our works to conclude that we are justified and saved. However, according to the Lord&#39;s words &#34;Thus you will know them by their fruits&#34; - reflection on God&#39;s blessings in our life and in the lives of the saints offers us a guarantee that grace is at work in us and spurs us on to an ever greater faith and an attitude of trustful poverty. A pleasing illustration of this attitude is found in the reply of St. Joan of Arc to a question posed as a trap by her ecclesiastical judges: &#34;Asked if she knew that she was in God&#39;s grace, she replied: &#39;If I am not, may it please God to put me in it; if I am, may it please God to keep me there.&#39;&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "69GEp3x1gZZiC3z6UWeMwM",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 12 in Ordinary Time - Matt 7: 15-20",
    "release_date": "2023-06-27",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:69GEp3x1gZZiC3z6UWeMwM"
}