{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4AXi1AYTidv7hAxl9FSdgA/clip_307500_365850.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 22: 34-40 - 'The commandments of love.'  Catechism of the Catholic Church Paragraphs: - 581 (in 'Jesus and the Law') - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people \"as one who had authority, and not as their scribes\" (abbreviated). - 2055 (in 'The Ten Commandments') - When someone asks him, \"Which commandment in the Law is the greatest?\" Jesus replies: \"You shall love the Lord your God with all your heart, and with all your soul, and with all your mind. This is thegreatest and first commandment. and a second is like it: You shall love your neighbor as yourself. On these two commandments hang all the Law and the prophets.\" The Decalogue must be interpreted in light of this twofold yet single commandment of love, the fullness of the Law: the commandments: \"You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,\" and any other commandment, are summed up in this sentence: \"You shall love your neighbor as yourself.\" Love does no wrong to a neighbor; therefore love is the fulfilling of the law. - 2083 (in 'you Shall love the Lord to your God with all your heart, and with all your soul, and with all your mind') - Jesus summed up man's duties toward God in this saying: \"You shall love the Lord your God with all your heart, and      with all your soul, and with all your mind. This immediately echoes the solemn call: \"Hear, O Israel: the LORD our God is one LORD.\" God has loved us first. the love of the One God is recalled in the first of the \"ten words.\" the commandments then make explicit the response of love that man is called to give to his God. - 1824 (in 'Charity') - Fruit of the Spirit and fullness of the Law, charity keeps the commandments of God and his Christ: \"Abide in my love. If you keep my commandments, you will abide in my love.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1109658,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6H03q4xWFyIvq4XzK4qNh2"
    },
    "href": "https://api.spotify.com/v1/episodes/6H03q4xWFyIvq4XzK4qNh2",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 22: 34-40 - &#39;The commandments of love.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 581 (in &#39;Jesus and the Law&#39;) - The Jewish people and their spiritual leaders viewed Jesus as a rabbi. He often argued within the framework of rabbinical interpretation of the Law. Yet Jesus could not help but offend the teachers of the Law, for he was not content to propose his interpretation alongside theirs but taught the people &#34;as one who had authority, and not as their scribes&#34; (abbreviated).</p><br/><p>- 2055 (in &#39;The Ten Commandments&#39;) - When someone asks him, &#34;Which commandment in the Law is the greatest?&#34; Jesus replies: &#34;You shall love the Lord your God with all your heart, and with all your soul, and with all your mind. This is thegreatest and first commandment. and a second is like it: You shall love your neighbor as yourself. On these two commandments hang all the Law and the prophets.&#34; The Decalogue must be interpreted in light of this twofold yet single commandment of love, the fullness of the Law: the commandments: &#34;You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,&#34; and any other commandment, are summed up in this sentence: &#34;You shall love your neighbor as yourself.&#34; Love does no wrong to a neighbor; therefore love is the fulfilling of the law.</p><br/><p>- 2083 (in &#39;you Shall love the Lord to your God with all your heart, and with all your soul, and with all your mind&#39;) - Jesus summed up man&#39;s duties toward God in this saying: &#34;You shall love the Lord your God with all your heart, and      with all your soul, and with all your mind. This immediately echoes the solemn call: &#34;Hear, O Israel: the LORD our God is one LORD.&#34; God has loved us first. the love of the One God is recalled in the first of the &#34;ten words.&#34; the commandments then make explicit the response of love that man is called to give to his God.</p><br/><p>- 1824 (in &#39;Charity&#39;) - Fruit of the Spirit and fullness of the Law, charity keeps the commandments of God and his Christ: &#34;Abide in my love. If you keep my commandments, you will abide in my love.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6H03q4xWFyIvq4XzK4qNh2",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 20 in Ordinary Time - Matt 22: 34-40",
    "release_date": "2023-08-24",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6H03q4xWFyIvq4XzK4qNh2"
}