{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7hDPdehCTm0L7bl8UAimbQ/clip_988300_1046800.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 6: 35-40 - 'It is my Father's will that whoever sees the Son should have eternal life.'  Catechism of the Catholic Church Paragraphs: - 606 (in 'Christ's whole life is an offering to the Father') - The Son of God, who came down \"from heaven, not to do (his) own will, but the will of him who sent (him)\", said on coming into the world, \"Lo, I have come to do your will, O God.\" \"and by that will we have been sanctified through the offering of the body of Jesus Christ once for all.\" From the first moment of his Incarnation the Son embraces the Father's plan of divine salvation in his redemptive mission: \"My food is to do the will of him who sent me, and to accomplish his work.\" The sacrifice of Jesus \"for the sins of the whole world\" expresses his loving communion with the Father. \"The Father loves me, because I lay down my life\", said the Lord, \"(for) I do as the Father has commanded me, so that the world may know that I love the Father.\" - 2824 (in 'Thy Will be done on earth as it is in heaven') - In Christ, and through his human will, the will of the Father has been perfectly fulfilled once for all. Jesus said on entering into this world: \"Lo, I have come to do your will, O God.\" Only Jesus can say: \"I always do what is pleasing to him.\" In the prayer of his agony, he consents totally to this will: \"not my will, but yours be done.\" For this reason Jesus \"gave himself for our sins to deliver us from the present evil age, according to the will of our God and Father.\" \"and by that will we have been sanctified through the offering of the body of Jesus Christ once for all.\" - 989 (in 'I believe in the resurrection of the body') - We firmly believe, and hence we hope that, just as Christ is truly risen from the dead and lives for ever, so after death the righteous will live for ever with the risen Christ and he will raise them up on the last day. Our resurrection, like his own, will be the work of the Most Holy Trinity (abbreviated). - 1001 (in 'How do the dead rise?') - When? Definitively \"at the last day,\" \"at the end of the world.\" Indeed, the resurrection of the dead is closely associated with Christ's Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel's call, and with the sound of the trumpet of God. and the dead in Christ will rise first. - 161 (in 'The Necessity of faith') - Believing in Jesus Christ and in the One who sent him for our salvation is necessary for obtaining that salvation (abbreviated). - 994 (in 'The Progressive Revelation of the Resurrection') - But there is more. Jesus links faith in the resurrection to his own person: \"I am the Resurrection and the life.\" It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood (abbreviated). Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1259589,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6iUBGUAhVh5QilkfUIbjgr"
    },
    "href": "https://api.spotify.com/v1/episodes/6iUBGUAhVh5QilkfUIbjgr",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 6: 35-40 - &#39;It is my Father&#39;s will that whoever sees the Son should have eternal life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 606 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The Son of God, who came down &#34;from heaven, not to do (his) own will, but the will of him who sent (him)&#34;, said on coming into the world, &#34;Lo, I have come to do your will, O God.&#34; &#34;and by that will we have been sanctified through the offering of the body of Jesus Christ once for all.&#34; From the first moment of his Incarnation the Son embraces the Father&#39;s plan of divine salvation in his redemptive mission: &#34;My food is to do the will of him who sent me, and to accomplish his work.&#34; The sacrifice of Jesus &#34;for the sins of the whole world&#34; expresses his loving communion with the Father. &#34;The Father loves me, because I lay down my life&#34;, said the Lord, &#34;(for) I do as the Father has commanded me, so that the world may know that I love the Father.&#34;</p><br/><p>- 2824 (in &#39;Thy Will be done on earth as it is in heaven&#39;) - In Christ, and through his human will, the will of the Father has been perfectly fulfilled once for all. Jesus said on entering into this world: &#34;Lo, I have come to do your will, O God.&#34; Only Jesus can say: &#34;I always do what is pleasing to him.&#34; In the prayer of his agony, he consents totally to this will: &#34;not my will, but yours be done.&#34; For this reason Jesus &#34;gave himself for our sins to deliver us from the present evil age, according to the will of our God and Father.&#34; &#34;and by that will we have been sanctified through the offering of the body of Jesus Christ once for all.&#34;</p><br/><p>- 989 (in &#39;I believe in the resurrection of the body&#39;) - We firmly believe, and hence we hope that, just as Christ is truly risen from the dead and lives for ever, so after death the righteous will live for ever with the risen Christ and he will raise them up on the last day. Our resurrection, like his own, will be the work of the Most Holy Trinity (abbreviated).</p><br/><p>- 1001 (in &#39;How do the dead rise?&#39;) - When? Definitively &#34;at the last day,&#34; &#34;at the end of the world.&#34; Indeed, the resurrection of the dead is closely associated with Christ&#39;s Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel&#39;s call, and with the sound of the trumpet of God. and the dead in Christ will rise first.</p><br/><p>- 161 (in &#39;The Necessity of faith&#39;) - Believing in Jesus Christ and in the One who sent him for our salvation is necessary for obtaining that salvation (abbreviated).</p><br/><p>- 994 (in &#39;The Progressive Revelation of the Resurrection&#39;) - But there is more. Jesus links faith in the resurrection to his own person: &#34;I am the Resurrection and the life.&#34; It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood (abbreviated).<br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6iUBGUAhVh5QilkfUIbjgr",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Wednesday of Week 3 of Eastertide - John 6: 35-40",
    "release_date": "2023-04-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6iUBGUAhVh5QilkfUIbjgr"
}