{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/5VhbbBwrGS1Iu57SIL3352/clip_212600_255300.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Mark 11: 11-26 - 'The fig tree; the cleansing of the Temple.'  Catechism of the Catholic Church Paragraphs: - 2610 (in 'Jesus teaches us how to pray') - Just as Jesus prays to the Father and gives thanks before receiving his gifts, so he teaches us filial boldness: \"Whatever you ask in prayer, believe that you receive it, and you will.\" Such is the power of prayer and of faith that does not doubt: \"all things are possible to him who believes.\" (abbreviated). - 2840-2841 (in 'and forgive us our trespasses') - Now - and this is daunting - this outpouring of mercy cannot penetrate our hearts as long as we have not forgiven those who have trespassed against us. Love, like the Body of Christ, is indivisible; we cannot love the God we cannot see if we do not love the brother or sister we do see. In refusing to forgive our brothers and sisters, our hearts are closed and their hardness makes them impervious to the Father's merciful love; but in confessing our sins, our hearts are opened to his grace. This petition is so important that it is the only one to which the Lord returns and which he develops explicitly in the Sermon on the Mount. This crucial requirement of the covenant mystery is impossible for man. But \"with God all things are possible.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2486926,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6kFYpp5CthBJbHPNENl8Yk"
    },
    "href": "https://api.spotify.com/v1/episodes/6kFYpp5CthBJbHPNENl8Yk",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Mark 11: 11-26 - &#39;The fig tree; the cleansing of the Temple.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2610 (in &#39;Jesus teaches us how to pray&#39;) - Just as Jesus prays to the Father and gives thanks before receiving his gifts, so he teaches us filial boldness: &#34;Whatever you ask in prayer, believe that you receive it, and you will.&#34; Such is the power of prayer and of faith that does not doubt: &#34;all things are possible to him who believes.&#34; (abbreviated).</p><br/><p>- 2840-2841 (in &#39;and forgive us our trespasses&#39;) - Now - and this is daunting - this outpouring of mercy cannot penetrate our hearts as long as we have not forgiven those who have trespassed against us. Love, like the Body of Christ, is indivisible; we cannot love the God we cannot see if we do not love the brother or sister we do see. In refusing to forgive our brothers and sisters, our hearts are closed and their hardness makes them impervious to the Father&#39;s merciful love; but in confessing our sins, our hearts are opened to his grace. This petition is so important that it is the only one to which the Lord returns and which he develops explicitly in the Sermon on the Mount. This crucial requirement of the covenant mystery is impossible for man. But &#34;with God all things are possible.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6kFYpp5CthBJbHPNENl8Yk",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Friday of Week 8 in Ordinary Time - Mark 11: 11-26",
    "release_date": "2023-06-01",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6kFYpp5CthBJbHPNENl8Yk"
}