{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7Be9XGs837R1NJg3Yd77IL/clip_676400_743600.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 11: 1-45 - 'I am the resurrection and the life.'  Catechism of the Catholic Church Paragraphs: - 994 (in 'The Progressive Revelation of the Resurrection') - But there is more. Jesus links faith in the resurrection to his own person: \"I am the Resurrection and the life.\" It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the \"sign of Jonah,\" The sign of the temple: he announces that he will be put to death but rise thereafter on the third day. - 1001 (in 'How do the dead rise?') - When? Definitively \"at the last day,\" \"at the end of the world.\" Indeed, the resurrection of the dead is closely associated with Christ's Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel's call, and with the sound of the trumpet of God, and the dead in Christ will rise first. - 472 (in 'How is the Son of God man?') - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, \"increase in wisdom and in stature, and in favour with God and man\", and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking \"the form of a slave\". - 627 (in 'You will not let your Holy One see corruption') - Both of these statements can be said of Christ: \"He was cut off out of the land of the living\", and \"My flesh will dwell in hope. For you will not abandon my soul to Hades, nor let your Holy One see corruption.\" Jesus' Resurrection \"on the third day\" was the sign of this, also because bodily decay was held to begin on the fourth day after death (abbreviated). - 2604 (in 'Jesus Prays') - The second prayer, before the raising of Lazarus, is recorded by St. John. Thanksgiving precedes the event: \"Father, I thank you for having heard me,\" which implies that the Father always hears his petitions. Jesus immediately adds: \"I know that you always hear me,\" which implies that Jesus, on his part, constantly made such petitions. Jesus' prayer, characterized by thanksgiving, reveals to us how to ask: before the gift is given, Jesus commits himself to the One who in giving gives himself. the Giver is more precious than the gift; he is the \"treasure\"; in him abides his Son's heart; the gift is given \"as well\" (abbreviated). - 640 (in 'The Empty Tomb') - The disciple \"whom Jesus loved\" affirmed that when he entered the empty tomb and discovered \"the linen cloths lying there\", \"he saw and believed\". This suggests that he realized from the empty tomb's condition that the absence of Jesus' body could not have been of human doing and that Jesus had not simply returned to earthly life as had been the case with Lazarus (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 825539,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6klDpFFZIeZDDjfO0pgkow"
    },
    "href": "https://api.spotify.com/v1/episodes/6klDpFFZIeZDDjfO0pgkow",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 11: 1-45 - &#39;I am the resurrection and the life.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 994 (in &#39;The Progressive Revelation of the Resurrection&#39;) - But there is more. Jesus links faith in the resurrection to his own person: &#34;I am the Resurrection and the life.&#34; It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the &#34;sign of Jonah,&#34; The sign of the temple: he announces that he will be put to death but rise thereafter on the third day.</p><br/><p>- 1001 (in &#39;How do the dead rise?&#39;) - When? Definitively &#34;at the last day,&#34; &#34;at the end of the world.&#34; Indeed, the resurrection of the dead is closely associated with Christ&#39;s Parousia: For the Lord himself will descend from heaven, with a cry of command, with the archangel&#39;s call, and with the sound of the trumpet of God, and the dead in Christ will rise first.</p><br/><p>- 472 (in &#39;How is the Son of God man?&#39;) - This human soul that the Son of God assumed is endowed with a true human knowledge. As such, this knowledge could not in itself be unlimited: it was exercised in the historical conditions of his existence in space and time. This is why the Son of God could, when he became man, &#34;increase in wisdom and in stature, and in favour with God and man&#34;, and would even have to inquire for himself about what one in the human condition can learn only from experience. This corresponded to the reality of his voluntary emptying of himself, taking &#34;the form of a slave&#34;.</p><br/><p>- 627 (in &#39;You will not let your Holy One see corruption&#39;) - Both of these statements can be said of Christ: &#34;He was cut off out of the land of the living&#34;, and &#34;My flesh will dwell in hope. For you will not abandon my soul to Hades, nor let your Holy One see corruption.&#34; Jesus&#39; Resurrection &#34;on the third day&#34; was the sign of this, also because bodily decay was held to begin on the fourth day after death (abbreviated).</p><br/><p>- 2604 (in &#39;Jesus Prays&#39;) - The second prayer, before the raising of Lazarus, is recorded by St. John. Thanksgiving precedes the event: &#34;Father, I thank you for having heard me,&#34; which implies that the Father always hears his petitions. Jesus immediately adds: &#34;I know that you always hear me,&#34; which implies that Jesus, on his part, constantly made such petitions. Jesus&#39; prayer, characterized by thanksgiving, reveals to us how to ask: before the gift is given, Jesus commits himself to the One who in giving gives himself. the Giver is more precious than the gift; he is the &#34;treasure&#34;; in him abides his Son&#39;s heart; the gift is given &#34;as well&#34; (abbreviated).</p><br/><p>- 640 (in &#39;The Empty Tomb&#39;) - The disciple &#34;whom Jesus loved&#34; affirmed that when he entered the empty tomb and discovered &#34;the linen cloths lying there&#34;, &#34;he saw and believed&#34;. This suggests that he realized from the empty tomb&#39;s condition that the absence of Jesus&#39; body could not have been of human doing and that Jesus had not simply returned to earthly life as had been the case with Lazarus (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6klDpFFZIeZDDjfO0pgkow",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "5th Sunday of Lent (Year A) - John 11: 1-45",
    "release_date": "2023-03-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6klDpFFZIeZDDjfO0pgkow"
}