{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/49nvPhBYbtcmKhyVOYrflk/clip_331500_394900.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 2: 13-25 - 'Destroy this Sanctuary and in three days I will raise it up.'  Catechism of the Catholic Church Paragraphs: - 583-584 (In 'Jesus and The Temple) - Like the prophets before him Jesus expressed the deepest respect for the Temple in Jerusalem...Jesus went up to the Temple as the privileged place of encounter with God. For him, the Temple was the dwelling of his Father, a house of prayer, and he was angered that its outer court had become a place of commerce. He drove merchants out of it because of jealous love for his Father: “You shall not make my Father’s house a house of trade. His disciples remembered that it was written, ‘Zeal for your house will consume me.’” (abbreviated) - 586 (in 'Jesus and the Temple') - Far from having been hostile to the Temple...He even identified himself with the Temple by presenting himself as God’s definitive dwelling-place among men. Therefore his being put to bodily death presaged the destruction of the Temple, which would manifest the dawning of a new age in the history of salvation: “The hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.” (abbreviated). - 575 (in 'Jesus and Israel') - Many of Jesus' deeds and words constituted a \"sign of contradiction\", but more so for the religious authorities in Jerusalem, whom the Gospel according to John often calls simply \"the Jews\", than for the ordinary People of God (abbreviated). - 994 (in 'The Progressive Revelation of the Resurrection') - But there is more. Jesus links faith in the resurrection to his own person: \"I am the Resurrection and the life.\" It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the \"sign of Jonah,\" The sign of the temple: he announces that he will be put to death but rise thereafter on the third day. - 473 (in 'Christ's soul and his human knowledge') - But at the same time, this truly human knowledge of God's Son expressed the divine life of his person. \"The human nature of God's Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.\" Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father. The Son in his human knowledge also showed the divine penetration he had into the secret thoughts of human hearts.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1662665,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6LQIb6XPwJZQsLwyaCej73"
    },
    "href": "https://api.spotify.com/v1/episodes/6LQIb6XPwJZQsLwyaCej73",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 2: 13-25 - &#39;Destroy this Sanctuary and in three days I will raise it up.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 583-584 (In &#39;Jesus and The Temple) - Like the prophets before him Jesus expressed the deepest respect for the Temple in Jerusalem...Jesus went up to the Temple as the privileged place of encounter with God. For him, the Temple was the dwelling of his Father, a house of prayer, and he was angered that its outer court had become a place of commerce. He drove merchants out of it because of jealous love for his Father: “You shall not make my Father’s house a house of trade. His disciples remembered that it was written, ‘Zeal for your house will consume me.’” (abbreviated)</p><br/><p>- 586 (in &#39;Jesus and the Temple&#39;) - Far from having been hostile to the Temple...He even identified himself with the Temple by presenting himself as God’s definitive dwelling-place among men. Therefore his being put to bodily death presaged the destruction of the Temple, which would manifest the dawning of a new age in the history of salvation: “The hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.” (abbreviated).</p><br/><p>- 575 (in &#39;Jesus and Israel&#39;) - Many of Jesus&#39; deeds and words constituted a &#34;sign of contradiction&#34;, but more so for the religious authorities in Jerusalem, whom the Gospel according to John often calls simply &#34;the Jews&#34;, than for the ordinary People of God (abbreviated).</p><br/><p>- 994 (in &#39;The Progressive Revelation of the Resurrection&#39;) - But there is more. Jesus links faith in the resurrection to his own person: &#34;I am the Resurrection and the life.&#34; It is Jesus himself who on the last day will raise up those who have believed in him, who have eaten his body and drunk his blood. Already now in this present life he gives a sign and pledge of this by restoring some of the dead to life, announcing thereby his own Resurrection, though it was to be of another order. He speaks of this unique event as the &#34;sign of Jonah,&#34; The sign of the temple: he announces that he will be put to death but rise thereafter on the third day.</p><br/><p>- 473 (in &#39;Christ&#39;s soul and his human knowledge&#39;) - But at the same time, this truly human knowledge of God&#39;s Son expressed the divine life of his person. &#34;The human nature of God&#39;s Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.&#34; Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father. The Son in his human knowledge also showed the divine penetration he had into the secret thoughts of human hearts.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6LQIb6XPwJZQsLwyaCej73",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "3rd Sunday of Lent (Year B) - John 2: 13-25",
    "release_date": "2021-03-06",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6LQIb6XPwJZQsLwyaCej73"
}