{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0JtRFdPGUxYwzs6Xvu4g3w/clip_284663_344663.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Luke 6: 27-38 - 'Love your enemies.'  Catechism of the Catholic Church Paragraphs: - 1669 (in 'The Characteristics of Sacramentals') - Sacramentals derive from the baptismal priesthood: every baptized person is called to be a \"blessing,\" and to bless. Hence lay people may preside at certain blessings; the more a blessing concerns ecclesial and sacramental life, the more is its administration reserved to the ordained ministry (bishops, priests, or deacons). - 1789 (in 'To Choose in Accord with Conscience') - Some rules apply in every case: One may never do evil so that good may result from it - the Golden Rule: \"Whatever you wish that men would do to you, do so to them.\" - 1970 (in 'The New Law') - The Law of the Gospel requires us to make the decisive choice between \"the two ways\" and to put into practice the words of the Lord. It is summed up in the Golden Rule, \"Whatever you wish that men would do to you, do so to them; this is the law and the prophets.\" - 1458 (in 'The Confession of Sins') - Without being strictly necessary, confession of everyday faults (venial sins) is nevertheless strongly recommended by the Church. Indeed the regular confession of our venial sins helps us form our conscience, fight against evil tendencies, let ourselves be healed by Christ and progress in the life of the Spirit. By receiving more frequently through this sacrament the gift of the Father's mercy, we are spurred to be merciful as he is merciful (abbreviated) - 2842 (in 'as we forgive those who trespass against us') - This \"as\" is not unique in Jesus' teaching: \"You, therefore, must be perfect, as your heavenly Father is perfect\"; \"Be merciful, even as your Father is merciful\"; \"A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another.\" It is impossible to keep the Lord's commandment by imitating the divine model from outside; there has to be a vital participation, coming from the depths of the heart, in the holiness and the mercy and the love of our God. Only the Spirit by whom we live can make \"ours\" the same mind that was in Christ Jesus. Then the unity of forgiveness becomes possible and we find ourselves \"forgiving one another, as God in Christ forgave\" us.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1795041,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6RtX8LtJ7PUakYB2yNRUGl"
    },
    "href": "https://api.spotify.com/v1/episodes/6RtX8LtJ7PUakYB2yNRUGl",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Luke 6: 27-38 - &#39;Love your enemies.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1669 (in &#39;The Characteristics of Sacramentals&#39;) - Sacramentals derive from the baptismal priesthood: every baptized person is called to be a &#34;blessing,&#34; and to bless. Hence lay people may preside at certain blessings; the more a blessing concerns ecclesial and sacramental life, the more is its administration reserved to the ordained ministry (bishops, priests, or deacons).</p><br/><p>- 1789 (in &#39;To Choose in Accord with Conscience&#39;) - Some rules apply in every case: One may never do evil so that good may result from it - the Golden Rule: &#34;Whatever you wish that men would do to you, do so to them.&#34;</p><br/><p>- 1970 (in &#39;The New Law&#39;) - The Law of the Gospel requires us to make the decisive choice between &#34;the two ways&#34; and to put into practice the words of the Lord. It is summed up in the Golden Rule, &#34;Whatever you wish that men would do to you, do so to them; this is the law and the prophets.&#34;</p><br/><p>- 1458 (in &#39;The Confession of Sins&#39;) - Without being strictly necessary, confession of everyday faults (venial sins) is nevertheless strongly recommended by the Church. Indeed the regular confession of our venial sins helps us form our conscience, fight against evil tendencies, let ourselves be healed by Christ and progress in the life of the Spirit. By receiving more frequently through this sacrament the gift of the Father&#39;s mercy, we are spurred to be merciful as he is merciful (abbreviated)</p><br/><p>- 2842 (in &#39;as we forgive those who trespass against us&#39;) - This &#34;as&#34; is not unique in Jesus&#39; teaching: &#34;You, therefore, must be perfect, as your heavenly Father is perfect&#34;; &#34;Be merciful, even as your Father is merciful&#34;; &#34;A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another.&#34; It is impossible to keep the Lord&#39;s commandment by imitating the divine model from outside; there has to be a vital participation, coming from the depths of the heart, in the holiness and the mercy and the love of our God. Only the Spirit by whom we live can make &#34;ours&#34; the same mind that was in Christ Jesus. Then the unity of forgiveness becomes possible and we find ourselves &#34;forgiving one another, as God in Christ forgave&#34; us.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6RtX8LtJ7PUakYB2yNRUGl",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 23 in Ordinary Time - Luke 6: 27-38",
    "release_date": "2023-09-13",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6RtX8LtJ7PUakYB2yNRUGl"
}