{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1Y5PMpSJGnjtiiNYwhQs9a/clip_511149_571149.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  John 19: 31-37 - 'Out of his pierced side there came out blood and water.'  Catechism of the Catholic Church Paragraphs: - 641 (in 'The Appearances of the Risen One') - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One (abbreviated). - 478 (in 'The Heart of the Incarnate Word') - Jesus knew and loved us each and all during his life, his agony and his Passion, and gave himself up for each one of us: \"The Son of God. . . loved me and gave himself for me.\" He has loved us all with a human heart. For this reason, the Sacred Heart of Jesus, pierced by our sins and for our salvation, \"is quite rightly considered the chief sign and symbol of that. . . love with which the divine Redeemer continually loves the eternal Father and all human beings\" without exception. - 694 (in 'Symbols of the Holy Spirit') - Water. the symbolism of water signifies the Holy Spirit's action in Baptism, since after the invocation of the Holy Spirit it becomes the efficacious sacramental sign of new birth: just as the gestation of our first birth took place in water, so the water of Baptism truly signifies that our birth into the divine life is given to us in the Holy Spirit. As \"by one Spirit we were all baptized,\" so we are also \"made to drink of one Spirit.\" Thus the Spirit is also personally the living water welling up from Christ crucified as its source and welling up in us to eternal life. - 1225 (in 'Christ's Baptism') - The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible \"to be born of water and the Spirit\" in order to enter the Kingdom of God (abbreviated). - 608 (in 'The Lamb who takes away the sin of the world') - After agreeing to baptize him along with the sinners, John the Baptist looked at Jesus and pointed him out as the \"Lamb of God, who takes away the sin of the world\". By doing so, he reveals that Jesus is at the same time the suffering Servant who silently allows himself to be led to the slaughter and who bears the sin of the multitudes, and also the Paschal Lamb, the symbol of Israel's redemption at the first Passover. Christ's whole life expresses his mission: \"to serve, and to give his life as a ransom for many.\" - 1432 (in 'Interior Penance') - God gives us the strength to begin anew. It is in discovering the greatness of God's love that our heart is shaken by the horror and weight of sin and begins to fear offending God by sin and being separated from him. the human heart is converted by looking upon him whom our sins have pierced: Let us fix our eyes on Christ's blood and understand how precious it is to his Father, for, poured out for our salvation it has brought to the whole world the grace of repentance (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1666147,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6t6WVvCtFRLeJwYpEPaR5c"
    },
    "href": "https://api.spotify.com/v1/episodes/6t6WVvCtFRLeJwYpEPaR5c",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 19: 31-37 - &#39;Out of his pierced side there came out blood and water.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 641 (in &#39;The Appearances of the Risen One&#39;) - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One (abbreviated).</p><br/><p>- 478 (in &#39;The Heart of the Incarnate Word&#39;) - Jesus knew and loved us each and all during his life, his agony and his Passion, and gave himself up for each one of us: &#34;The Son of God. . . loved me and gave himself for me.&#34; He has loved us all with a human heart. For this reason, the Sacred Heart of Jesus, pierced by our sins and for our salvation, &#34;is quite rightly considered the chief sign and symbol of that. . . love with which the divine Redeemer continually loves the eternal Father and all human beings&#34; without exception.</p><br/><p>- 694 (in &#39;Symbols of the Holy Spirit&#39;) - Water. the symbolism of water signifies the Holy Spirit&#39;s action in Baptism, since after the invocation of the Holy Spirit it becomes the efficacious sacramental sign of new birth: just as the gestation of our first birth took place in water, so the water of Baptism truly signifies that our birth into the divine life is given to us in the Holy Spirit. As &#34;by one Spirit we were all baptized,&#34; so we are also &#34;made to drink of one Spirit.&#34; Thus the Spirit is also personally the living water welling up from Christ crucified as its source and welling up in us to eternal life.</p><br/><p>- 1225 (in &#39;Christ&#39;s Baptism&#39;) - The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible &#34;to be born of water and the Spirit&#34; in order to enter the Kingdom of God (abbreviated).</p><br/><p>- 608 (in &#39;The Lamb who takes away the sin of the world&#39;) - After agreeing to baptize him along with the sinners, John the Baptist looked at Jesus and pointed him out as the &#34;Lamb of God, who takes away the sin of the world&#34;. By doing so, he reveals that Jesus is at the same time the suffering Servant who silently allows himself to be led to the slaughter and who bears the sin of the multitudes, and also the Paschal Lamb, the symbol of Israel&#39;s redemption at the first Passover. Christ&#39;s whole life expresses his mission: &#34;to serve, and to give his life as a ransom for many.&#34;</p><br/><p>- 1432 (in &#39;Interior Penance&#39;) - God gives us the strength to begin anew. It is in discovering the greatness of God&#39;s love that our heart is shaken by the horror and weight of sin and begins to fear offending God by sin and being separated from him. the human heart is converted by looking upon him whom our sins have pierced: Let us fix our eyes on Christ&#39;s blood and understand how precious it is to his Father, for, poured out for our salvation it has brought to the whole world the grace of repentance (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6t6WVvCtFRLeJwYpEPaR5c",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of the Most Sacred Heart of Jesus (Year B) - John 19: 31-37",
    "release_date": "2021-06-10",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6t6WVvCtFRLeJwYpEPaR5c"
}