{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0ERQu73Z8sRFwqdVk8q4NP/clip_174732_234732.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 16: 13-19 - 'You are Peter and on this rock I will build my church.'  Catechism of the Catholic Church Paragraphs: - 424 (in 'The Good News: God has sent his son') - Moved by the grace of the Holy Spirit and drawn by the Father, we believe in Jesus and confess: 'You are the Christ, the Son of the living God.'8 On the rock of this faith confessed by St. Peter, Christ built his Church. - 881 (in 'The Episcopal Colleage and its head, the Pope') - The Lord made Simon alone, whom he named Peter, the \"rock\" of his Church. He gave him the keys of his Church and instituted him shepherd of the whole flock. \"The office of binding and loosing which was given to Peter was also assigned to the college of apostles united to its head.\" This pastoral office of Peter and the other apostles belongs to the Church's very foundation and is continued by the bishops under the primacy of the Pope. - 552-553 (in 'The Keys to the Kingdom') - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him. Through a revelation from the Father, Peter had confessed: \"You are the Christ, the Son of the living God.\" Our Lord then declared to him: \"You are Peter, and on this rock I will build my Church, and the gates of Hades will not prevail against it.\" Christ, the \"living Stone\",thus assures his Church, built on Peter, of victory over the powers of death. Because of the faith he confessed Peter will remain the unshakable rock of the Church. His mission will be to keep this faith from every lapse and to strengthen his brothers in it. Jesus entrusted a specific authority to Peter: \"I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.\"287 The \"power of the keys\" designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: \"Feed my sheep.\"288 The power to \"bind and loose\" connotes the authority to absolve sins, to pronounce doctrinal judgments, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles289 and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom. - 869 (in 'The Church is Apostolic') - The Church is apostolic. She is built on a lasting foundation: \"the twelve apostles of the Lamb\" (Rev 21:14). She is indestructible (cf. Mt 16:18). She is upheld infallibly in the truth: Christ governs her through Peter and the other apostles, who are present in their successors, the Pope and the college of bishops. - 1444 (in 'Reconciliation with the Church') - In imparting to his apostles his own power to forgive sins the Lord also gives them the authority to reconcile sinners with the Church. This ecclesial dimension of their task is expressed most notably in Christ's solemn words to Simon Peter: \"I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.\" \"The office of binding and loosing which was given to Peter was also assigned to the college of the apostles united to its head.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2352785,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/6u1BG7ZORRk3mTlOJplCz5"
    },
    "href": "https://api.spotify.com/v1/episodes/6u1BG7ZORRk3mTlOJplCz5",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 16: 13-19 - &#39;You are Peter and on this rock I will build my church.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 424 (in &#39;The Good News: God has sent his son&#39;) - Moved by the grace of the Holy Spirit and drawn by the Father, we believe in Jesus and confess: &#39;You are the Christ, the Son of the living God.&#39;8 On the rock of this faith confessed by St. Peter, Christ built his Church.</p><br/><p>- 881 (in &#39;The Episcopal Colleage and its head, the Pope&#39;) - The Lord made Simon alone, whom he named Peter, the &#34;rock&#34; of his Church. He gave him the keys of his Church and instituted him shepherd of the whole flock. &#34;The office of binding and loosing which was given to Peter was also assigned to the college of apostles united to its head.&#34; This pastoral office of Peter and the other apostles belongs to the Church&#39;s very foundation and is continued by the bishops under the primacy of the Pope.</p><br/><p>- 552-553 (in &#39;The Keys to the Kingdom&#39;) - Simon Peter holds the first place in the college of the Twelve; Jesus entrusted a unique mission to him. Through a revelation from the Father, Peter had confessed: &#34;You are the Christ, the Son of the living God.&#34; Our Lord then declared to him: &#34;You are Peter, and on this rock I will build my Church, and the gates of Hades will not prevail against it.&#34; Christ, the &#34;living Stone&#34;,thus assures his Church, built on Peter, of victory over the powers of death. Because of the faith he confessed Peter will remain the unshakable rock of the Church. His mission will be to keep this faith from every lapse and to strengthen his brothers in it. Jesus entrusted a specific authority to Peter: &#34;I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.&#34;287 The &#34;power of the keys&#34; designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: &#34;Feed my sheep.&#34;288 The power to &#34;bind and loose&#34; connotes the authority to absolve sins, to pronounce doctrinal judgments, and to make disciplinary decisions in the Church. Jesus entrusted this authority to the Church through the ministry of the apostles289 and in particular through the ministry of Peter, the only one to whom he specifically entrusted the keys of the kingdom.</p><br/><p>- 869 (in &#39;The Church is Apostolic&#39;) - The Church is apostolic. She is built on a lasting foundation: &#34;the twelve apostles of the Lamb&#34; (Rev 21:14). She is indestructible (cf. Mt 16:18). She is upheld infallibly in the truth: Christ governs her through Peter and the other apostles, who are present in their successors, the Pope and the college of bishops.</p><br/><p>- 1444 (in &#39;Reconciliation with the Church&#39;) - In imparting to his apostles his own power to forgive sins the Lord also gives them the authority to reconcile sinners with the Church. This ecclesial dimension of their task is expressed most notably in Christ&#39;s solemn words to Simon Peter: &#34;I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.&#34; &#34;The office of binding and loosing which was given to Peter was also assigned to the college of the apostles united to its head.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "6u1BG7ZORRk3mTlOJplCz5",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Feast of Saint Peter's Chair - Matt 16: 13-19",
    "release_date": "2023-02-21",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:6u1BG7ZORRk3mTlOJplCz5"
}