{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6N9KIzSOLWMCMucx0MqSdB/clip_759280_803300.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 19: 16-22 - 'If you wish to be perfect, go and sell what you own.'  Catechism of the Catholic Church Paragraphs: - 2052-2053 (in 'Teacher, what must I do?') - \"Teacher, what good deed must I do, to have eternal life?\" To the young man who asked this question, Jesus answers first by invoking the necessity to recognize God as the \"One there is who is good,\" as the supreme Good and the source of all good. Then Jesus tells him: \"If you would enter life, keep the commandments.\" and he cites for his questioner the precepts that concern love of neighbor: \"You shall not kill, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and mother.\" Finally Jesus sums up these commandments positively: \"You shall love your neighbor as yourself. To this first reply Jesus adds a second: \"If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.\" This reply does not do away with the first: following Jesus Christ involves keeping the Commandments. the Law has not been abolished, but rather man is invited to rediscover it in the person of his Master who is its perfect fulfillment. In the three synoptic Gospels, Jesus' call to the rich young man to follow him, in the obedience of a disciple and in the observance of the Commandments, is joined to the call to poverty and chastity. The evangelical counsels are inseparable from the Commandments. - 2075 (in 'The Ten Commandments') - \"What good deed must I do, to have eternal life?\" - \"If you would enter into life, keep the commandments.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1687115,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/71kxrAMee0ihY5p1S0Tm5t"
    },
    "href": "https://api.spotify.com/v1/episodes/71kxrAMee0ihY5p1S0Tm5t",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 19: 16-22 - &#39;If you wish to be perfect, go and sell what you own.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2052-2053 (in &#39;Teacher, what must I do?&#39;) - &#34;Teacher, what good deed must I do, to have eternal life?&#34; To the young man who asked this question, Jesus answers first by invoking the necessity to recognize God as the &#34;One there is who is good,&#34; as the supreme Good and the source of all good. Then Jesus tells him: &#34;If you would enter life, keep the commandments.&#34; and he cites for his questioner the precepts that concern love of neighbor: &#34;You shall not kill, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and mother.&#34; Finally Jesus sums up these commandments positively: &#34;You shall love your neighbor as yourself. To this first reply Jesus adds a second: &#34;If you would be perfect, go, sell what you possess and give to the poor, and you will have treasure in heaven; and come, follow me.&#34; This reply does not do away with the first: following Jesus Christ involves keeping the Commandments. the Law has not been abolished, but rather man is invited to rediscover it in the person of his Master who is its perfect fulfillment. In the three synoptic Gospels, Jesus&#39; call to the rich young man to follow him, in the obedience of a disciple and in the observance of the Commandments, is joined to the call to poverty and chastity. The evangelical counsels are inseparable from the Commandments.</p><br/><p>- 2075 (in &#39;The Ten Commandments&#39;) - &#34;What good deed must I do, to have eternal life?&#34; - &#34;If you would enter into life, keep the commandments.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "71kxrAMee0ihY5p1S0Tm5t",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 20 in Ordinary Time - Matt 19: 16-22",
    "release_date": "2023-08-20",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:71kxrAMee0ihY5p1S0Tm5t"
}