{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/7IzXukaAVBM5HHoaMqaip6/clip_708500_764200.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 25: 31-46 - 'I was naked and you clothed me; sick, and you visited me.'  Catechism of the Catholic Church Paragraphs: - 544 (In 'The Kingdom of God is at hand') - Jesus identifies himself with the poor of every kind and makes active love toward them the condition for entering his kingdom (abbreviated) - 1033-1034 (in 'I Believe in Life Everlasting') - Our Lord warns us that we shall be separated from him if we fail to meet the serious needs of the poor and the little ones who are his brethren...Jesus often speaks of \"Gehenna\" of \"the unquenchable fire\" reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he \"will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,\" and that he will pronounce the condemnation: \"Depart from me, you cursed, into the eternal fire!\" - 2447 (in 'Love for the Poor') - The works of mercy are charitable actions by which we come to the aid of our neighbor in his spiritual and bodily necessities. Instructing, advising, consoling, comforting are spiritual works of mercy, as are forgiving and bearing wrongs patiently. the corporal works of mercy consist especially in feeding the hungry, sheltering the homeless, clothing the naked, visiting the sick and imprisoned, and burying the dead. - 2831 (in 'Give us this day our daily bread') - But the presence of those who hunger because they lack bread opens up another profound meaning of this petition. the drama of hunger in the world calls Christians who pray sincerely to exercise responsibility toward their brethren, both in their personal behavior and in their solidarity with the human family. This petition of the Lord's Prayer cannot be isolated from the parables of the poor man Lazarus and of the Last Judgment. - 331 (in 'Christ with all his angels') - Christ is the centre of the angelic world. They are his angels: \"When the Son of man comes in his glory, and all the angels with him\" (abbreviated) - 671 (in 'Until all things are subjected to him') - Though already present in his Church, Christ's reign is nevertheless yet to be fulfilled \"with power and great glory\" by the King's return to earth (abbreviated) - 678-679 (in 'To Judge the Living and the Dead') - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching... Then will the conduct of each one and the secrets of hearts be brought to light. Then will the culpable unbelief that      counted the offer of God's grace as nothing be condemned. Our attitude to our neighbour will disclose acceptance or refusal of grace and divine love. On the Last Day Jesus will say: \"Truly I say to you, as you did it to one of the least of these my brethren, you did it to me.\"...By rejecting grace in this life, one already judges oneself, receives according to one's works, and can even condemn oneself for all eternity by rejecting the Spirit of love (abbreviated) - 1038 (in 'The Last Judgement') - Then Christ will come \"in his glory, and all the angels with him .... Before him will be gathered all the nations, and he will separate them one from another as a shepherd separates the sheep from the goats, and he will place the sheep at his right hand, but the goats at the left.... and they will go away into eternal punishment, but the righteous into eternal life.\" (abbreviated)  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2084617,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/731AUkor8DhfjMzH4X3CqR"
    },
    "href": "https://api.spotify.com/v1/episodes/731AUkor8DhfjMzH4X3CqR",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 25: 31-46 - &#39;I was naked and you clothed me; sick, and you visited me.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 544 (In &#39;The Kingdom of God is at hand&#39;) - Jesus identifies himself with the poor of every kind and makes active love toward them the condition for entering his kingdom (abbreviated)</p><br/><p>- 1033-1034 (in &#39;I Believe in Life Everlasting&#39;) - Our Lord warns us that we shall be separated from him if we fail to meet the serious needs of the poor and the little ones who are his brethren...Jesus often speaks of &#34;Gehenna&#34; of &#34;the unquenchable fire&#34; reserved for those who to the end of their lives refuse to believe and be converted, where both soul and body can be lost. Jesus solemnly proclaims that he &#34;will send his angels, and they will gather . . . all evil doers, and throw them into the furnace of fire,&#34; and that he will pronounce the condemnation: &#34;Depart from me, you cursed, into the eternal fire!&#34;</p><br/><p>- 2447 (in &#39;Love for the Poor&#39;) - The works of mercy are charitable actions by which we come to the aid of our neighbor in his spiritual and bodily necessities. Instructing, advising, consoling, comforting are spiritual works of mercy, as are forgiving and bearing wrongs patiently. the corporal works of mercy consist especially in feeding the hungry, sheltering the homeless, clothing the naked, visiting the sick and imprisoned, and burying the dead.</p><br/><p>- 2831 (in &#39;Give us this day our daily bread&#39;) - But the presence of those who hunger because they lack bread opens up another profound meaning of this petition. the drama of hunger in the world calls Christians who pray sincerely to exercise responsibility toward their brethren, both in their personal behavior and in their solidarity with the human family. This petition of the Lord&#39;s Prayer cannot be isolated from the parables of the poor man Lazarus and of the Last Judgment.</p><br/><p>- 331 (in &#39;Christ with all his angels&#39;) - Christ is the centre of the angelic world. They are his angels: &#34;When the Son of man comes in his glory, and all the angels with him&#34; (abbreviated)</p><br/><p>- 671 (in &#39;Until all things are subjected to him&#39;) - Though already present in his Church, Christ&#39;s reign is nevertheless yet to be fulfilled &#34;with power and great glory&#34; by the King&#39;s return to earth (abbreviated)</p><br/><p>- 678-679 (in &#39;To Judge the Living and the Dead&#39;) - Following in the steps of the prophets and John the Baptist, Jesus announced the judgement of the Last Day in his preaching... Then will the conduct of each one and the secrets of hearts be brought to light. Then will the culpable unbelief that      counted the offer of God&#39;s grace as nothing be condemned. Our attitude to our neighbour will disclose acceptance or refusal of grace and divine love. On the Last Day Jesus will say: &#34;Truly I say to you, as you did it to one of the least of these my brethren, you did it to me.&#34;...By rejecting grace in this life, one already judges oneself, receives according to one&#39;s works, and can even condemn oneself for all eternity by rejecting the Spirit of love (abbreviated)</p><br/><p>- 1038 (in &#39;The Last Judgement&#39;) - Then Christ will come &#34;in his glory, and all the angels with him .... Before him will be gathered all the nations, and he will separate them one from another as a shepherd separates the sheep from the goats, and he will place the sheep at his right hand, but the goats at the left.... and they will go away into eternal punishment, but the righteous into eternal life.&#34; (abbreviated)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "731AUkor8DhfjMzH4X3CqR",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 1 of Lent - Matt 25: 31-46",
    "release_date": "2023-02-26",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:731AUkor8DhfjMzH4X3CqR"
}