{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4oC2ys7GMpIfyzbRokSfsB/clip_803600_853800.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 16: 5-11 - 'Unless I go, the advocate will not come to you.'  Catechism of the Catholic Church Paragraphs: - 729 (in 'Christ Jesus') - Only when the hour has arrived for his glorification does Jesus promise the coming of the Holy Spirit, since his Death and Resurrection will fulfill the promise made to the fathers. The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus' prayer; he will be sent by the Father in Jesus' name; and Jesus will send him from the Father's side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment. - 692 (in 'Titles of the Holy Spirit') - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the \"Paraclete,\" literally, \"he who is called to one's side,\" advocatus. \"Paraclete\" is commonly translated by \"consoler,\" and Jesus is the first consoler. The Lord also called the Holy Spirit \"the Spirit of truth.\" - 1433 (in 'Interior Penance') - Since Easter, the Holy Spirit has proved \"the world wrong about sin,\" i.e., proved that the world has not believed in him whom the Father has sent. But this same Spirit who brings sin to light is also the Consoler who gives the human heart grace for repentance and conversion. - 388 (in 'Original Sin - an essential truth of the faith') - With the progress of Revelation, the reality of sin is also illuminated. Although to some extent the People of God in the Old Testament had tried to understand the pathos of the human condition in the light of the history of the fall narrated in Genesis, they could not grasp this story's ultimate meaning, which is revealed only in the light of the death and Resurrection of Jesus Christ. We must know Christ as the source of grace in order to know Adam as the source of sin. the Spirit-Paraclete, sent by the risen Christ, came to \"convict the world concerning sin\", by revealing him who is its Redeemer. - 385 (in 'The Fall') - The revelation of divine love in Christ manifested at the same time the extent of evil and the superabundance of grace. We must therefore approach the question of the origin of evil by fixing the eyes of our faith on him who alone is its conqueror (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1162901,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/752X5MywxNBh5reyFSFfUv"
    },
    "href": "https://api.spotify.com/v1/episodes/752X5MywxNBh5reyFSFfUv",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 16: 5-11 - &#39;Unless I go, the advocate will not come to you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 729 (in &#39;Christ Jesus&#39;) - Only when the hour has arrived for his glorification does Jesus promise the coming of the Holy Spirit, since his Death and Resurrection will fulfill the promise made to the fathers. The Spirit of truth, the other Paraclete, will be given by the Father in answer to Jesus&#39; prayer; he will be sent by the Father in Jesus&#39; name; and Jesus will send him from the Father&#39;s side, since he comes from the Father. the Holy Spirit will come and we shall know him; he will be with us for ever; he will remain with us. the Spirit will teach us everything, remind us of all that Christ said to us and bear witness to him. the Holy Spirit will lead us into all truth and will glorify Christ. He will prove the world wrong about sin, righteousness, and judgment.</p><br/><p>- 692 (in &#39;Titles of the Holy Spirit&#39;) - When he proclaims and promises the coming of the Holy Spirit, Jesus calls him the &#34;Paraclete,&#34; literally, &#34;he who is called to one&#39;s side,&#34; advocatus. &#34;Paraclete&#34; is commonly translated by &#34;consoler,&#34; and Jesus is the first consoler. The Lord also called the Holy Spirit &#34;the Spirit of truth.&#34;</p><br/><p>- 1433 (in &#39;Interior Penance&#39;) - Since Easter, the Holy Spirit has proved &#34;the world wrong about sin,&#34; i.e., proved that the world has not believed in him whom the Father has sent. But this same Spirit who brings sin to light is also the Consoler who gives the human heart grace for repentance and conversion.</p><br/><p>- 388 (in &#39;Original Sin - an essential truth of the faith&#39;) - With the progress of Revelation, the reality of sin is also illuminated. Although to some extent the People of God in the Old Testament had tried to understand the pathos of the human condition in the light of the history of the fall narrated in Genesis, they could not grasp this story&#39;s ultimate meaning, which is revealed only in the light of the death and Resurrection of Jesus Christ. We must know Christ as the source of grace in order to know Adam as the source of sin. the Spirit-Paraclete, sent by the risen Christ, came to &#34;convict the world concerning sin&#34;, by revealing him who is its Redeemer.</p><br/><p>- 385 (in &#39;The Fall&#39;) - The revelation of divine love in Christ manifested at the same time the extent of evil and the superabundance of grace. We must therefore approach the question of the origin of evil by fixing the eyes of our faith on him who alone is its conqueror (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "752X5MywxNBh5reyFSFfUv",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 6 of Eastertide - John 16: 5-11",
    "release_date": "2023-05-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:752X5MywxNBh5reyFSFfUv"
}