{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1RS7dxsEn977YKiteeMVoe/clip_529400_594000.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠  Matthew 28: 1-10 - 'He has risen from the dead and now he is going before you into Galilee.'  Catechism of the Catholic Church Paragraphs: - 500 (in 'Mary ever-virgin') - Against this doctrine the objection is sometimes raised that the Bible mentions brothers and sisters of Jesus. The Church has always understood these passages as not referring to other children of the Virgin Mary. In fact James and Joseph, \"brothers of Jesus\", are the sons of another Mary, a disciple of Christ, whom St. Matthew significantly calls \"the other Mary\". They are close relations of Jesus, according to an Old Testament expression. - 2174 (in 'the Day of the Resurrection: the new Creation') - Jesus rose from the dead \"on the first day of the week.\" Because it is the \"first day,\" the day of Christ's Resurrection recalls the first creation.      Because it is the \"eighth day\" following the sabbath, it symbolizes the new creation ushered in by Christ's Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord's Day (he kuriake hemera, dies dominica) Sunday:  \"We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead.\" - 641 (in 'The Empty Tomb') - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ's Resurrection for the apostles themselves (abbreviated). - 654 (in 'The Meaning and Saving Significance of the Resurrection') - Justification consists in both victory over the death caused by sin and a new participation ingrace. It brings about filial adoption so that men become Christ's brethren, as Jesus himself called his disciples after his Resurrection: \"Go and tell my brethren.\" We are brethren not by nature, but by the gift of grace, because that adoptive filiation gains us a real share in the life of the only Son, which was fully revealed in his Resurrection (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1008535,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/759dAt4XDvSl4JkPdDYhe6"
    },
    "href": "https://api.spotify.com/v1/episodes/759dAt4XDvSl4JkPdDYhe6",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠</a></p><br/><p><br /></p><br/><p>Matthew 28: 1-10 - &#39;He has risen from the dead and now he is going before you into Galilee.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 500 (in &#39;Mary ever-virgin&#39;) - Against this doctrine the objection is sometimes raised that the Bible mentions brothers and sisters of Jesus. The Church has always understood these passages as not referring to other children of the Virgin Mary. In fact James and Joseph, &#34;brothers of Jesus&#34;, are the sons of another Mary, a disciple of Christ, whom St. Matthew significantly calls &#34;the other Mary&#34;. They are close relations of Jesus, according to an Old Testament expression.</p><br/><p>- 2174 (in &#39;the Day of the Resurrection: the new Creation&#39;) - Jesus rose from the dead &#34;on the first day of the week.&#34; Because it is the &#34;first day,&#34; the day of Christ&#39;s Resurrection recalls the first creation.      Because it is the &#34;eighth day&#34; following the sabbath, it symbolizes the new creation ushered in by Christ&#39;s Resurrection. For Christians it has become the first of all days, the first of all feasts, the Lord&#39;s Day (he kuriake hemera, dies dominica) Sunday:  &#34;We all gather on the day of the sun, for it is the first day [after the Jewish sabbath, but also the first day] when God, separating matter from darkness, made the world; and on this same day Jesus Christ our Savior rose from the dead.&#34;</p><br/><p>- 641 (in &#39;The Empty Tomb&#39;) - Mary Magdalene and the holy women who came to finish anointing the body of Jesus, which had been buried in haste because the Sabbath began on the evening of Good Friday, were the first to encounter the Risen One. Thus the women were the first messengers of Christ&#39;s Resurrection for the apostles themselves (abbreviated).</p><br/><p>- 654 (in &#39;The Meaning and Saving Significance of the Resurrection&#39;) - Justification consists in both victory over the death caused by sin and a new participation ingrace. It brings about filial adoption so that men become Christ&#39;s brethren, as Jesus himself called his disciples after his Resurrection:</p><br/><p>&#34;Go and tell my brethren.&#34; We are brethren not by nature, but by the gift of grace, because that adoptive filiation gains us a real share in the life of the only Son, which was fully revealed in his Resurrection (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "759dAt4XDvSl4JkPdDYhe6",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a2cd291d28eac430f911845c0",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f2cd291d28eac430f911845c0",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d2cd291d28eac430f911845c0",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Holy Saturday (Year A) - Matt 28: 1-10",
    "release_date": "2023-04-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:759dAt4XDvSl4JkPdDYhe6"
}