{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/41jA1mIGsCfsuXNTfmHX9N/clip_505000_562430.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 13: 1-23 - 'A sower went out to sow.'  Catechism of the Catholic Church Paragraphs: - 546 (in 'The Proclamation of the Kingdom of God') - Jesus' invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word? What use has he made of the talents he has received? Jesus and the presence of the kingdom in this world are secretly at the heart of the parables. One must enter the kingdom, that is, become a disciple of Christ, in order to \"know the secrets of the kingdom of heaven\". For those who stay \"outside\", everything remains enigmatic. - 29 (in 'The Desire for God') - But this \"intimate and vital bond of man to God\" can be forgotten, overlooked, or even explicitly rejected by man. Such attitudes can have different causes: revolt against evil in the world; religious ignorance or indifference; the cares and riches of this world; the scandal of bad example on the part of believers; currents of thought hostile to religion; finally, that attitude of sinful man which makes him hide from God out of fear and flee his call. - 787 (in 'The Church is communion with Jesus') - From the beginning, Jesus associated his disciples with his own life, revealed the mystery of the Kingdom to them, and gave them a share in his mission, joy, and sufferings (abbreviated). - 1724 (in 'Christian Beatitude') - The Decalogue, the Sermon on the Mount, and the apostolic catechesis describe for us the paths that lead to the Kingdom of heaven. Sustained by the grace of the Holy Spirit, we tread them, step by step, by everyday acts. By the working of the Word of Christ, we slowly bear fruit in the Church to the glory of God.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 702102,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7FDTDsAK9KhWXVBKUGnMvP"
    },
    "href": "https://api.spotify.com/v1/episodes/7FDTDsAK9KhWXVBKUGnMvP",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 13: 1-23 - &#39;A sower went out to sow.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 546 (in &#39;The Proclamation of the Kingdom of God&#39;) - Jesus&#39; invitation to enter his kingdom comes in the form of parables, a characteristic feature of his teaching. Through his parables he invites people to the feast of the kingdom, but he also asks for a radical choice: to gain the kingdom, one must give everything. Words are not enough, deeds are required. The parables are like mirrors for man: will he be hard soil or good earth for the word? What use has he made of the talents he has received? Jesus and the presence of the kingdom in this world are secretly at the heart of the parables. One must enter the kingdom, that is, become a disciple of Christ, in order to &#34;know the secrets of the kingdom of heaven&#34;. For those who stay &#34;outside&#34;, everything remains enigmatic.</p><br/><p>- 29 (in &#39;The Desire for God&#39;) - But this &#34;intimate and vital bond of man to God&#34; can be forgotten, overlooked, or even explicitly rejected by man. Such attitudes can have different causes: revolt against evil in the world; religious ignorance or indifference; the cares and riches of this world; the scandal of bad example on the part of believers; currents of thought hostile to religion; finally, that attitude of sinful man which makes him hide from God out of fear and flee his call.</p><br/><p>- 787 (in &#39;The Church is communion with Jesus&#39;) - From the beginning, Jesus associated his disciples with his own life, revealed the mystery of the Kingdom to them, and gave them a share in his mission, joy, and sufferings (abbreviated).</p><br/><p>- 1724 (in &#39;Christian Beatitude&#39;) - The Decalogue, the Sermon on the Mount, and the apostolic catechesis describe for us the paths that lead to the Kingdom of heaven. Sustained by the grace of the Holy Spirit, we tread them, step by step, by everyday acts. By the working of the Word of Christ, we slowly bear fruit in the Church to the glory of God.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7FDTDsAK9KhWXVBKUGnMvP",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "15th Sunday in Ordinary Time (Year A) - Matt 13: 1-23",
    "release_date": "2023-07-15",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7FDTDsAK9KhWXVBKUGnMvP"
}