{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/1D1iUcm4FreUCCBaqBjuyW/clip_451526_511526.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 10: 46-52 - 'Go; your faith has saved you.'  Catechism of the Catholic Church Paragraphs: - 2616 (in 'Jesus Hears our Prayer') - Prayer to Jesus is answered by him already during his ministry, through signs that anticipate the power of his death and Resurrection: Jesus hears the prayer of faith, expressed in words (the leper, Jairus, the Canaanite woman, the good thief) or in silence (the bearers of the paralytic, the woman with a hemorrhage who touches his clothes, the tears and ointment of the sinful woman). The urgent request of the blind men, \"Have mercy on us, Son of David\" or \"Jesus, Son of David, have mercy on me!\" has-been renewed in the traditional prayer to Jesus known as the Jesus Prayer: \"Lord Jesus Christ, Son of God, have mercy on me, a sinner!\" Healing infirmities or forgiving sins, Jesus always responds to a prayer offered in faith: \"Your faith has made you well; go in peace.\" - 548 (in 'The Signs of the Kingdom of God') - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father's works; they bear witness that he is the Son of God (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 899355,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7fN4er5T1XXQaCE3i9cbAC"
    },
    "href": "https://api.spotify.com/v1/episodes/7fN4er5T1XXQaCE3i9cbAC",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 10: 46-52 - &#39;Go; your faith has saved you.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2616 (in &#39;Jesus Hears our Prayer&#39;) - Prayer to Jesus is answered by him already during his ministry, through signs that anticipate the power of his death and Resurrection: Jesus hears the prayer of faith, expressed in words (the leper, Jairus, the Canaanite woman, the good thief) or in silence (the bearers of the paralytic, the woman with a hemorrhage who touches his clothes, the tears and ointment of the sinful woman). The urgent request of the blind men, &#34;Have mercy on us, Son of David&#34; or &#34;Jesus, Son of David, have mercy on me!&#34; has-been renewed in the traditional prayer to Jesus known as the Jesus Prayer: &#34;Lord Jesus Christ, Son of God, have mercy on me, a sinner!&#34; Healing infirmities or forgiving sins, Jesus always responds to a prayer offered in faith: &#34;Your faith has made you well; go in peace.&#34;</p><br/><p>- 548 (in &#39;The Signs of the Kingdom of God&#39;) - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father&#39;s works; they bear witness that he is the Son of God (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7fN4er5T1XXQaCE3i9cbAC",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "30th Sunday in Ordinary Time (Year B) - Mark 10: 46-52",
    "release_date": "2021-10-23",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7fN4er5T1XXQaCE3i9cbAC"
}