{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/3sDoORKLyvW4oB9p25sJkC/clip_949600_1006000.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠  John 3: 1-8 - 'Unless a man is born from above, he cannot see the kingdom of God.'  Catechism of the Catholic Church Paragraphs: - 782 (Characteristics of the People of God') - The People of God is marked by characteristics that clearly distinguish it from all other religious, ethnic, political, or cultural groups found in history: One becomes a member of this people not by physical birth, but by being 'born anew,' a birth of 'water and the Spirit,' that is, by faith in Christ and Baptism (abbreviated). - 691 (in 'The Proper Name of the Holy Spirit') - The term \"Spirit\" translates the Hebrew word ruah, which, in its primary sense, means breath, air, wind. Jesus indeed uses the sensory image of the wind to suggest to Nicodemus the transcendent newness of him who is personally God's breath, the divine Spirit (abbreviated). - 720 (in 'John, precursor, prophet and baptist') - Finally, with John the Baptist, the Holy Spirit begins the restoration to man of \"the divine likeness,\" prefiguring what he would achieve with and in Christ. John's baptism was for repentance; baptism in water and the Spirit will be a new birth. - 1215 (in 'What is this Sacrament called') - This sacrament is also called \"the washing of regeneration and renewal by the Holy Spirit,\" for it signifies and actually brings about the birth of water and the Spirit without which no one \"can enter the kingdom of God.\" - 1225 (in 'Christ's Baptism') - The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible \"to be born of water and the Spirit\" in order to enter the Kingdom of God (abbreviated). - 1238 (in 'The Mystagogy of the Celebration') - The baptismal water is consecrated by a prayer of epiclesis (either at this moment or at the Easter Vigil). the Church asks God that through his Son the power of the Holy Spirit may be sent upon the water, so that those who will be baptized in it may be \"born of water and the Spirit.\" - 1257 (in 'The Necessity of Baptism') - The Lord himself affirms that Baptism is necessary for salvation. He also commands his disciples to proclaim the Gospel to all nations and to baptize them. Baptism is necessary for salvation for those to whom the Gospel has been proclaimed and who have had the possibility of asking for this sacrament. The Church does not know of any means other than Baptism that assures entry into eternal beatitude; this is why she takes care not to neglect the mission she has received from the Lord to see that all who can be baptized are \"reborn of water and the Spirit.\" God has bound salvation to the sacrament of Baptism, but he himself is not bound by his sacraments. - 1262 (in 'The Grace of Baptism') - The different effects of Baptism are signified by the perceptible elements of the sacramental rite. Immersion in water symbolizes not only death and purification, but also regeneration and renewal. Thus the two principal effects are purification from sins and new birth in the Holy Spirit. - 2790 (in 'Our Father') - Grammatically, \"our\" qualifies a reality common to more than one person. There is only one God, and he is recognized as Father by those who, through faith in his only Son, are reborn of him by water and the Spirit. - 526 (in 'Little Child, God eternal') - 591 (in 'Jesus and Israel's faith in the One God and Saviour')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1764786,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7Hb8Z55rRy4b51fIqQcuLb"
    },
    "href": "https://api.spotify.com/v1/episodes/7Hb8Z55rRy4b51fIqQcuLb",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p⁠</a></p><br/><p><br /></p><br/><p>John 3: 1-8 - &#39;Unless a man is born from above, he cannot see the kingdom of God.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 782 (Characteristics of the People of God&#39;) - The People of God is marked by characteristics that clearly distinguish it from all other religious, ethnic, political, or cultural groups found in history: One becomes a member of this people not by physical birth, but by being &#39;born anew,&#39; a birth of &#39;water and the Spirit,&#39; that is, by faith in Christ and Baptism (abbreviated).</p><br/><p>- 691 (in &#39;The Proper Name of the Holy Spirit&#39;) - The term &#34;Spirit&#34; translates the Hebrew word ruah, which, in its primary sense, means breath, air, wind. Jesus indeed uses the sensory image of the wind to suggest to Nicodemus the transcendent newness of him who is personally God&#39;s breath, the divine Spirit (abbreviated).</p><br/><p>- 720 (in &#39;John, precursor, prophet and baptist&#39;) - Finally, with John the Baptist, the Holy Spirit begins the restoration to man of &#34;the divine likeness,&#34; prefiguring what he would achieve with and in Christ. John&#39;s baptism was for repentance; baptism in water and the Spirit will be a new birth.</p><br/><p>- 1215 (in &#39;What is this Sacrament called&#39;) - This sacrament is also called &#34;the washing of regeneration and renewal by the Holy Spirit,&#34; for it signifies and actually brings about the birth of water and the Spirit without which no one &#34;can enter the kingdom of God.&#34;</p><br/><p>- 1225 (in &#39;Christ&#39;s Baptism&#39;) - The blood and water that flowed from the pierced side of the crucified Jesus are types of Baptism and the Eucharist, the sacraments of new life. From then on, it is possible &#34;to be born of water and the Spirit&#34; in order to enter the Kingdom of God (abbreviated).</p><br/><p>- 1238 (in &#39;The Mystagogy of the Celebration&#39;) - The baptismal water is consecrated by a prayer of epiclesis (either at this moment or at the Easter Vigil). the Church asks God that through his Son the power of the Holy Spirit may be sent upon the water, so that those who will be baptized in it may be &#34;born of water and the Spirit.&#34;</p><br/><p>- 1257 (in &#39;The Necessity of Baptism&#39;) - The Lord himself affirms that Baptism is necessary for salvation. He also commands his disciples to proclaim the Gospel to all nations and to baptize them. Baptism is necessary for salvation for those to whom the Gospel has been proclaimed and who have had the possibility of asking for this sacrament. The Church does not know of any means other than Baptism that assures entry into eternal beatitude; this is why she takes care not to neglect the mission she has received from the Lord to see that all who can be baptized are &#34;reborn of water and the Spirit.&#34; God has bound salvation to the sacrament of Baptism, but he himself is not bound by his sacraments.</p><br/><p>- 1262 (in &#39;The Grace of Baptism&#39;) - The different effects of Baptism are signified by the perceptible elements of the sacramental rite. Immersion in water symbolizes not only death and purification, but also regeneration and renewal. Thus the two principal effects are purification from sins and new birth in the Holy Spirit.</p><br/><p>- 2790 (in &#39;Our Father&#39;) - Grammatically, &#34;our&#34; qualifies a reality common to more than one person. There is only one God, and he is recognized as Father by those who, through faith in his only Son, are reborn of him by water and the Spirit.</p><br/><p>- 526 (in &#39;Little Child, God eternal&#39;)</p><br/><p>- 591 (in &#39;Jesus and Israel&#39;s faith in the One God and Saviour&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7Hb8Z55rRy4b51fIqQcuLb",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 2 of Eastertide - John 3: 1-8",
    "release_date": "2023-04-16",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7Hb8Z55rRy4b51fIqQcuLb"
}