{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0qfFdosWw396OntyBoUgSb/clip_1053400_1092700.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Matthew 4: 1-11 - 'The temptation in the wilderness.'  Catechism of the Catholic Church Paragraphs: - 394 (in 'The Fall of the Angels') - Scripture witnesses to the disastrous influence of the one Jesus calls \"a murderer from the beginning\", who would even try to divert Jesus from the mission received from his Father (abbreviated) - 2849 (in 'The Seven Petitions') - Such a battle and such a victory become possible only through prayer. It is by his prayer that Jesus vanquishes the tempter, both at the outset of his public mission and in the ultimate struggle of his Agony (abbreviated) - 2835 (in 'Give us this day our daily bread') - his petition, with the responsibility it involves, also applies to another hunger from which men are perishing: \"Man does not live by bread alone, but . . . by every word that proceeds from the mouth of God,\" that is, by the Word he speaks and the Spirit he breathes forth (abbreviated) - 2083 (in 'The First Commandment') - It is written: \"You shall worship the Lord your God and him only shall you serve.\" (abbreviated) - 333 (in 'Christ with all his angels') - From the Incarnation to the Ascension, the life of the Word incarnate is surrounded by the adoration and service of angels. When God \"brings the firstborn into the world, he says: 'Let all God's angels worship him.'\" Their song of praise at the birth of Christ has not ceased resounding in the Church's praise: \"Glory to God in the highest!\" They protect Jesus in his infancy, serve him in the desert, strengthen him in his agony in the garden, when he could have been saved by them from the hands of his enemies as Israel had been (abbreviated)  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1285410,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7jFR7Q1Le6l5bSowbYfhfw"
    },
    "href": "https://api.spotify.com/v1/episodes/7jFR7Q1Le6l5bSowbYfhfw",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Matthew 4: 1-11 - &#39;The temptation in the wilderness.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 394 (in &#39;The Fall of the Angels&#39;) - Scripture witnesses to the disastrous influence of the one Jesus calls &#34;a murderer from the beginning&#34;, who would even try to divert Jesus from the mission received from his Father (abbreviated)</p><br/><p>- 2849 (in &#39;The Seven Petitions&#39;) - Such a battle and such a victory become possible only through prayer. It is by his prayer that Jesus vanquishes the tempter, both at the outset of his public mission and in the ultimate struggle of his Agony (abbreviated)</p><br/><p>- 2835 (in &#39;Give us this day our daily bread&#39;) - his petition, with the responsibility it involves, also applies to another hunger from which men are perishing: &#34;Man does not live by bread alone, but . . . by every word that proceeds from the mouth of God,&#34; that is, by the Word he speaks and the Spirit he breathes forth (abbreviated)</p><br/><p>- 2083 (in &#39;The First Commandment&#39;) - It is written: &#34;You shall worship the Lord your God and him only shall you serve.&#34; (abbreviated)</p><br/><p>- 333 (in &#39;Christ with all his angels&#39;) - From the Incarnation to the Ascension, the life of the Word incarnate is surrounded by the adoration and service of angels. When God &#34;brings the firstborn into the world, he says: &#39;Let all God&#39;s angels worship him.&#39;&#34; Their song of praise at the birth of Christ has not ceased resounding in the Church&#39;s praise: &#34;Glory to God in the highest!&#34; They protect Jesus in his infancy, serve him in the desert, strengthen him in his agony in the garden, when he could have been saved by them from the hands of his enemies as Israel had been (abbreviated)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7jFR7Q1Le6l5bSowbYfhfw",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/87b71c308a1fc07a47692f585d73f49a23cac6d8",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/4111943dec5eca29372aee1c85d926794608e061",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/73fb3c0e9b3dec80877f5bbc01de3730fb1cee15",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "1st Sunday of Lent (Year A) - Matt 4: 1-11",
    "release_date": "2023-02-25",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7jFR7Q1Le6l5bSowbYfhfw"
}