{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6eraa5pO9hPqEpjWdYrym2/clip_247300_296500.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 6: 51-58 - 'My flesh is real food and my blood is real drink.'  Catechism of the Catholic Church Paragraphs: - 2837 (in 'Give us this day our Daily Bread') - \"Daily\" (epiousios) occurs nowhere else in the New Testament. Taken in a temporal sense, this word is a pedagogical repetition of \"this day,\" to confirm us in trust \"without reservation.\" Taken in the qualitative sense, it signifies what is necessary for life, and more broadly every good thing sufficient for subsistence. Taken literally (epi-ousios: \"super-essential\"), it refers directly to the Bread of Life, the Body of Christ, the \"medicine of immortality,\" without which we have no life within us. - 1384 (in 'The Sacrament of the Eucharist') - The Lord addresses an invitation to us, urging us to receive him in the sacrament of the Eucharist: \"Truly, I say to you, unless you eat the flesh of the Son of man and drink his blood, you have no life in you.\" - 1406 (in 'The Sacrament of the Eucharist') - Jesus said: \"I am the living bread that came down from heaven; if any one eats of this bread, he will live for ever; . . . he who eats my flesh and drinks my blood has eternal life and . . . abides in me, and I in him\" - 1509 (in 'Heal the Sick') - \"Heal the sick!\" The Church has received this charge from the Lord and strives to carry it out by taking care of the sick as well as by accompanying them with her prayer of intercession. She believes in the life-giving presence of Christ, the physician of souls and bodies. This presence is particularly active through the sacraments, and in an altogether special way through the Eucharist, the bread that gives eternal life and that St. Paul suggests is connected with bodily health. - 1524 (in 'Viaticum') - In addition to the Anointing of the Sick, the Church offers those who are about to leave this life the Eucharist as viaticum. Communion in the body and blood of Christ, received at this moment of \"passing over\" to the Father, has a particular significance and importance. It is the seed of eternal life and the power of resurrection, according to the words of the Lord: \"He who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day.\" The sacrament of Christ once dead and now risen, the Eucharist is here the sacrament of passing over from death to life, from this world to the Father. - 787 (in 'The Church is communion with Jesus') - Jesus spoke of a still more intimate communion between him and those who would follow him: \"Abide in me, and I in you.... I am the vine, you are the branches\", and he proclaimed a mysterious and real communion between his own body and ours: \"He who eats my flesh and drinks my blood abides in me, and I in him.\" (abbreviated). - 1391 (in 'The Fruits of Holy Communion') - Holy Communion augments our union with Christ. The principal fruit of receiving the Eucharist in Holy Communion is an intimate union with Christ Jesus. Indeed, the Lord said: \"He who eats my flesh and drinks my blood abides in me, and I in him.\" Life in Christ has its foundation in the Eucharistic banquet: \"As the living Father sent me, and I live because of the Father, so he who eats me will live because of me.\" - 994 (in 'The Progressive revelation of the Resurrection') - 728 (in 'Christ Jesus') - 1355 (in 'The Movement of the Eucharistic Celebration')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1787008,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7jhRa6i3zdvhT2WCOBtRrT"
    },
    "href": "https://api.spotify.com/v1/episodes/7jhRa6i3zdvhT2WCOBtRrT",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 6: 51-58 - &#39;My flesh is real food and my blood is real drink.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2837 (in &#39;Give us this day our Daily Bread&#39;) - &#34;Daily&#34; (epiousios) occurs nowhere else in the New Testament. Taken in a temporal sense, this word is a pedagogical repetition of &#34;this day,&#34; to confirm us in trust &#34;without reservation.&#34; Taken in the qualitative sense, it signifies what is necessary for life, and more broadly every good thing sufficient for subsistence. Taken literally (epi-ousios: &#34;super-essential&#34;), it refers directly to the Bread of Life, the Body of Christ, the &#34;medicine of immortality,&#34; without which we have no life within us.</p><br/><p>- 1384 (in &#39;The Sacrament of the Eucharist&#39;) - The Lord addresses an invitation to us, urging us to receive him in the sacrament of the Eucharist: &#34;Truly, I say to you, unless you eat the flesh of the Son of man and drink his blood, you have no life in you.&#34;</p><br/><p>- 1406 (in &#39;The Sacrament of the Eucharist&#39;) - Jesus said: &#34;I am the living bread that came down from heaven; if any one eats of this bread, he will live for ever; . . . he who eats my flesh and drinks my blood has eternal life and . . . abides in me, and I in him&#34;</p><br/><p>- 1509 (in &#39;Heal the Sick&#39;) - &#34;Heal the sick!&#34; The Church has received this charge from the Lord and strives to carry it out by taking care of the sick as well as by accompanying them with her prayer of intercession. She believes in the life-giving presence of Christ, the physician of souls and bodies. This presence is particularly active through the sacraments, and in an altogether special way through the Eucharist, the bread that gives eternal life and that St. Paul suggests is connected with bodily health.</p><br/><p>- 1524 (in &#39;Viaticum&#39;) - In addition to the Anointing of the Sick, the Church offers those who are about to leave this life the Eucharist as viaticum. Communion in the body and blood of Christ, received at this moment of &#34;passing over&#34; to the Father, has a particular significance and importance. It is the seed of eternal life and the power of resurrection, according to the words of the Lord: &#34;He who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day.&#34; The sacrament of Christ once dead and now risen, the Eucharist is here the sacrament of passing over from death to life, from this world to the Father.</p><br/><p>- 787 (in &#39;The Church is communion with Jesus&#39;) - Jesus spoke of a still more intimate communion between him and those who would follow him: &#34;Abide in me, and I in you.... I am the vine, you are the branches&#34;, and he proclaimed a mysterious and real communion between his own body and ours: &#34;He who eats my flesh and drinks my blood abides in me, and I in him.&#34; (abbreviated).</p><br/><p>- 1391 (in &#39;The Fruits of Holy Communion&#39;) - Holy Communion augments our union with Christ. The principal fruit of receiving the Eucharist in Holy Communion is an intimate union with Christ Jesus. Indeed, the Lord said: &#34;He who eats my flesh and drinks my blood abides in me, and I in him.&#34; Life in Christ has its foundation in the Eucharistic banquet: &#34;As the living Father sent me, and I live because of the Father, so he who eats me will live because of me.&#34;</p><br/><p>- 994 (in &#39;The Progressive revelation of the Resurrection&#39;)</p><br/><p>- 728 (in &#39;Christ Jesus&#39;)</p><br/><p>- 1355 (in &#39;The Movement of the Eucharistic Celebration&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7jhRa6i3zdvhT2WCOBtRrT",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Solemnity of Corpus Christi (Year A) - John 6: 51-58",
    "release_date": "2023-06-07",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7jhRa6i3zdvhT2WCOBtRrT"
}