{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0wO38c0IbFkDqqBLsoraCS/clip_120967_180967.mp3",
    "description": "To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy  Mark 3: 20-35 - 'A kingdom divided against itself cannot stand.'  Catechism of the Catholic Church Paragraphs: - 548 (in 'The signs of the Kingdom of God') - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father’s works; they bear witness that he is the Son of God. But his miracles can also be occasions for “offense”; they are not intended to satisfy people’s curiosity or desire for magic. Despite his evident miracles some people reject Jesus; he is even accused of acting by the power of demons. - 574 (in 'Jesus and Israel') - Because of certain of his acts— expelling demons, forgiving sins, healing on the sabbath day, his novel interpretation of the precepts of the Law regarding purity, and his familiarity with tax collectors and public sinners —some ill-intentioned persons suspected Jesus of demonic possession (abbreviated) - 539 (in 'Jesus' temptations') - The evangelists indicate the salvific meaning of this mysterious event: Jesus is the new Adam who remained faithful just where the first Adam had given in to temptation. Jesus fulfills Israel’s vocation perfectly: in contrast to those who had once provoked God during forty years in the desert, Christ reveals himself as God’s Servant, totally obedient to the divine will. In this, Jesus is the devil’s conqueror: he “binds the strong man” to take back his plunder. Jesus’ victory over the tempter in the desert anticipates victory at the Passion, the supreme act of obedience of his filial love for the Father. - 1864 (in 'The Different Kinds of Sins') - “Therefore I tell you, every sin and blasphemy will be forgiven men, but the blasphemy against the Spirit will not be forgiven. There are no limits to the mercy of God, but anyone who deliberately refuses to accept his mercy by repenting, rejects the forgiveness of his sins and the salvation offered by the Holy Spirit. Such hardness of heart can lead to final impenitence and eternal loss. - Dominum Et Vivificantem, paragraph 46: \"\"Why is blasphemy against the Holy Spirit unforgivable? How should this blasphemy be understood ? St. Thomas Aquinas replies that it is a question of a sin that is \"unforgivable by its very nature, insofar as it excludes the elements through which the forgiveness of sin takes place.\" According to such an exegesis, \"blasphemy\" does not properly consist in offending against the Holy Spirit in words; it consists rather in the refusal to accept the salvation which God offers to man through the Holy Spirit, working through the power of the Cross... We know that the result of such a purification is the forgiveness of sins. Therefore, whoever rejects the Spirit and the Blood remains in \"dead works,\" in sin. And the blasphemy against the Holy Spirit consists precisely in the radical refusal to accept this forgiveness, of which he is the intimate giver and which presupposes the genuine conversion which he brings about in the conscience. If Jesus says that blasphemy against the Holy Spirit cannot be forgiven either in this life or in the next, it is because this \"non-forgiveness\" is linked, as to its cause, to \"non-repentance,\" in other words to the radical refusal to be converted. .... Blasphemy against the Holy Spirit, then, is the sin committed by the person who claims to have a \"right\" to persist in evil-in any sin at all-and who thus rejects Redemption.  One closes oneself up in sin, thus making impossible one's conversion, and consequently the remission of sins, which one considers not essential or not important for one's life...  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2765589,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7Jtg0iYGfg7D7cussCwf8V"
    },
    "href": "https://api.spotify.com/v1/episodes/7Jtg0iYGfg7D7cussCwf8V",
    "html_description": "<p>To support the ministry and get access to exclusive content, go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>Mark 3: 20-35 - &#39;A kingdom divided against itself cannot stand.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 548 (in &#39;The signs of the Kingdom of God&#39;) - The signs worked by Jesus attest that the Father has sent him. They invite belief in him. To those who turn to him in faith, he grants what they ask. So miracles strengthen faith in the One who does his Father’s works; they bear witness that he is the Son of God. But his miracles can also be occasions for “offense”; they are not intended to satisfy people’s curiosity or desire for magic. Despite his evident miracles some people reject Jesus; he is even accused of acting by the power of demons.</p><br/><p>- 574 (in &#39;Jesus and Israel&#39;) - Because of certain of his acts— expelling demons, forgiving sins, healing on the sabbath day, his novel interpretation of the precepts of the Law regarding purity, and his familiarity with tax collectors and public sinners —some ill-intentioned persons suspected Jesus of demonic possession (abbreviated)</p><br/><p>- 539 (in &#39;Jesus&#39; temptations&#39;) - The evangelists indicate the salvific meaning of this mysterious event: Jesus is the new Adam who remained faithful just where the first Adam had given in to temptation. Jesus fulfills Israel’s vocation perfectly: in contrast to those who had once provoked God during forty years in the desert, Christ reveals himself as God’s Servant, totally obedient to the divine will. In this, Jesus is the devil’s conqueror: he “binds the strong man” to take back his plunder. Jesus’ victory over the tempter in the desert anticipates victory at the Passion, the supreme act of obedience of his filial love for the Father.</p><br/><p>- 1864 (in &#39;The Different Kinds of Sins&#39;) - “Therefore I tell you, every sin and blasphemy will be forgiven men, but the blasphemy against the Spirit will not be forgiven. There are no limits to the mercy of God, but anyone who deliberately refuses to accept his mercy by repenting, rejects the forgiveness of his sins and the salvation offered by the Holy Spirit. Such hardness of heart can lead to final impenitence and eternal loss.</p><br/><p>- Dominum Et Vivificantem, paragraph 46: &#34;&#34;Why is blasphemy against the Holy Spirit unforgivable? How should this blasphemy be understood ? St. Thomas Aquinas replies that it is a question of a sin that is &#34;unforgivable by its very nature, insofar as it excludes the elements through which the forgiveness of sin takes place.&#34; According to such an exegesis, &#34;blasphemy&#34; does not properly consist in offending against the Holy Spirit in words; it consists rather in the refusal to accept the salvation which God offers to man through the Holy Spirit, working through the power of the Cross... We know that the result of such a purification is the forgiveness of sins. Therefore, whoever rejects the Spirit and the Blood remains in &#34;dead works,&#34; in sin. And the blasphemy against the Holy Spirit consists precisely in the radical refusal to accept this forgiveness, of which he is the intimate giver and which presupposes the genuine conversion which he brings about in the conscience. If Jesus says that blasphemy against the Holy Spirit cannot be forgiven either in this life or in the next, it is because this &#34;non-forgiveness&#34; is linked, as to its cause, to &#34;non-repentance,&#34; in other words to the radical refusal to be converted. .... Blasphemy against the Holy Spirit, then, is the sin committed by the person who claims to have a &#34;right&#34; to persist in evil-in any sin at all-and who thus rejects Redemption.  One closes oneself up in sin, thus making impossible one&#39;s conversion, and consequently the remission of sins, which one considers not essential or not important for one&#39;s life...</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7Jtg0iYGfg7D7cussCwf8V",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a0a9b8daf7c7719b33ed7863e",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f0a9b8daf7c7719b33ed7863e",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d0a9b8daf7c7719b33ed7863e",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "10th Sunday in Ordinary Time (Year B) - Mark 3: 20-35",
    "release_date": "2021-06-05",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7Jtg0iYGfg7D7cussCwf8V"
}