{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/2hhJV9bHpGpoBEU1Gtfgxm/clip_525400_579500.mp3",
    "description": "Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy  John 8: 51-59 - 'Your father Abraham saw my day and was glad.'  Catechism of the Catholic Church Paragraphs: - 473 (in 'Christ's Soul and his human knowledge') - But at the same time, this truly human knowledge of God's Son expressed the divine life of his person. \"The human nature of God's Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.\" Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father (abbreviated). - 590 (in 'Jesus and Israel's faith in the one God and Saviour') - Only the divine identity of Jesus' person can justify so absolute a claim as \"He who is not with me is against me\"; and his saying that there was in him \"something greater than Jonah,. . . greater than Solomon\", something \"greater than the Temple\"; his reminder that David had called the Messiah his Lord, and his affirmations, \"Before Abraham was, I AM\", and even \"I and the Father are one.\" - 574 (in 'Jesus and Israel') - From the beginning of Jesus' public ministry, certain Pharisees and partisans of Herod together with priests and scribes agreed together to destroy him. Because of certain acts of his expelling demons, forgiving sins, healing on the sabbath day, his novel interpretation of the precepts of the Law regarding purity, and his familiarity with tax collectors and public sinners --some ill-intentioned persons suspected Jesus of demonic possession. He is accused of blasphemy and false prophecy, religious crimes which the Law punished with death by stoning.  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1150270,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7McDnyVU0OMTBlgW3uYqfr"
    },
    "href": "https://api.spotify.com/v1/episodes/7McDnyVU0OMTBlgW3uYqfr",
    "html_description": "<p>Want to support the  ministry and get access to exclusive content? Go to: http://patreon.com/logicalbiblestudy</p><br/><p><br /></p><br/><p>John 8: 51-59 - &#39;Your father Abraham saw my day and was glad.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 473 (in &#39;Christ&#39;s Soul and his human knowledge&#39;) - But at the same time, this truly human knowledge of God&#39;s Son expressed the divine life of his person. &#34;The human nature of God&#39;s Son, not by itself but by its union with the Word, knew and showed forth in itself everything that pertains to God.&#34; Such is first of all the case with the intimate and immediate knowledge that the Son of God made man has of his Father (abbreviated).</p><br/><p>- 590 (in &#39;Jesus and Israel&#39;s faith in the one God and Saviour&#39;) - Only the divine identity of Jesus&#39; person can justify so absolute a claim as &#34;He who is not with me is against me&#34;; and his saying that there was in him &#34;something greater than Jonah,. . . greater than Solomon&#34;, something &#34;greater than the Temple&#34;; his reminder that David had called the Messiah his Lord, and his affirmations, &#34;Before Abraham was, I AM&#34;, and even &#34;I and the Father are one.&#34;</p><br/><p>- 574 (in &#39;Jesus and Israel&#39;) - From the beginning of Jesus&#39; public ministry, certain Pharisees and partisans of Herod together with priests and scribes agreed together to destroy him. Because of certain acts of his expelling demons, forgiving sins, healing on the sabbath day, his novel interpretation of the precepts of the Law regarding purity, and his familiarity with tax collectors and public sinners --some ill-intentioned persons suspected Jesus of demonic possession. He is accused of blasphemy and false prophecy, religious crimes which the Law punished with death by stoning.</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7McDnyVU0OMTBlgW3uYqfr",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 5 of Lent - John 8: 51-59",
    "release_date": "2023-03-29",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7McDnyVU0OMTBlgW3uYqfr"
}