{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/28O0gO2hWk3uKO2eivwzts/clip_591123_651123.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 6: 24-34 - 'Do not worry about tomorrow: your Holy Father knows your needs.'  Catechism of the Catholic Church Paragraphs: - 2113 (in 'Idolatry') - Idolatry not only refers to false pagan worship. It remains a constant temptation to faith. Idolatry consists in divinizing what is not God. Man commits idolatry whenever he honors and reveres a creature in place of God, whether this be gods or demons (for example, satanism), power, pleasure, race, ancestors, the state, money, etc. Jesus says, \"You cannot serve God and mammon.\" Many martyrs died for not adoring \"the Beast\" refusing even to simulate such worship. Idolatry rejects the unique Lordship of God; it is therefore incompatible with communion with God. - 2424 (in 'The Social Doctrine of the Church') - A theory that makes profit the exclusive norm and ultimate end of economic activity is morally unacceptable. The disordered desire for money cannot but produce perverse effects. It is one of the causes of the many conflicts which disturb the social order. A system that \"subordinates the basic rights of individuals and of groups to the collective organization of production\" is contrary to human dignity. Every practice that reduces persons to nothing more than a means of profit enslaves man, leads to idolizing money, and contributes to the spread of atheism. \"You cannot serve God and mammon.\" - 2729 (in 'Facing Difficulties in Prayer') - The habitual difficulty in prayer is distraction. It can affect words and their meaning in vocal prayer; it can concern, more profoundly, him to whom we are praying, in vocal prayer (liturgical or personal), meditation, and contemplative prayer. To set about hunting down distractions would be to fall into their trap, when all that is necessary is to turn back to our heart: for a distraction reveals to us what we are attached to, and this humble awareness before the Lord should awaken our preferential love for him and lead us resolutely to offer him our heart to be purified. Therein lies the battle, the choice of which master to serve. - 2547 (in 'Poverty of Heart') - The Lord grieves over the rich, because they find their consolation in the abundance of goods. \"Let the proud seek and love earthly kingdoms, but blessed are the poor in spirit for theirs is the Kingdom of heaven.\" Abandonment to the providence of the Father in heaven frees us from anxiety about tomorrow (abbreviated). - 2830 (in 'Give us this day our daily bread') - \"Our bread\": the Father who gives us life cannot not but give us the nourishment life requires - all appropriate goods and blessings, both material and spiritual. In the Sermon on the Mount, Jesus insists on the filial trust that cooperates with our Father's providence. He is not inviting us to idleness, but wants to relieve us from nagging worry and preoccupation. Such is the filial surrender of the children of God: To those who seek the kingdom of God and his righteousness, he has promised to give all else besides. Since everything indeed belongs to God, he who possesses God wants for nothing, if he himself is not found wanting before God. - 2416 (in 'Respect for the Integrity of Creation') - Animals are God's creatures. He surrounds them with his providential care. By their mere existence they bless him and give him glory (abbreviated). - 305 (in 'Divine Providence') - 1942 (in 'Human Solidarity') - 2632 (in 'Prayer of Petition') - 2659 (in 'Today')  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 2185044,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7oN1JHDFgZu7sUWlBt5zGl"
    },
    "href": "https://api.spotify.com/v1/episodes/7oN1JHDFgZu7sUWlBt5zGl",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 6: 24-34 - &#39;Do not worry about tomorrow: your Holy Father knows your needs.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 2113 (in &#39;Idolatry&#39;) - Idolatry not only refers to false pagan worship. It remains a constant temptation to faith. Idolatry consists in divinizing what is not God. Man commits idolatry whenever he honors and reveres a creature in place of God, whether this be gods or demons (for example, satanism), power, pleasure, race, ancestors, the state, money, etc. Jesus says, &#34;You cannot serve God and mammon.&#34; Many martyrs died for not adoring &#34;the Beast&#34; refusing even to simulate such worship. Idolatry rejects the unique Lordship of God; it is therefore incompatible with communion with God.</p><br/><p>- 2424 (in &#39;The Social Doctrine of the Church&#39;) - A theory that makes profit the exclusive norm and ultimate end of economic activity is morally unacceptable. The disordered desire for money cannot but produce perverse effects. It is one of the causes of the many conflicts which disturb the social order. A system that &#34;subordinates the basic rights of individuals and of groups to the collective organization of production&#34; is contrary to human dignity. Every practice that reduces persons to nothing more than a means of profit enslaves man, leads to idolizing money, and contributes to the spread of atheism. &#34;You cannot serve God and mammon.&#34;</p><br/><p>- 2729 (in &#39;Facing Difficulties in Prayer&#39;) - The habitual difficulty in prayer is distraction. It can affect words and their meaning in vocal prayer; it can concern, more profoundly, him to whom we are praying, in vocal prayer (liturgical or personal), meditation, and contemplative prayer. To set about hunting down distractions would be to fall into their trap, when all that is necessary is to turn back to our heart: for a distraction reveals to us what we are attached to, and this humble awareness before the Lord should awaken our preferential love for him and lead us resolutely to offer him our heart to be purified. Therein lies the battle, the choice of which master to serve.</p><br/><p>- 2547 (in &#39;Poverty of Heart&#39;) - The Lord grieves over the rich, because they find their consolation in the abundance of goods. &#34;Let the proud seek and love earthly kingdoms, but blessed are the poor in spirit for theirs is the Kingdom of heaven.&#34; Abandonment to the providence of the Father in heaven frees us from anxiety about tomorrow (abbreviated).</p><br/><p>- 2830 (in &#39;Give us this day our daily bread&#39;) - &#34;Our bread&#34;: the Father who gives us life cannot not but give us the nourishment life requires - all appropriate goods and blessings, both material and spiritual. In the Sermon on the Mount, Jesus insists on the filial trust that cooperates with our Father&#39;s providence. He is not inviting us to idleness, but wants to relieve us from nagging worry and preoccupation. Such is the filial surrender of the children of God: To those who seek the kingdom of God and his righteousness, he has promised to give all else besides. Since everything indeed belongs to God, he who possesses God wants for nothing, if he himself is not found wanting before God.</p><br/><p>- 2416 (in &#39;Respect for the Integrity of Creation&#39;) - Animals are God&#39;s creatures. He surrounds them with his providential care. By their mere existence they bless him and give him glory (abbreviated).</p><br/><p>- 305 (in &#39;Divine Providence&#39;)</p><br/><p>- 1942 (in &#39;Human Solidarity&#39;)</p><br/><p>- 2632 (in &#39;Prayer of Petition&#39;)</p><br/><p>- 2659 (in &#39;Today&#39;)</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7oN1JHDFgZu7sUWlBt5zGl",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Saturday of Week 11 in Ordinary Time - Matt 6: 24-34",
    "release_date": "2023-06-23",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7oN1JHDFgZu7sUWlBt5zGl"
}