{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/4qTkyO5Whrv50PRFTODUbd/clip_412300_467000.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  Luke 10: 21-24 - 'No one knows who the Son is except the Father.'  Catechism of the Catholic Church Paragraphs: - 787 (in 'The Church is communion with Jesus') - From the beginning, Jesus associated his disciples with his own life, revealed the mystery of the Kingdom to them, and gave them a share in his mission, joy, and sufferings (abbreviated). - 2603 (in 'Jesus Prays') - The evangelists have preserved two more explicit prayers offered by Christ during his public ministry. Each begins with thanksgiving. In the first, Jesus confesses the Father, acknowledges, and blesses him because he has hidden the mysteries of the Kingdom from those who think themselves learned and has revealed them to infants, the poor of the Beatitudes. His exclamation, \"Yes, Father!\" expresses the depth of his heart, his adherence to the Father's \"good pleasure,\" echoing his Father's house.\" Here the newness of prayer in the fullness of time begins to be revealed: his filial prayer, which the Father awaits from his children, is finally going to be lived out by the only Son in his humanity, with and for men. - 1083 (in 'The Father - Source & Goal of the Liturgy') - The dual dimension of the Christian liturgy as a response of faith and love to the spiritual blessings the Father bestows on us is thus evident. On the one hand, the Church, united with her Lord and \"in the Holy Spirit, blesses the Father \"for his inexpressible gift in her adoration, praise, and thanksgiving. On the other hand, until the consummation of God's plan, the Church never ceases to present to the Father the offering of his own gifts and to beg him to send the Holy Spirit upon that offering, upon herself, upon the faithful, and upon the whole world, so that through communion in the death and resurrection of Christ the Priest, and by the power of the Spirit, these divine blessings will bring forth the fruits of life \"to the praise of his glorious grace.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1000803,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7otNxmeVaitOZDaFxV7wJN"
    },
    "href": "https://api.spotify.com/v1/episodes/7otNxmeVaitOZDaFxV7wJN",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Luke 10: 21-24 - &#39;No one knows who the Son is except the Father.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 787 (in &#39;The Church is communion with Jesus&#39;) - From the beginning, Jesus associated his disciples with his own life, revealed the mystery of the Kingdom to them, and gave them a share in his mission, joy, and sufferings (abbreviated).</p><br/><p>- 2603 (in &#39;Jesus Prays&#39;) - The evangelists have preserved two more explicit prayers offered by Christ during his public ministry. Each begins with thanksgiving. In the first, Jesus confesses the Father, acknowledges, and blesses him because he has hidden the mysteries of the Kingdom from those who think themselves learned and has revealed them to infants, the poor of the Beatitudes. His exclamation, &#34;Yes, Father!&#34; expresses the depth of his heart, his adherence to the Father&#39;s &#34;good pleasure,&#34; echoing his Father&#39;s house.&#34; Here the newness of prayer in the fullness of time begins to be revealed: his filial prayer, which the Father awaits from his children, is finally going to be lived out by the only Son in his humanity, with and for men.</p><br/><p>- 1083 (in &#39;The Father - Source &amp; Goal of the Liturgy&#39;) - The dual dimension of the Christian liturgy as a response of faith and love to the spiritual blessings the Father bestows on us is thus evident. On the one hand, the Church, united with her Lord and &#34;in the Holy Spirit, blesses the Father &#34;for his inexpressible gift in her adoration, praise, and thanksgiving. On the other hand, until the consummation of God&#39;s plan, the Church never ceases to present to the Father the offering of his own gifts and to beg him to send the Holy Spirit upon that offering, upon herself, upon the faithful, and upon the whole world, so that through communion in the death and resurrection of Christ the Priest, and by the power of the Spirit, these divine blessings will bring forth the fruits of life &#34;to the praise of his glorious grace.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7otNxmeVaitOZDaFxV7wJN",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Tuesday of Week 1 of Advent - Luke 10: 21-24",
    "release_date": "2023-12-04",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7otNxmeVaitOZDaFxV7wJN"
}