{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/0ofVMq9ScKDafPdwQJmmrG/clip_200200_256600.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p  John 10: 11-18 -'The good shepherd is the one who lays down his life for his sheep.'  Catechism of the Catholic Church Paragraphs: - 764 (in 'The Church - Instituted by Jesus Christ') - \"This Kingdom shines out before men in the word, in the works and in the presence of Christ.\" To welcome Jesus' word is to welcome \"the Kingdom itself.\" The seed and beginning of the Kingdom are the \"little flock\" of those whom Jesus came to gather around him, the flock whose shepherd he is. They form Jesus' true family. To those whom he thus gathered around him, he taught a new \"way of acting\" and a prayer of their own. - 754 (in 'Symbols of the Church') - \"The Church is, accordingly, a sheepfold, the sole and necessary gateway to which is Christ. It is also the flock of which God himself foretold that he would be the shepherd, and whose sheep, even though governed by human shepherds, are unfailingly nourished and led by Christ himself, the Good Shepherd and Prince of Shepherds, who gave his life for his sheep. - 553 (in 'The Keys of the Kingdom') - The \"power of the keys\" designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: \"Feed my sheep\" (abbreviated). - 60 (in 'God Chooses Abraham') - The people descended from Abraham would be the trustee of the promise made to the patriarchs, the chosen people, called to prepare for that day when God would gather all his children into the unity of the Church. They would be the root on to which the Gentiles would be grafted, once they came to believe. - 606 (in 'Christ's whole life is an offering to the Father') - The sacrifice of Jesus \"for the sins of the whole world\" expresses his loving communion      with the Father. \"The Father loves me, because I lay down my life\", said the Lord, \"(for) I do as the Father has commanded me, so that the world may know that I love the Father\" (abbreviated). - 609 (in 'Jesus freely embraced the Father's redeeming love') - By embracing in his human heart the Father's love for men, Jesus \"loved them to the end\", for \"greater love has no man than this, that a man lay down his life for his friends.\" In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: \"No one takes [my life] from me, but I lay it down of my own accord.\" Hence the sovereign freedom of God's Son as he went out to his death. - 649 (in 'The Resurrection - A Work of the Holy Trinity') - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise. Elsewhere he affirms explicitly: \"I lay down my life, that I may take it again. . . I have power to lay it down, and I have power to take it again.\" \"We believe that Jesus died and rose again.\"  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1697169,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7tGES0KLa2TnE6HUOAWmjv"
    },
    "href": "https://api.spotify.com/v1/episodes/7tGES0KLa2TnE6HUOAWmjv",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠⁠http://patreon.com/logicalbiblestudy⁠⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>John 10: 11-18 -&#39;The good shepherd is the one who lays down his life for his sheep.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 764 (in &#39;The Church - Instituted by Jesus Christ&#39;) - &#34;This Kingdom shines out before men in the word, in the works and in the presence of Christ.&#34; To welcome Jesus&#39; word is to welcome &#34;the Kingdom itself.&#34; The seed and beginning of the Kingdom are the &#34;little flock&#34; of those whom Jesus came to gather around him, the flock whose shepherd he is. They form Jesus&#39; true family. To those whom he thus gathered around him, he taught a new &#34;way of acting&#34; and a prayer of their own.</p><br/><p>- 754 (in &#39;Symbols of the Church&#39;) - &#34;The Church is, accordingly, a sheepfold, the sole and necessary gateway to which is Christ. It is also the flock of which God himself foretold that he would be the shepherd, and whose sheep, even though governed by human shepherds, are unfailingly nourished and led by Christ himself, the Good Shepherd and Prince of Shepherds, who gave his life for his sheep.</p><br/><p>- 553 (in &#39;The Keys of the Kingdom&#39;) - The &#34;power of the keys&#34; designates authority to govern the house of God, which is the Church. Jesus, the Good Shepherd, confirmed this mandate after his Resurrection: &#34;Feed my sheep&#34; (abbreviated).</p><br/><p>- 60 (in &#39;God Chooses Abraham&#39;) - The people descended from Abraham would be the trustee of the promise made to the patriarchs, the chosen people, called to prepare for that day when God would gather all his children into the unity of the Church. They would be the root on to which the Gentiles would be grafted, once they came to believe.</p><br/><p>- 606 (in &#39;Christ&#39;s whole life is an offering to the Father&#39;) - The sacrifice of Jesus &#34;for the sins of the whole world&#34; expresses his loving communion      with the Father. &#34;The Father loves me, because I lay down my life&#34;, said the Lord, &#34;(for) I do as the Father has commanded me, so that the world may know that I love the Father&#34; (abbreviated).</p><br/><p>- 609 (in &#39;Jesus freely embraced the Father&#39;s redeeming love&#39;) - By embracing in his human heart the Father&#39;s love for men, Jesus &#34;loved them to the end&#34;, for &#34;greater love has no man than this, that a man lay down his life for his friends.&#34; In suffering and death his humanity became the free and perfect instrument of his divine love which desires the salvation of men. Indeed, out of love for his Father and for men, whom the Father wants to save, Jesus freely accepted his Passion and death: &#34;No one takes [my life] from me, but I lay it down of my own accord.&#34; Hence the sovereign freedom of God&#39;s Son as he went out to his death.</p><br/><p>- 649 (in &#39;The Resurrection - A Work of the Holy Trinity&#39;) - As for the Son, he effects his own Resurrection by virtue of his divine power. Jesus announces that the Son of man will have to suffer much, die, and then rise. Elsewhere he affirms explicitly: &#34;I lay down my life, that I may take it again. . . I have power to lay it down, and I have power to take it again.&#34; &#34;We believe that Jesus died and rose again.&#34;</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7tGES0KLa2TnE6HUOAWmjv",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8a2cd291d28eac430f911845c0",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1f2cd291d28eac430f911845c0",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68d2cd291d28eac430f911845c0",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Monday of Week 4 of Eastertide (Year A) - John 10: 11-18",
    "release_date": "2023-04-30",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7tGES0KLa2TnE6HUOAWmjv"
}