{
    "audio_preview_url": "https://podz-content.spotifycdn.com/audio/clips/6XGRiT1IIugJ5VqmJBk9I5/clip_806700_863100.mp3",
    "description": "To support the ministry and access exclusive content, go to: ⁠⁠http://patreon.com/logicalbiblestudy⁠⁠ For complete verse-by-verse audio commentaries from Logical Bible Study, go to: ⁠⁠https://mysoundwise.com/publishers/1677296682850p  Matthew 10: 7-15 - 'You received without charge: give without charge.'  Catechism of the Catholic Church Paragraphs: - 1509 (in 'Heal the Sick') - \"Heal the sick!\" The Church has received this charge from the Lord and strives to carry it out by taking care of the sick as well as by accompanying them with her prayer of intercession. She believes in the life-giving presence of Christ, the physician of souls and bodies. This presence is particularly active through the sacraments, and in an altogether special way through the Eucharist, the bread that gives eternal life and that St. Paul suggests is connected with bodily health. - 2121-2122 (in 'Irreligion') - Peter thus held to the words of Jesus: \"You received without pay, give without pay.\" It is impossible to appropriate to oneself spiritual goods and behave toward them as their owner or master, for they have their source in God. One can receive them only from him, without payment...The minister should ask nothing for the administration of the sacraments beyond the offerings defined by the competent authority, always being careful that the needy are not deprived of the help of the sacraments because of their poverty.\" The competent authority determines these \"offerings\" in accordance with the principle that the Christian people ought to contribute to the support of the Church's ministers. \"The laborer deserves his food.\" (abbreviated). - 2443 (in 'Love for the Poor') - God blesses those who come to the aid of the poor and rebukes those who turn away from them: \"Give to him who begs from you, do not refuse him who would borrow from you\"; \"you received without pay, give without pay.\" It is by what they have done for the poor that Jesus Christ will recognize his chosen ones (abbreviated).  Got a Bible question? Send an email to logicalbiblestudy@gmail.com, and it will be answered in an upcoming episode!  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "duration_ms": 1327833,
    "explicit": false,
    "external_urls": {
        "spotify": "https://open.spotify.com/episode/7zwLffXT1qhlgRrhITLCsu"
    },
    "href": "https://api.spotify.com/v1/episodes/7zwLffXT1qhlgRrhITLCsu",
    "html_description": "<p>To support the ministry and access exclusive content, go to: <a href=\"https://www.patreon.com/logicalbiblestudy\" rel=\"nofollow\">⁠⁠http://patreon.com/logicalbiblestudy⁠⁠</a></p><br/><p>For complete verse-by-verse audio commentaries from Logical Bible Study, go to: <a href=\"https://mysoundwise.com/publishers/1677296682850p\" rel=\"nofollow\">⁠⁠https://mysoundwise.com/publishers/1677296682850p</a></p><br/><p><br /></p><br/><p>Matthew 10: 7-15 - &#39;You received without charge: give without charge.&#39;</p><br/><p><br /></p><br/><p>Catechism of the Catholic Church Paragraphs:</p><br/><p>- 1509 (in &#39;Heal the Sick&#39;) - &#34;Heal the sick!&#34; The Church has received this charge from the Lord and strives to carry it out by taking care of the sick as well as by accompanying them with her prayer of intercession. She believes in the life-giving presence of Christ, the physician of souls and bodies. This presence is particularly active through the sacraments, and in an altogether special way through the Eucharist, the bread that gives eternal life and that St. Paul suggests is connected with bodily health.</p><br/><p>- 2121-2122 (in &#39;Irreligion&#39;) - Peter thus held to the words of Jesus: &#34;You received without pay, give without pay.&#34; It is impossible to appropriate to oneself spiritual goods and behave toward them as their owner or master, for they have their source in God. One can receive them only from him, without payment...The minister should ask nothing for the administration of the sacraments beyond the offerings defined by the competent authority, always being careful that the needy are not deprived of the help of the sacraments because of their poverty.&#34; The competent authority determines these &#34;offerings&#34; in accordance with the principle that the Christian people ought to contribute to the support of the Church&#39;s ministers. &#34;The laborer deserves his food.&#34; (abbreviated).</p><br/><p>- 2443 (in &#39;Love for the Poor&#39;) - God blesses those who come to the aid of the poor and rebukes those who turn away from them: &#34;Give to him who begs from you, do not refuse him who would borrow from you&#34;; &#34;you received without pay, give without pay.&#34; It is by what they have done for the poor that Jesus Christ will recognize his chosen ones (abbreviated).</p><br/><p><br /></p><br/><p>Got a Bible question? Send an email to logicalbiblestudy&#64;gmail.com, and it will be answered in an upcoming episode!</p><br/>--- <br/>Send in a voice message: https://podcasters.spotify.com/pod/show/daily-gospel-exegesis/message",
    "id": "7zwLffXT1qhlgRrhITLCsu",
    "images": [
        {
            "height": 640,
            "url": "https://i.scdn.co/image/ab6765630000ba8aa10898a57fb4740a3aa6ef3f",
            "width": 640
        },
        {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67656300005f1fa10898a57fb4740a3aa6ef3f",
            "width": 300
        },
        {
            "height": 64,
            "url": "https://i.scdn.co/image/ab6765630000f68da10898a57fb4740a3aa6ef3f",
            "width": 64
        }
    ],
    "is_externally_hosted": false,
    "is_playable": true,
    "language": "en",
    "languages": [
        "en"
    ],
    "name": "Thursday of Week 14 in Ordinary Time - Matt 10: 7-15",
    "release_date": "2023-07-12",
    "release_date_precision": "day",
    "resume_point": {
        "fully_played": false,
        "resume_position_ms": 0
    },
    "type": "episode",
    "uri": "spotify:episode:7zwLffXT1qhlgRrhITLCsu"
}